{
    "code": 200,
    "status": "Success",
    "Message": "Successfully Fetched the Receipes List",
    "receipe_data": [
        {
            "Title": "Eggless Banana Bread Recipe (+ Vegan & Whole Wheat)",
            "Ingredients": "4, bananas, ripe or overripe, medium sized – 300 grams (with peels), ½, cup, raw sugar, or brown sugar or granulated white sugar, ½, cup, sunflower oil, or coconut oil or any neutral flavored oil, ¼, teaspoon, cinnamon powder, (ground cinnamon) – optional, 2 to 3, pinches, grated nutmeg, or ⅛ teaspoon ground nutmeg powder – optional, ½, teaspoon, vanilla powder, or 1 teaspoon vanilla extract, 1.5, cups, whole wheat flour, – 180 grams, 1.5, teaspoon, baking powder, ½, teaspoon, baking soda, 1, pinch, salt, – optional, 1 to 2, tablespoons, sunflower seeds, – optional",
            "Instructions": [
                "Preheat the oven to 180 degrees Celsius (350 degrees Fahrenheit) for 20 minutes.",
                "Grease a bread loaf tin or a rectangular cake pan with oil. You can use the rectangular cake pan of size ( 7.5 x 4 x 2.5 inches) or round cake pan (7.5 x 2 inches).",
                "Mash the bananas well with a vegetable masher or puree them with a hand blender or a regular blender.",
                "Now add the oil, vanilla, cinnamon powder, nutmeg powder to the banana. Mix thoroughly with a wired whisk or spatula so that the oil is mixed evenly with the banana puree.",
                "Sieve the whole wheat flour with baking soda, baking powder, salt directly in the bowl containing the mashed bananas.",
                "Now fold the dry ingredients into the wet ingredients. Do not mix. Do this cut and folding technique properly, so that all the ingredients are mixed evenly.",
                "This folding step is important as you want the whole bread mixture to be one and mixed evenly.",
                "Keep in mind not to overwork the batter as this will result in gluten strands being formed in the batter, that will make for a doughy texture in the bread. The batter should have volume and not look flat or stringy.",
                "If the batter looks very thick or dry then add about  ¼ to ⅓ cup of water or preferred nut milk and gently fold again.",
                "Lastly add the sunflower seeds and fold once again.",
                "Bake at 180 degrees Celsius (350 degrees Fahrenheit) for 30 to 40 minutes or till a toothpick or a bambook skewer inserted in the bread comes out clean.",
                "The timing varies from oven to oven. Depending on the temperature in your oven and the size of your pan, the bread might take less or more time than mentioned here.",
                "So take your call and keep an eye on the bread. However don't open the oven untill the bread is ¾ done.",
                "The benchmark is that a tooth pick inserted in the bread should come out clean.",
                "Place the loaf pan on a wired rack for it to cool. When the bread cools down, gently remove the banana bread from the pan.",
                "Slice and serve banana bread.",
                "The remaining banana loaf, you can wrap in a cling film or keep in a box in the fridge. You can choose to warm the banana bread before serving."
            ],
            "Description": "This Banana Bread is by far the best vegan Banana Loaf recipe I have come up with, and I have made a lot of bread! Eggless and made with wholemeal flour, this delicious banana bread is light, soft, and perfectly sweet. One of my most popular baking recipes tried successfully by many of our readers.",
            "Prep Time": "5 minutes",
            "Cook Time": "40 minutes",
            "Total Time": "45 minutes",
            "Cuisine": "World",
            "Course": "Breakfast, Brunch"
        },
        {
            "Title": "Sweet Appam | Banana Appam",
            "Ingredients": "1.5, cups, – 240 grams, ½, cup, chopped jaggery, – 100 to 105 grams, 1.5, cups, water, 3, bananas, (small to medium-sized), 250 grams bananas – mashed very well or pureed, ¼, cup, chopped coconut, – optional, 2, teaspoons, – for frying the coconut, can also use coconut oil or sunflower oil, 2, teaspoons, black sesame seeds, – can also add white sesame seeds, ½, teaspoon, green cardamom powder, ½, teaspoon, ginger powder, (ground ginger) – optional, ¼, teaspoon, cumin powder, (ground cumin) – optional, ½, teaspoon, baking soda, – optional, ½ to 1, teaspoon, – to add in each mould or add as required",
            "Instructions": [
                "First chop the jaggery. You should be able to get ½ cup chopped jaggery. You can also use jaggery powder, instead of chopped jaggery.",
                "Now chop a small piece of coconut in small bits. You will need about ¼ cup chopped coconut. You can even use grated coconut or you can skip coconut altogether.",
                "Stir often and saute them till they are light golden. Keep aside.",
                "In a pan, peel and chop the bananas. Mash the bananas with a fork or masher very well.",
                "Add green cardamom powder, ginger powder and cumin powder.",
                "Mix very well. To the bowl containing the jaggery solution, add the rice flour.",
                "Add black sesame seeds. You can also use white sesame seeds.",
                "Add the baking soda. Baking soda makes the texture more porous and soft. If you want you can skip too.",
                "Mix thoroughly.",
                "Heat the appe pan and add ½ to 1 teaspoon ghee in each mould. Instead of ghee you can use coconut oil too.",
                "With a spoon, pour the batter till ¾ᵗʰ  or more than ¾ᵗʰ of the volume in each mould.",
                "Keep the heat to low or medium and cook the sweet appams.",
                "With a wooden/bamboo stick or skewer, turn over the banana appam which have become golden.",
                "When the rest of the sweet appam are golden, turn them over too and cook all of them till crisp and golden.",
                "Once done remove and place them in a casserole. In the casserole they stay warm for some time.",
                "Same way prepare the remaining ones. You can store them in an air tight box or container in the fridge.",
                "Serve Sweet Appam hot or warm or at room temperature."
            ],
            "Description": "This time, I’ve got an easy-peasy South Indian style snack recipe for you, which is not just sumptuous but also quite nutritious – the Sweet Appam. Also known as the Banana Appam or Banana Paniyaram these are sweetish appams made with ripe bananas, rice flour and jaggery. Somewhat similar to the instant wheat appam, with the difference being in the type of flour used in both. One obviously is whole wheat flour and the other one is rice flour. Apart from this, the composition is more or less same. Try this one too!",
            "Prep Time": "20 minutes",
            "Cook Time": "30 minutes",
            "Total Time": "50 minutes",
            "Cuisine": "South Indian",
            "Course": "Snacks, Sweets"
        },
        {
            "Title": "Methi na Gota Recipe",
            "Ingredients": "1 or 1.25, cups, besan, (gram flour), 1, cup, methi leaves, (fenugreek leaves), 1, banana, – ripe, medium-sized, ¼, teaspoon, turmeric powder, ¼ to ½, teaspoon, red chili powder, 1, teaspoon, white sesame seeds, 8 to 10, whole black pepper, – crushed, ½, teaspoon, coriander seeds, – crushed, 2, pinches, of asafoetida, (hing), 2 to 3, pinches, baking soda, or ¼ teaspoon baking soda, 2, teaspoons, oil, – to add to the batter, 1 to 2, tablespoons, water, or as needed, 1, green chili, + 1 inch ginger, crushed into a paste in a mortar and pestle, ½, teaspoon, sugar, – optional, salt, as required, oil, as required for deep frying",
            "Instructions": [
                "Rinse a few times in water. Drain all the water and then chop the methi leaves finely.",
                "Mash the banana in a bowl to a fine texture. Add the methi leaves to it.",
                "Add all the ingredients including the 2 teaspoons of oil.",
                "Add very little water, about 1 or 2 tablespoons and make a thick batter, like a thick cake batter.",
                "Keep this batter covered aside for 30 minutes.",
                "The batter should be of medium to medium-thick and smooth, flowing consistency.",
                "If the batter is still thick then you can add a few teaspoons of water.",
                "When the oil is medium hot. Drop the batter from 1 tablespoon measuring spoon into the hot oil.",
                "Fry the methi na gota till golden and crispy all over.",
                "Drain the fritters on paper towels to remove excess oil. This way finish up the batter by frying in batches.",
                "Serve Methi na Gota hot with any green chutney or tomato ketchup."
            ],
            "Description": "Methi na Gota is a Gujarati deep fried snack of savory and spiced fritters. Basically these fritters are made with besan a.k.a gram flour, fenugreek leaves (methi), banana, spices and herbs. These tasty snack is usually served as a snack during tea time.",
            "Prep Time": "45 minutes",
            "Cook Time": "20 minutes",
            "Total Time": "65 minutes",
            "Cuisine": "Gujarati",
            "Course": "Snacks"
        },
        {
            "Title": "Mangalore Buns (Sweet Banana Buns)",
            "Ingredients": "1, banana, medium-sized robusta banana or any variety, preferably overripe, 3, tablespoons, raw sugar, or jaggery powder, add as required, ½, teaspoon, cumin powder, (ground cumin), 1, pinch, salt, – optional, 2, pinches, baking soda, – a pinch here refers to the pinch between the thumb and forefinger and not a chef's pinch, 1 to 2, tablespoons, (yogurt), 1.5, cups, whole wheat flour, or all purpose flour or use half-half of both, 1, teaspoon, or oil, oil, as required for deep frying",
            "Instructions": [
                "Add the flour (whole wheat flour or all purpose flour or mix of both), 1 tablespoon curd (yogurt), salt, ghee, baking soda and cumin powder to the banana puree.",
                "If you can knead with 1 tablespoon curd, then fine. If the mixture looks dry or floury, then add 1 tablespoon curd again and knead. The quantity of curd required depends on the type and quality of flour. I used 2 tablespoons of curd to knead the dough.",
                "Keep the dough covered in a bowl for 3 to 4 hours at room temperature or refrigerate the dough overnight or for 7 to 8 hours. You can spread some oil on the outer surface of dough so that it does not become dry while resting.",
                "Lightly knead the dough the next morning or after you have kept it for 3 to 4 hours.",
                "Take small to medium sized balls from the dough and roll into round circle or poori having about 4 inch diameter. Don't roll them thin but keep medium thickness.",
                "This way roll all the banana poori and arrnage them in a tray or plate without touching each other. Keep them covered with a kitchen towel until you begin to fry them.",
                "Heat any neutral flavored oil for deep frying. Keep the heat to medium to medium high.",
                "When the oil becomes medium hot, gently slid each poori in the oil. When the poori puffs up and become golden from one side then turn over gently using a slotted spoon.",
                "Fry the second side until golden and crisp. Turn over a few times if required for even cooking and color.",
                "While frying, take care that the banana buns does not break in oil otherwise they soak lot of oil.",
                "Remove them with a slotted spoon and drain on paper napkins to remove excess oil. Fry the remaining buns this way.",
                "Serve the mangalore buns, hot or warm plain or with milk or a cup of tea of coffee."
            ],
            "Description": "Mangalore buns are sweet fried bread made with mashed bananas, flour, sugar and spiced with a touch of ground cumin. These sweet banana buns or poori as they are known is a specialty dish from the Mangalore region in Karnataka. They are a few ways to make them and they are traditionally made with all-purpose flour. I share a recipe made with whole wheat flour.",
            "Prep Time": "10 minutes",
            "Cook Time": "30 minutes",
            "Total Time": "40 minutes",
            "Cuisine": "Indian, Mangalorean",
            "Course": "Sweets"
        },
        {
            "Title": "Gulgule Recipe | Pua Recipe (Gulgula)",
            "Ingredients": "½, cup, bananas, (chopped) or 1 small banana, 6, tablespoons, raw sugar, or white sugar or jaggery – add as per taste, 1, cup, whole wheat flour, 1, teaspoon, fennel seeds, ¼, teaspoon, green cardamom powder, – optional, 1, pinch, salt, – pink salt or regular salt, ½, teaspoon, baking powder, 8 to 11, tablespoons, water, or add as required,, oil, as required, for deep frying",
            "Instructions": [
                "Take chopped bananas and sugar in a mixing bowl. Mash very well with a fork or vegetable masher. Mix the sugar with the bananas as you go on mashing and ensure that the sugar granules dissolve.",
                "Add the wheat flour, fennel seeds, cardamom powder and salt to the mashed banana and sugar mixture.",
                "Add half a cup of water first. Mix well and add more water if required to make a batter that is neither too thick nor too thin.",
                "The batter should be slightly thicker than a pakoda batter.",
                "In a deep pan or wok or kadai heat oil. Let the oil become hot.",
                "Drop spoonfuls of the batter in the hot oil. Fry the gulgule on a medium heat.",
                "Do not overcrowd the pan. You can easily fry 8 to 12 gulgule at a time depending on the size of the pan or kadai.",
                "The gulgule will puff while frying. When one side is light golden, gently turn over and fry the other side.",
                "Keep on turning and frying them till they are golden brown. Remove them and place on kitchen paper towels for the extra oil to be absorbed.",
                "When frying, they may stick, but get separated once browned.",
                "Serve the Gulgule or Pua hot or warm with Indian chai."
            ],
            "Description": "Sweet, tender on the inside, and crispy on the outside, these Gulgule (singular gulgula) are fennel-scented deep-fried balls of deliciousness from the North Indian cuisine. These fluffy, doughnut like treats are soft and fluffy, perfect for serving with your afternoon cup of",
            "Prep Time": "5 minutes",
            "Cook Time": "20 minutes",
            "Total Time": "25 minutes",
            "Cuisine": "North Indian, Punjabi",
            "Course": "Snacks, Sweets"
        },
        {
            "Title": "Unniyappam Recipe | Unni Appam",
            "Ingredients": "1, cup, rice, or 200 grams rice – use any type of short grained rice, water as required, ½, tablespoon, oil, for frying coconut, 3, tablespoons, chopped fresh coconut, 2, medium sized banana, or 175 grams bananas (with their peels) or ¾ cup chopped bananas, 1, teaspoon, black sesame seeds, ½, cup, jaggery powder, or add as required, ¼, cup, water, or add as required, 3 to 4, green cardamoms, ½, teaspoon, cumin powder, ½, teaspoon, dry ginger powder, ¼, teaspoon, baking soda, – you can also add ⅛ teaspoon baking soda (about 2 pinches), ½ to 1, teaspoon, coconut oil, or ghee for each mould",
            "Instructions": [
                "Rinse 1 cup rice in water a couple of times. Then soak rice in enough water for 3 to 4 hours. You can even soak rice overnight if you want.",
                "Later drain all the water and add the soaked rice in a grinder jar.",
                "Add ¾ cup chopped bananas, ½ cup jaggery powder or grated jaggery and seeds from 3 to 4 green cardamoms.",
                "For a more sweet taste you can add ¾ cup jaggery.",
                "Then add ¼ cup water or add as required.",
                "Grind till you get a fine rava like consistency in the rice grains. The batter should be ground to a semi-fine consistency.",
                "Now pour the batter in another bowl or pan. Keep aside.",
                "Next heat ½ tablespoon coconut oil or ghee in a small pan or tadka pan. Add 3 tablespoons chopped coconut pieces. Chop the coconut in small pieces.",
                "Stirring often fry the coconut pieces till they become golden.",
                "Add the fried coconut pieces along with the remaining oil in the batter.",
                "Then add 1 teaspoon black sesame seeds, ½ teaspoon cumin powder, ½ teaspoon dry ginger powder, ¼ teaspoon baking soda. You can also add a pinch of salt if you want. Baking soda can be skipped too, but adding them makes the appams have a soft texture.",
                "Mix very well.",
                "Now heat the appe chatti pan. Add ½ to 1 teaspoon coconut oil in each mould. Keep the flame to a low.",
                "When the oil becomes hot, with a spoon pour batter in the chatti moulds till ¾ of each mould.",
                "On a low to medium-low flame cook till the base is golden and crisp.",
                "Then turn over each unniyapam with a wooden skewer or stick.",
                "You can turn over a couple of times more for even cooking.",
                "Once golden and crisp from all sides, then place the unni appams on kitchen paper towels. Prepare unniappam with the remaining batter in the same way. If there is oil in the moulds, then no need to add extra oil.",
                "Serve unniappam warm or at room temperature as a sweet snack. You can even place them in a casserole. In the casserole these appams stay warm for some time.",
                "The recipe makes for 28 unniyappam. These stay good at room temperature for 1 to 2 days. You can even refrigerate them."
            ],
            "Description": "Unniyappam recipe with step by step pics. Unniyappam or Unni Appam are sweet fritters made with rice, banana, a few spices and coconut. This sweet snack is a popular one in the scenic state of Kerala in South India. This Unniyappam Recipe is quite a nutritious preparation, and is gluten free as well as vegan-friendly too.",
            "Prep Time": "20 minutes",
            "Cook Time": "30 minutes",
            "Total Time": "50 minutes",
            "Cuisine": "Kerala, South Indian",
            "Course": "Sweets"
        },
        {
            "Title": "Fruit Raita",
            "Ingredients": "½, cup, (yogurt), cold or chilled – dairy or vegan, 1, pomegranate, (small to medium-sized) – sliced and the arils removed, 1, apple, (medium-sized) – peeled, cored and chopped, 1, banana, (medium-sized) – peeled and chopped, 2 to 3, tablespoons, raw sugar, or add as required, ¼, teaspoon, roasted cumin powder, 1 to 2, pinches, rock salt, (edible and food grade), or black salt, 1 to 2, pinches, red chilli powder, or cayenne pepper",
            "Instructions": [
                "In a bowl, whisk the yogurt (curd) till smooth. Use the curd that is fresh and it should not be sour tasting.",
                "Add sugar or as required.",
                "Mix the sugar well, till it dissolves.",
                "Next add roasted cumin powder, 1 pinch of red chili powder and 1 pinch of rock salt.",
                "Stir well.",
                "Lastly add the chopped banana, apple and pomegranate arils.",
                "Mix well.",
                "You can garnish the raita with pomegranate arils or mint leaves if you like.",
                "Serve the fruit raita immediately."
            ],
            "Description": "There’s so much that you can actually do with fruits. Other than munching on them as a healthy snack, you can make a variety of dishes like this Fruit Raita. This is basically a popular preparation enjoyed as a side dish, made with yogurt, fresh fruits, spices and seasonings. You must’ve had many other",
            "Prep Time": "15 minutes",
            "Cook Time": "",
            "Total Time": "",
            "Cuisine": "North Indian",
            "Course": "Desserts, Side Dish"
        },
        {
            "Title": "Pazham Pori | Banana Fritters",
            "Ingredients": "300, grams, ripe firm bananas, or 2 to 3 medium to large ripe bananas or nendram pazham, ½, cup, all purpose flour, 1, tablespoon, – optional, 1, tablespoon, sugar, – optional, 1, pinch, turmeric powder, 1, pinch, baking soda, ⅓, cup, water, or add as required, oil as required,, for deep frying",
            "Instructions": [
                "In a mixing bowl, take ½ cup maida, 1 tablespoon sugar (optional), a pinch of turmeric powder and a pinch of baking soda.",
                "Mix very well.",
                "Then add water in parts. I used ⅓ cup water. Depending on the type of flour, you can add less or more water. If batter becomes thin, then add some more maida.",
                "Mix to a smooth batter without any lumps.",
                "The batter consistency is slightly thick so that it coats the banana slices very well. Keep aside.",
                "Peel two large bananas.",
                "Then first slice them in half or quarters. Then slice each piece vertically in two equal parts.",
                "Heat oil for deep frying in a pan or kadai. When the oil becomes medium hot, then the banana fritters can be fried. Dip each slice in the batter and coat it well with the batter.",
                "Gently place the batter coated banana slices in medium hot oil.",
                "Fry the slices depending on the size of the kadai or pan.",
                "When one side is cooked, then turn over gently and fry the other side.",
                "Fry till both sides are light golden. You don’t need to fry these fritters too much. Stop once the bananas start oozing out moisture into the oil and the oil begins to splutter too much. We just need to fry till the outer coating is done. A light golden is fine.",
                "Remove with a slotted spoon.",
                "Keep the fried banana fritters on kitchen paper towels.",
                "In the same way, fry the remaining banana slices. You may see some caramelisation happening on the remaining banana fritters. This is due to the moisture and sugars which have leeched into the oil while frying the first batch. Prepare the pazham pori in the same manner and keep them on kitchen paper towels, so that the excess oil is soaked up.",
                "Serve pazham pori hot as an evening snack with tea."
            ],
            "Description": "Pazham pori recipe with step by step pics. Pazham pori also known as ethakka appam is a popular snack from Kerala made with ripe bananas. Banana slices are coated in an all-purpose flour batter and then deep fried. A tasty vegan banana fritters recipe that makes for a good tea time snack paired with a cup of hot chai or coffee.",
            "Prep Time": "10 minutes",
            "Cook Time": "30 minutes",
            "Total Time": "40 minutes",
            "Cuisine": "Kerala",
            "Course": "Snacks"
        },
        {
            "Title": "Fruit Cream Recipe (Cream Fruit Salad)",
            "Ingredients": "1, cup, whipping cream, or heavy cream, cold, ¼, cup, honey, or maple syrup or icing sugar or powdered sugar, 1, tablespoon, rose water, or 1 teaspoon vanilla extract, 1, dragon fruit, ⅓ to ½, cup, blueberries, or strawberries or blackberries, 1, banana, 1, pear, or apple, ⅓, cup, pomegranate arils, 1, tablespoon, chopped pistachios, 1, orange zest, – zest of 1 orange, 1 to 2, tablespoons, honey, or maple syrup – optional",
            "Instructions": [
                "First rinse and prep the fruits. Set the chopped fruits aside.",
                "Take cream, honey or maple syrup and rose water in a bowl.",
                "Whip till you get soft peaks.",
                "Add the chopped fruits.",
                "Gently fold the fruits with the whipped cream.",
                "Serve straightaway or you can chill in the refrigerator for a few hours. Serve fruit cream in bowls garnished with orange zest, chopped pistachios, pomegranate arils. You can also add a drizzle of honey or maple syrup on top of the dessert if you like."
            ],
            "Description": "This easy and unique Fruit Cream recipe is a super simple dessert featuring fresh seasonal fruits, whipped cream, honey and flavorings. It delivers plenty of flavor and can be prepared within minutes with your favorite fruits. Serve the cream fruit salad chilled or straight away.",
            "Prep Time": "15 minutes",
            "Cook Time": "0 minutes",
            "Total Time": "15 minutes",
            "Cuisine": "Indian",
            "Course": "Desserts"
        },
        {
            "Title": "Oats Smoothie | Oatmeal Smoothie",
            "Ingredients": "1, mango, – large, or 1 cup peeled & chopped mangoes, 1, banana, – large or 2 medium or 3 small bananas – peeled and chopped, 2, sapota or chickoo, – medium sized, peeled and chopped, ¼, cup, quick cooking oats, or instant oats, ½ to ⅔, cup, milk, (vegan or dairy), cold, 1 or 2, tablespoons, sugar, or honey or jaggery or maple syrup – optional, 4 to 6, ice cubes, – optional",
            "Instructions": [
                "Add the chopped fruits in a blender jar. Add milk and quick cooking oats. I did not add any sugar. But if you want you can sweeten the smoothie with sugar, jaggery or honey.",
                "Pour the smoothie in glasses or mugs.",
                "Serve oats smoothie immediately."
            ],
            "Description": "If you’re a fan of sweet, frozen fruit smoothies, you’re going to flip for this healthy Oats Smoothie. Bolstering your slurp-able breakfast beverage with whole grains adds a ton of fiber and nutrients without any extra fuss. Try this delicious oatmeal smoothie recipe with any of your favorite fruits for a quick and easy breakfast or snack on the go.",
            "Prep Time": "15 minutes",
            "Cook Time": "",
            "Total Time": "",
            "Cuisine": "American, World",
            "Course": "Beverages, Breakfast"
        },
        {
            "Title": "Fig Smoothie | Banana Fig Smoothie",
            "Ingredients": "6 to 7, figs, – fresh, 1, banana, – medium-sized, 1, pinch, ground cinnamon, (cinnamon powder) – optional, ½, cup, lite coconut milk",
            "Instructions": [
                "Rinse in fresh water a few times and then quarter the fresh figs. Transfer them in a blender or mixer jar.",
                "Peel, slice banana and add them to the blender jar. Instead of bananas, you can use strawberries or other berries. You can also skip bananas and add 6 to 7 figs more.",
                "Add lite coconut milk or one having a thin or medium consistency.",
                "Sprinkle ground cinnamon. Adding cinnamon is optional. You can also add a pinch of ground ginger, ground green cardamom powder, ground nutmeg or ¼ teaspoon vanilla extract. Or choose to skip the flavorings entirely.",
                "Blend to a smooth and fine consistency. To thin the consistency, you can add some more lite coconut milk.",
                "Pour Fig Smoothie in a glass and serve."
            ],
            "Description": "What better way to replenish the body with a healthy Fig Smoothie post a workout or a hectic day at work. It has the goodness of fresh figs, bananas and acts as an instant energy provider. This Banana Fig Smoothie recipe uses just 3 ingredients, is also plant-based and super easy to make. So, quite a delicious bonanza there!",
            "Prep Time": "10 minutes",
            "Cook Time": "",
            "Total Time": "",
            "Cuisine": "American, World",
            "Course": "Beverages"
        },
        {
            "Title": "Fruit Chaat",
            "Ingredients": "½, cup, chopped banana, or 2 medium-sized, chopped in ½ inch rounds, 1, cup, chopped mangoes, or 1 medium to large, chopped in ½ to 1 inch cubes, 1, cup, chopped apples, or 1 large,  chopped in ½ to 1 inch cubes, 1, cup, sweet potatoes, – boiled, peeled and chopped in ½ to 1 inch cubes or 2 small sweet potatoes – optional, 1, cup, chopped potato, chopped in ½ to 1 inch cubes or 1 large potato – can boil potatoes instead of frying, 2, teaspoons, lemon juice, or add as required, 1, teaspoon, chaat masala, 1, teaspoon, roasted cumin powder, ½, teaspoon, red chili powder, or cayenne pepper, add as required, ½, teaspoon, black salt, or add as required",
            "Instructions": [
                "Before you make the fruit chaat, boil the sweet potatoes and fry the potatoes. You can boil or steam the sweet potatoes in an Instant pot or a steamer or a stovetop pressure cooker adding water as required.",
                "Rinse the potatoes in fresh water. Peel and chop them in ½ to 1 inch cubes. Heat ½ cup of oil or as required for frying the potatoes in a pan.",
                "When the oil becomes medium hot add the potatoes. Fry them until lught golden or golden.",
                "Place the fried potatoes on kitchen paper towels to absorb excess oil.",
                "Chop the fruits. If you want you can rub a bit of lemon juice on the banana slices and apple cubes so that they don't get browned and also gives a sour hint to the fruits.",
                "In a bowl add the chopped fruits one by one. Add the boiled sweet potato cubes and the fried potatoes.",
                "Add lemon juice. For the best taste use fresh lemon juice.",
                "Add all the spice powders and black salt or reqular salt to taste. Toss and mix well so that the ground spices and seasonings coat the fruits and tubers.",
                "Check the seasonings and add more salt or lemon juice if necessary."
            ],
            "Description": "Enjoy this refreshing Delhi-style tasty fruit chaat with sweet, savory, spicy, and tangy flavors at home! Add seasonal fruits and tubers such as potatoes and sweet potatoes to make the perfect fruit chaat. Prepare in about 30 minutes and serve as a snack.",
            "Prep Time": "15 minutes",
            "Cook Time": "15 minutes",
            "Total Time": "30 minutes",
            "Cuisine": "Indian",
            "Course": "Snacks"
        },
        {
            "Title": "Mango Smoothie (5 Ways)",
            "Ingredients": "2, mangoes, – medium sized, alphonso or 1.5 cups chopped alphonso mangoes or mangoes, 1, cup, (yogurt), about 240 grams, 3, tablespoons, honey, or add as required, ⅛, teaspoon, cinnamon powder, or 2 to 3 pinches, ⅓, cup, quick cooking oats, or rolled oats, ½, cup, water, ¾, cup, chopped mangoes, or 1 medium to large mango, 2 to 3, teaspoons, chia seeds, (optional), ½, portion, papaya, (half of a small to medium-sized ripe papaya), 2, mangoes, – large-sized alphonso or any sweet variety, 2, bananas, – medium sized, 4 to 5, ice cubes, – optional, 3, mangoes, – alphonso or any sweet variety, 15 to 18, almonds, or add as required, 2 to 3, green cardamoms, or ¼ teaspoon cardamom powder, 1 to 2, tablespoons, raw sugar, or maple syrup, 3 to 4, ice cubes, – optional, 3 to 4, mint sprigs, – for garnish, optional, 1, cup, chopped mangoes, or 2 medium sized alphonso mangoes or any sweet mango, 2, bananas, – medium sized, 8 to 10, dried figs, or as required, ½, cup, or cashew milk or dairy milk, 3 to 4, ice cubes, –  optional",
            "Instructions": [
                "Rinse and peel the alphonso mangoes.",
                "Chop them in small cubes. You will need 1.5 cups chopped alphonso mangoes cubes.",
                "Add the chopped mangoes in a blender or mixer jar.",
                "Add the fresh yogurt (curd). Also add 3 tablespoons honey or add as required. You can even use any other sweetener like unrefined sugar, jaggery, palm jaggery, maple syrup or coconut sugar. Adding any sweetener can also be skipped entirely.",
                "Sprinkle cinnamon powder. Cinnamon powder can be skipped. You can even add cardamom powder or vanilla extract instead of cinnamon powder.",
                "Blend to a smooth consistency.",
                "Serve mango smoothie in a tall glass. You can even chill the smoothie for a few hours and then serve later.",
                "Rinse quick cooking oats or rolled oats first using a mesh strainer. Take oats in a bowl and mix with water.",
                "Cover the bowl and keep in the fridge overnight or for 7 to 8 hours.",
                "Next day, chop 1 large mango and add the mango cubes in a blender.",
                "Add the soaked oats. Blend till smooth. This is a thick smoothie. To thin down a bit, you can add some water or milk.",
                "Pour in a glass. You can top with dry fruits or seeds or berries. For some crunch, I sprinkled chia seeds. You can easily skip chia seeds. Serve the healthy oats mango smoothie.",
                "Peel and chop the fruits.",
                "Liquidize or blend all in a blender. The consistency is that of a thick smoothie. To thin the smoothie, add preferred choice of vegan milk or water.",
                "Pour in glasses and serve mango banana papaya smoothie immediately. Add ice cubes if required.",
                "Peel and chop the mangoes. Crush the cardamoms to a fine texture in a mortar-pestle. Discard the outer husks.",
                "Add the chopped mangoes, almonds, crushed cardamom, sugar and ice cubes in a blender. You can add about ¼ cup of any nut milk or water.",
                "Blend till smooth.",
                "Pour the smoothie in long glasses or mugs. Top with some chopped mangoes and fresh mint leaves. Serve almond mango smoothie.",
                "Peel and chop the mangoes and bananas.",
                "Add the chopped fruits and dried figs in a powerful blender. If the figs are hard or chewy, soak them in hot water for 30 to 45 minutes prior to blending.",
                "Pour the almond milk in the blender and blend till smooth.",
                "Pour the mango banana smoothie in tall glasses and serve immediately."
            ],
            "Description": "Bright and refreshing mango smoothies are easy to make as a healthy breakfast or sweet snack. Here I share with you",
            "Prep Time": "10 minutes",
            "Cook Time": "0 minutes",
            "Total Time": "10 minutes",
            "Cuisine": "American, World",
            "Course": "Beverages, Breakfast, Brunch"
        },
        {
            "Title": "Cherry Smoothie | Banana Cherry Smoothie",
            "Ingredients": "¾, cup, cherries, – 100 grams, fresh and sweet tasting, 1, banana, – large, ½, cup, or lite coconut milk or water, ¼, teaspoon, vanilla extract, – optional",
            "Instructions": [
                "Rinse cherries in water first for a couple of times. Then soak cherries in a bowl of water for 15 to 20 minutes in which ½ tablespoon white vinegar or apple cider vinegar is added. This is done to get rid of pesticides.",
                "Later rinse cherries again a couple of times with fresh water. Drain all the water. Then remove the stems.",
                "Pit the cherries and discard the seeds. You can chop the cherries roughly if you want. Add the cherries in a blender.",
                "Add 1 large chopped banana. Pour almond milk. You can also use lite coconut milk or thin coconut milk.",
                "Add the vanilla extract.",
                "Blend till fine and smooth.",
                "Pour in a glass and serve Cherry Smoothie straight away."
            ],
            "Description": "A simple Cherry Smoothie recipe that makes a delicious vegan drink with fresh cherries and almond milk – and can be made with or without banana. It’s quick to blend up for a healthy breakfast, and sweet enough to enjoy as an afternoon snack or light dessert. Here you’ll find step-by-step instructions and photos to prepare a refreshing and nutritious Banana Cherry smoothie from scratch.",
            "Prep Time": "25 minutes",
            "Cook Time": "",
            "Total Time": "",
            "Cuisine": "World",
            "Course": "Beverages"
        },
        {
            "Title": "Trifle Recipe | Trifle Pudding | Fruit Trifle",
            "Ingredients": "3, tablespoons, custard powder, – swap 3 tablespoon cornstarch + ½ teaspoon vanilla extract/essence for custard powder, 3, tablespoons, whole milk, – warm, 1.5, cups, whole milk, – at room temperature or cold, 4, tablespoons, sugar, or add as required, ½, cup, light cream, – 25% to 35% or whipping or heavy cream, ¼, teaspoon, vanilla extract, – optional, 250, grams, Eggless Sponge Cake, or 1 small eggless sponge cake, 2 to 2.5, cups, chopped mix fruits, – apple, banana, figs, pomegranate or your preferred fruits or berries, 4 to 5, tablespoons, mango pulp, or any thick fruit puree or pulp or a fruit or berry jam or preserve",
            "Instructions": [
                "Warm 3 tablespoons of the milk in a microwave or in a small steel bowl on the stove top. Then add the custard powder to the warm milk.",
                "Stir and dissolve the custard powder very well in the milk. There should be no lumps. Keep this slurry or paste aside.",
                "In another pan, take 1.5 cups milk. Then add sugar.",
                "Stir and heat this milk and sugar solution on a low to medium flame. Just bring to a gentle heat and stir so that the sugar dissolves.",
                "Reduce the heat to its lowest. Then add the custard powder slurry or paste and stir quickly with a wired whisk, so that no lumps are formed.",
                "Keep on stirring till the custard thickens and the raw taste of the custard powder is not there. The custard sauce should coat and form a layer on the back of a spoon. Switch off the heat.",
                "Allow the custard to cool at room temperature.",
                "In another bowl, take cold or chilled cream.  Add vanilla extract.",
                "With an electric beater or in a stand mixer, whip the cream till you get soft peaks.",
                "Keep this whipped cream in the refrigerator.",
                "Now slice 250 grams or a small block of plain eggless vanilla cake or eggless sponge cake into even sized cubes.",
                "Also rinse, peel and chop fruits that you plan to include in the trifle.",
                "You can use any seasonal fruits. But avoid citrus fruits and melons.",
                "Now spread 2 to 3 tablespoons of thick mango pulp or puree on the cake. This is optional. You can also brush a bit of fruit juice or sherry wine on the sponge layer. But just make sure the sponge does not become soggy.",
                "If without fruit juice, spread a thin layer of a fruit jam or berry jam on the cake pieces.",
                "Note that if you are using mangoes, in the fruit layer, then no need to add the mango pulp.",
                "Spread half of the prepared custard in a layer."
            ],
            "Description": "Sweet, vibrant, and delicious. This easy and tasty trifle recipe (a.k.a trifle pudding or fruit trifle) is the perfect dessert to brighten up your dinner table. It is made with mixed fruits, an eggless sponge, and whipped cream. Make this mouth-watering fruit trifle recipe in 30 minutes and serve it chilled.",
            "Prep Time": "15 minutes",
            "Cook Time": "15 minutes",
            "Total Time": "30 minutes",
            "Cuisine": "British, World",
            "Course": "Desserts"
        },
        {
            "Title": "Fruit Salad Recipe (Simple, Easy & Healthy)",
            "Ingredients": "2, mangoes, – ripe and sweet, medium to large, 2, bananas, – medium sized, 2 to 3, chikoo, (sapodilla or sapota) – medium sized, optional, 1, papaya, – small sized or ½ portion of one large papaya, ⅓, cup, chopped strawberries, or 10 to 12 strawberries, 3 to 4, figs, – fresh, ⅓, cup, pomegranate arils, or 1 small pomegranate, 2, tablespoon, chopped cashews, or 10 to 12, optional, 2, tablespoon, chopped almonds, or walnuts, or 10 to 12, optional, 2, tablespoon, chopped pistachios, or 12 to 15, optional, 1, tablespoon, honey, or preferred sweetener – optional, 5 to 6, mint leaves, – optional, for garnish",
            "Instructions": [
                "If using pomegranate, first rinse it very well. Pat dry with a kitchen towel. Chop into halve or quarters and remove the arils first. Place the arils in a small bowl and set it aside.",
                "Thoroughly rinse the fruits. Drain all the water. Remove and discard any seeds, stems or peels that are inedible. Chop all fruit into similarly sized pieces.",
                "Chop the nuts like almonds, cashews, pistachios or any nuts that you prefer. Feel free to lightly roast the nuts prior to chopping them for deeper flavor.",
                "When you have completed chopping all the fruits and nuts, peel and chop bananas.",
                "Add the chopped fruits, pomegranate arils and chopped nuts in a salad bowl or any large bowl.",
                "Add honey or any preferred sweetener. Or you can opt to drizzle honey on the salad while serving.",
                "I do not prefer any tangy citrus flavors in a fruit salad. Feel free to add a bit of lemon juice or orange juice if you like to your fruit salad.",
                "Gently mix the fruits very well.",
                "Serve fruit salad immediately for best results. I usually like to garnish mine with a few sprigs of mint leaves or some chopped nuts.",
                "This fruit salad is absolutely delicious all by itself, but you can certainly use it to dress up other sweet dishes.",
                "It pairs wonderfully with pancakes, crepes, waffles and even french toast or nutella toast",
                ".",
                "Top your custards, puddings, panna cotta or mousse with it.",
                "You can also garnish a cheesecake with the salad or simply serve it with a side of whipped cream or your preferred ice cream."
            ],
            "Description": "Juicy, sweet, healthy and delicious, this tropical Fruit Salad recipe is sure to become part of your regular summer recipe repertoire. Quick to prepare, easy to digest and packed with nutrients, fruit salads are perfect for this warmer weather.",
            "Prep Time": "15 minutes",
            "Cook Time": "0 minutes",
            "Total Time": "15 minutes",
            "Cuisine": "World",
            "Course": "Breakfast, Brunch, Snack"
        },
        {
            "Title": "Strawberry Smoothie | Strawberry Banana Smoothie",
            "Ingredients": "1.25, cups, chopped strawberries, – 200 grams, ½, cup, – lite or with a thin/medium consistency, 1, banana, – medium to large",
            "Instructions": [
                "Rinse, hull and then chop strawberries. You can also use frozen strawberries if you’d like to make a thicker strawberry smoothie.",
                "Add the chopped strawberries in a blender.",
                "Add 1 medium to large banana (roughly chopped).",
                "Pour lite coconut milk. The coconut milk should have a thin or medium consistency.",
                "You can add some sweetener like maple syrup, jaggery, palm sugar, raw sugar or coconut sugar if you prefer.",
                "For thicker smoothie add about ¼ to ⅓ cup lite coconut milk.",
                "Blend until smooth. If the smoothie is a bit too thick, add a splash of coconut milk and blend again.",
                "Pour in glasses and serve strawberry smoothie straight away. Opt to serve the smoothie as it or top with some strawberry slices or chopped nuts.",
                "Pour into two glasses and serve the strawberry smoothie straight away. I suggest you garnish the glasses with some sliced strawberries or chopped nuts or dry fruits.",
                "I recommend to drink the freshly blended smoothie as soon as it is made for the best flavor and taste.",
                "The coconut milk in the smoothie will get rancid if kept at room temperature for a few hours in a warm temperature. It can also go rancid in the fridge."
            ],
            "Description": "A 3 ingredient Strawberry Smoothie recipe that’s vegan, gluten-free and easy to prepare in just minutes. Follow my step-by-step instructions with photos to make a creamy, thick and delicious Strawberry Banana Smoothie for a healthy breakfast or snack.",
            "Prep Time": "5 minutes",
            "Cook Time": "0 minutes",
            "Total Time": "5 minutes",
            "Cuisine": "American, World",
            "Course": "Beverages"
        },
        {
            "Title": "Banana Halwa | Banana Sheera",
            "Ingredients": "1, cup, rava, – roasted, (sooji, semolina, cream of wheat) – finer textured, 2 to 3, bananas, – chopped, 8 to 10, almonds, or cashews – chopped or sliced, 10 to 12, raisins, 2 to 3, green cardamoms, – powdered or ½ teaspoon green cardamom powder, 5, tablespoons, or 4 tablespoons neutral flavored oil, ½, cup, sugar, or add as required, 1, pinch, saffron, – crushed, 2.5, cups, hot water, or hot milk",
            "Instructions": [
                "Heat ghee or oil in a kadai or pan. Add roasted semolina and on low to medium-low heat roast for 2 to 3 minutes, till the semolina starts getting fragrant. Don't brown the semolina.",
                "Add chopped bananas and stir.",
                "Add hot water or milk in batches and mix thoroughly after adding every batch of either the hot milk or water. This ensures that lumps are not formed.",
                "Take care when adding the hot liquids as the rava mixture splutters.",
                "Add the chopped almonds or cashews and raisins and cardamom powder.",
                "Add sugar and stir to mix thoroughly until sugar is dissolved. Simmer the Banana Halwa for 2 to 3 minutes.",
                "Add the saffron. Stir and simmer for 2 to 3 minutes more.",
                "Serve Banana Halwa hot or warm."
            ],
            "Description": "Banana Halwa, also known as Banana Sheera or Satyanarayan Prasad is an Indian sweet which I have grown up consuming during most of the puja functions in Mumbai, Maharashtra. This Banana Halwa recipe is made by cooking semolina or cream of wheat and bananas together in milk or water, flavored with green cardamom. It is finished with dry fruits, nuts and saffron. This sweet dish is a delectable way of consuming bananas.",
            "Prep Time": "5 minutes",
            "Cook Time": "15 minutes",
            "Total Time": "20 minutes",
            "Cuisine": "Indian, Maharashtrian",
            "Course": "Breakfast, Brunch, Desserts"
        },
        {
            "Title": "Chocolate Chip Banana Bread",
            "Ingredients": "2, large bananas, or 1 and ⅓ cup chopped bananas or 280 to 290 grams bananas (with peels), 6, tablespoons, unrefined sugar, – 60 grams, can also use white granulated sugar, 1, teaspoon, vanilla extract, or ½ teaspoon vanilla essence, ¼, cup, or preferred plant based milk, ¼, cup, sunflower oil, or any neutral tasting oil, 1.25, cups, whole wheat flour, – 150 grams, leveled, 1, teaspoon, baking powder, – leveled, ¼, teaspoon, baking soda, – leveled, ¼, teaspoon, ground cinnamon, 1, pinch, salt, 6, tablespoons, semi sweet chocolate chips, (vegan),  60 grams",
            "Instructions": [
                "Grease with oil or line a loaf pan ( 8 x 4 x 2.5 inches) or round cake pan (8 x 2 inches) with parchment paper.",
                "In a bowl mash chopped bananas with sugar very well.",
                "Sift whole wheat flour with salt, cinnamon powder, baking soda and baking powder in a tray or plate.",
                "Add chocolate chips. Substitute with nuts if you do not have chocolate chips.",
                "Pour in the greased loaf pan. Level neatly from the top with a spatula. Tap the pan lightly a couple of times on the kitchen countertop.",
                "Bake in a preheated oven at 180 degrees Celsius for 35 to 45 minutes or till a fork or bamboo skewer comes out clean.",
                "Keep the sweet bread on a wired rack to cool at room temperature.",
                "When completely cooled at room temperature, gently remove the bread from the pan. Serve or store in an air-tight box and refrigerate.",
                "The bread keeps well for a couple of weeks in the fridge. You can even freeze the bread.",
                "Slice chocolate chip banana bread and serve as a dessert or as a sweet snack."
            ],
            "Description": "What’s better than a chocolate chip bread and banana bread separately? Its this Chocolate Chip Banana Bread which combines the deliciousness of both these amazing ingredients. This sweet bread has a soft and moist crumb with gooey chocolate chips in each bite. This recipe is also egg free, vegan and quite a delight to have. You’re surely going to love it!",
            "Prep Time": "10 minutes",
            "Cook Time": "35 minutes",
            "Total Time": "45 minutes",
            "Cuisine": "American, World",
            "Course": "Desserts"
        },
        {
            "Title": "Banana Muffins",
            "Ingredients": "1.5, cups, whole wheat flour, – 180 grams, ½, teaspoon, baking soda, 1, teaspoon, baking powder, 1, pinch, salt, 3, large bananas, or 5 medium bananas – 400 grams with peels, ¼, cup, raw sugar, or regular sugar – 50 grams, ½, cup, oil, 1, tablespoon, lemon juice, 1, teaspoon, vanilla extract, or vanilla powder",
            "Instructions": [
                "Line a muffin tray with muffin liners. Also preheat the oven to 180 degrees Celsius/356 degrees Fahrenheit for 15 minutes. You can use the same temperature for preheating in the convection mode of a microwave oven.",
                "In a bowl take chopped bananas together with the sugar. Begin to mash the bananas with a fork or a masher till smooth. A few small chunks of bananas are fine. You can also blitz the bananas and sugar in a blender to get a smooth puree.",
                "Add vanilla extract or powder and mix to combine evenly.",
                "Then add lemon juice. Mix again very well and keep this wet mixture aside.",
                "Begin to sieve whole wheat flour, baking soda, baking powder, salt directly in the wet ingredients bowl. You can also sieve the dry ingredients in a plate or tray and then add later.",
                "Spoon the batter in muffin liners till ¾ of the liners. Using a spatula remove the excess batter from the bowl and add to the muffin liners.",
                "Place the muffin tray in the center rack with both the top and bottom heating elements of an otg.",
                "Bake in the preheated oven at 180 degrees Celsius/356 degrees Fahrenheit for 30 to 35 minutes or till a toothpick inserted comes out clean. The recipe yields 10 regular sized banana muffins.",
                ", so do keep a check while baking. Your oven might bake the muffins in 20 minutes or even 40 minutes.",
                "It took a total of 35 minutes for the muffins to bake in my oven. The tops should be golden.",
                "The final check is that a tooth pick should come out dry or with fine crumb particles. There should be no stickiness. Use the same temperature for baking in the convection mode of a microwave oven."
            ],
            "Description": "These banana muffins are a quick and easy vegan and eggless muffin recipe made with whole wheat flour, ripe bananas and sugar. Baked to perfection in just 30 minutes, enjoy these delicious eggless muffins with breakfast or as a midday snack.",
            "Prep Time": "15 minutes",
            "Cook Time": "30 minutes",
            "Total Time": "45 minutes",
            "Cuisine": "American, World",
            "Course": "Desserts"
        },
        {
            "Title": "Banana Mousse Recipe",
            "Ingredients": "400, grams, bananas, 3 large bananas or 5 medium bananas or 6 small bananas, 2, tablespoons, honey, or add as needed, 200, ml, cream, 25% to 50% fat – a bit more than ¾ cup fresh cream, 3 to 4, drops, lemon juice",
            "Instructions": [
                "Peel, slice the bananas and add them to a blender jar together with the honey. Also add 3 to 4 drops of lemon juice so that the bananas do not get discolored.",
                "Blend the bananas to a smooth puree. Make sure that that there are no chunks in the puree.",
                "Now, add the fresh cream to the pureed bananas.",
                "Now, pour the mousse mixture in small individual serving bowls or small glasses.",
                "Cover them with a lid or aluminium foil and refrigerate for 3 to 4 hours or overnight for the mousse to completely set.",
                "Serve eggless Banana Mousse with some whipped cream, banana slices or grated chocolate."
            ],
            "Description": "I know many people who have an unexplainable aversion towards banana. But I’m sure once you try this recipe of a lovely, silky mousse made with bananas, you’ll have a change of heart for this fruit. So, presenting a quick, super easy, no-cook, eggless and decadent dessert recipe, the Banana Mousse.",
            "Prep Time": "15 minutes",
            "Cook Time": "0 minutes",
            "Total Time": "15 minutes",
            "Cuisine": "American, World",
            "Course": "Desserts"
        },
        {
            "Title": "Fruit Salad With Ice Cream",
            "Ingredients": "1, banana, – medium to large, 2, mangoes, – medium-sized, 4 to 5, sapota, (chikoo), small to medium, 10 to 12, strawberries, 1, dragon fruit, – optional, 2 to 3, tablespoons, chopped nuts, (cashews, almonds and pistachios), 6, scoops, or as required, 1 to 2, tablespoons, chopped nuts, (cashews, almonds and pistachios), for garnish, 5 to 6, strawberry slices, – for garnish",
            "Instructions": [
                "Rinse, peel and chop the fruits. Take the chopped mixed fruits in a bowl.",
                "Mix them with a spoon.",
                "Add chopped nuts like cashews, almonds and pistachios.",
                "Mix the chopped nuts with the mixed fruits.",
                "Divide the fruit salad mixture into 6 bowls or ice cream cups.",
                "Place two to three scoops of vanilla ice cream on top of the fruit salad.",
                "Garnish with a few slices of strawberries or any fruit or berries. Also, sprinkle some chopped nuts from top.",
                "Serve the Fruit Salad With Ice Cream straightaway."
            ],
            "Description": "A really fun and easy salad recipe made with a medley of fresh fruits and nuts, topped with scoops of ice cream. All the favorite things together. What else can you really ask for when you have this Fruit Salad With Ice Cream in front of you. You may enjoy it as a snack or dessert, this is a choice that is completely yours.",
            "Prep Time": "15 minutes",
            "Cook Time": "0 minutes",
            "Total Time": "15 minutes",
            "Cuisine": "American, World",
            "Course": "Desserts"
        },
        {
            "Title": "Banana Smoothie",
            "Ingredients": "3, bananas, – large-sized, ½, cup, lite coconut milk, – thin or medium consistency coconut milk or almond milk, ¼, teaspoon, ground cinnamon, or ¼ teaspoon vanilla extract, 1 to 2, tablespoons, nuts, or toasted seeds, for garnish – optional",
            "Instructions": [
                "Peel and chop the bananas. Add them in a blender.",
                "Add ground cinnamon powder and lite coconut milk. You can even add vanilla extract instead of cinnamon powder.",
                "Blend till smooth and to a fine consistency. If the smoothie is too thick for your liking, add a splash of water or lite coconut milk. Blend again.",
                "For more sweetness, consider adding 1 to 2 tablespoons of your preferred sweetener.",
                "Pour banana smoothie in two glasses.",
                "Sprinkle some toasted nuts and seeds. This is an optional step. But it will add some crunch to the smoothie and also make it more healthy and filling.",
                "Serve banana smoothie straightaway."
            ],
            "Description": "Banana smoothies are wonderfully healthy and delicious to enjoy for breakfast or as a snack. And you only need 3 ingredients to blend them up from scratch! This vegan banana smoothie is made with sweet ripe bananas and coconut milk, plus a generous dash of cinnamon. Here you’ll find step-by-step instructions with photos to make a perfect smoothie with bananas – no yogurt or milk needed!",
            "Prep Time": "10 minutes",
            "Cook Time": "",
            "Total Time": "",
            "Cuisine": "American, World",
            "Course": "Beverages"
        },
        {
            "Title": "Eggless Banana Pancakes | Healthy Vegan Banana Pancakes",
            "Ingredients": "3, bananas, – medium to large (overripe or ripe)or 285 grams, 1, cup, whole wheat flour, or 120 grams, ½, teaspoon, crushed fennel, or whole fennel seeds, 3, tablespoons, jaggery powder, or add as required – optional, ¾, cup, water, or add as required, oil, as required",
            "Instructions": [
                "Peel bananas and place them in a mixing bowl or pan.",
                "Slice them first and then mash with a potato masher. For over ripe bananas, you can directly mash with a veggie or potato masher.",
                "Now add jaggery powder. You can add the amount of jaggery as per the sweetness of the bananas.",
                "Add more or less as required. You can replace sugar with jaggery. Mix very well.",
                "Then add whole wheat flour and lightly crushed fennel seeds or whole fennel seeds. Crush the fennel seeds lightly in your mortar-pestle.",
                "Then begin to mix it with the flour. I added a total of ¾ cup of water. Depending on the quality of whole wheat flour you can add adjust the water proportion.",
                "Mix very well and make a smooth batter without lumps. The batter has to have a medium-thick flowing consistency.",
                "Now heat a pan or skillet. Spread a bit of oil on the pan. Instead of oil you can also use ghee or butter. You can use a heavy nonstick or a cast iron skillet.",
                "Keep the heat to a low or medium-low. Pour a spoonful of the batter on the pan and then gently spread it. Do not spread too much. Just form small pancakes.",
                "Cook the pancake on a low to medium-low heat.",
                "When the base gets golden and slightly crisp, turn over the banana pancake.",
                "Cook this second side until it gets golden. If you want you can flip and cook once or twice.",
                "Then place each cooked banana pancake in a single layer inside a casserole dish or on a baking sheet, and keep in an oven at the lowest temperature while you make the remaining pancakes.",
                "Serve eggless banana pancakes hot or warm. You can eat them plain as-is, or enjoy with maple syrup or other flavored syrups, honey, jams, caramel sauce or melted peanut butter.",
                "If using honey, then be sure to drizzle it on pancakes only once they have cooled down to room temperature as honey that becomes too hot becomes toxic.",
                "Keep cooled pancakes in a sealed container in the refrigerator for up to 3 days.",
                "You can also place them in the freezer for up to 1 month by wrapping individually in plastic wrap before sealing in airtight bags."
            ],
            "Description": "This",
            "Prep Time": "5 minutes",
            "Cook Time": "20 minutes",
            "Total Time": "25 minutes",
            "Cuisine": "American, World",
            "Course": "Desserts, Snacks"
        },
        {
            "Title": "Chia Pudding Recipe (Easy & Healthy)",
            "Ingredients": "4, tablespoons, chia seeds, 1.5, cups, – light or thin, or swap with almond milk or cashew milk, 4, tablespoons, coconut sugar, or add as required, swap with raw sugar or preferred sweetener, ¼, teaspoon, ground green cardamom, or ground cinnamon or ¼ teaspoon vanilla extract, 1, banana, – peeled & sliced, you can add your choice of fruits, 3 to 4, strawberries, – sliced, 2, teaspoons, pine nuts, or any nuts of your choice",
            "Instructions": [
                "Divide equally the chia seeds, coconut milk, coconut sugar, ground green cardamom or ground cinnamon or vanilla extract in two glasses.",
                "Mix everything till the coconut sugar is dissolved. Break lumps if any with a spoon.",
                "Cover and place the glasses in the fridge for 2 hours or for some more time or overnight.",
                "After two hours or later, remove the glasses from the fridge.",
                "Stir again and break lumps if any. The pudding would have thickened.",
                "Top with chopped fruits and nuts.",
                "Serve Chia Pudding straight away."
            ],
            "Description": "If you’re looking for an easy, vegan, and healthy make-ahead breakfast, this simple recipe for Chia Pudding is for you. Made with only 4 base ingredients in about 5 minutes and endlessly customizable to fit your dietary and flavor preferences, this sweet and satisfying treat is sure to become a family favorite.",
            "Prep Time": "5 minutes",
            "Cook Time": "",
            "Total Time": "",
            "Cuisine": "American, World",
            "Course": "Breakfast, Snacks"
        },
        {
            "Title": "Banana Milkshake Recipe | Wholesome Banana Shake",
            "Ingredients": "2, cups, – lite or with a thin to medium consistency, 3, bananas, – medium sized, 2 to 3, tablespoons, raw sugar, or as required, optional, ½, teaspoon, vanilla extract, or 1 to 2 pinches of vanilla powder, optional, ¼, teaspoon, ground cinnamon, or ground green cardamom powder for garnish, optional",
            "Instructions": [
                "Transfer the chopped bananas, vanilla and coconut milk into the blender.",
                "Add raw sugar or your preferred choice of sweetener. You can choose to omit the sweetener.",
                "Blend everything until smooth and creamy. If you find the banana shake to be too thick for your liking, add a few splashes of water and blend again.",
                "Pour the milkshake in glasses and serve right away.",
                "If you like you can sprinkle some cinnamon or cardamom powder onto each banana milkshake. Top with some chopped nuts if you like. Serve right away while cold.",
                "To get the best flavor and taste, drink the banana shake as soon as you make it as banana discolors due to oxidation. I would not suggest to refrigerate the banana shake even for a few hours."
            ],
            "Description": "This Banana Milkshake recipe includes sweet bananas and coconut milk for a rich and creamy consistency that everyone (especially kids) will love. Plus I add a bit of vanilla and cinnamon for an extra delicious drink that’s perfect for breakfast, as a snack, or even for a healthy dessert. This Banana Shake recipe is also vegan.",
            "Prep Time": "10 minutes",
            "Cook Time": "0 minutes",
            "Total Time": "10 minutes",
            "Cuisine": "World",
            "Course": "Beverages"
        },
        {
            "Title": "Easy Banana Cake Recipe (Eggless, Vegan & Whole Wheat)",
            "Ingredients": "4, bananas, (medium to large ripe or overripe) – 300 grams, 1.5, cups, whole wheat flour, or 180 grams whole wheat flour, 1, teaspoon, baking powder, ½, teaspoon, baking soda, 1, pinch, salt, ½, cup, regular sugar, or organic unrefined cane sugar or 100 grams sugar, ⅔, cup, any neutral flavored oil, (I used sunflower oil), 1, teaspoon, vanilla extract, 10, halved walnuts, – finely chopped or any dry fruits or nuts of your choice (optional)",
            "Instructions": [
                "Preheat your oven at 180 degrees Celsius (350 degrees Fahrenheit). If using a regular oven, heat both the top and bottom elements. For a microwave convection oven, just preheat the oven.",
                "Mix thoroughly so that the oil mixes evenly with the banana puree and the sugar dissolves.",
                "Add the chopped walnuts and fold again. Apart from walnuts, you can also add raisins, pistachios or any nuts and dry fruits of your choice.",
                "Bake in the preheated oven at 180 degrees Celsius (350 degrees Fahrenheit) for 45 to 50 mins or until a wooden skewer or tooth pick inserted in the cake comes out clean.",
                "If the top of the cake starts browning then cover the top with an aluminium foil or parchment paper while baking.",
                "When warm or cooled, gently remove the cake from the pan. Slice and serve banana cake as is with tea or coffee."
            ],
            "Description": "This Banana Cake is a delicious, one-bowl vegan recipe made from mashed ripe bananas, walnuts and whole wheat flour. Tasty and a bit healthier than traditional",
            "Prep Time": "5 minutes",
            "Cook Time": "35 minutes",
            "Total Time": "40 minutes",
            "Cuisine": "American, World",
            "Course": "Desserts"
        }
    ]
}