{
    "code": 200,
    "status": "success",
    "Message": "Successful",
    "recipe_data": [
        {
            "Title": "Perfect Sabudana Khichdi Recipe (For Fasting Or Vrat)",
            "Ingredients": "1, cup, sabudana, – sago or tapioca pearls, 150 grams, water, as required, to soak sabudana, 2, potatoes, – medium-sized, ½, cup, peanuts, – roasted, 8 to 10, curry leaves, – optional, 1, teaspoon, grated ginger, – optional, 1, green chili, – chopped or ½ to 1 teaspoon, 1, teaspoon, cumin seeds, ¼, cup, coconut, – grated, fresh – optional, ½ to 1, teaspoon, sugar, or as required, ½ to 1, teaspoon, lemon juice, (optional) or as required, 3, tablespoons, peanut oil, or ghee, rock salt, – edible and food grade, (sendha namak) as required, 1 to 2, tablespoons, coriander leaves, – chopped, optional",
            "Instructions": [
                "Rinse sabudana very well in water. Then soak sabudana overnight or for 3 to 5 hours.",
                "After the sabudana has soaked well enough, check if they have become soft or not.",
                "To do this take a few pearls and press them with your fingers. They should get mashed easily.",
                "Drain the soaked sabudana very well of all the water and set aside.",
                "In a pan, dry roast the peanuts till browned and when cooled make a coarse powder in a mortar-pestle or in a dry grinder.",
                "Now heat peanut oil or ghee. Fry the cumin first till they crackle and get browned on low to medium-low heat.",
                "Now add the curry leaves if using and green chillies. Fry for a few seconds and then add the grated ginger if using.",
                "Saute for a couple of seconds till the raw aroma of the ginger goes away. Now add chopped boiled potatoes and saute for a minute.",
                "Add the sabudana. Keep on stirring often on a low heat for about 3 to 5 minutes.",
                "Don’t overcook as they might become lumpy and hard.",
                "Turn off the heat and add lemon juice and chopped coriander leaves. Mix well.",
                "While serving garnish with a few coriander leaves and drizzle with some lemon juice. You can even add some grated fresh coconut on top.",
                "Serve Sabudana Khichdi hot or warm as is. Or you can serve with a side of sweetened curd or a satvik coconut chutney made with fasting ingredients."
            ],
            "Description": "If there’s one dish that is quintessential during the fasting or vrat season in the Indian subcontinent, it has to be Sabudana Khichdi. Made with sago pearls or sabudana, boiled potatoes, roasted peanuts and a few spices, Sabudana Khichdi Recipe is most popular during the fasting days of Hindu festivals like Navratri, Mahashivratri and Ekadashi. Many people have many ways of making it. However, here, I have shared many to-dos for the most perfect, non-sticky Maharashtrian style khichdi made with sabudana. This is the recipe I have been making for decades.",
            "Prep Time": "20 minutes",
            "Cook Time": "5 minutes",
            "Total Time": "25 minutes",
            "Cuisine": "Maharashtrian",
            "Course": "Snacks"
        },
        {
            "Title": "kuttu ki puri | vrat ki poori",
            "Ingredients": "2, cups, buckwheat flour, or 250 grams kuttu ka atta, ½, teaspoon, cumin powder, 1, teaspoon, rock salt (edible and food grade), (sendha namak), 1, cup, hot boiling water, peanut oil for deep frying,, add as required",
            "Instructions": [
                "Take 2 cups buckwheat flour (or 250 grams  kuttu ka atta) in a large mixing bowl or a plate (parat).",
                "Add ½ teaspoon cumin powder and 1 teaspoon rock salt (sendha namak).",
                "With a spoon mix well.",
                "Now add 1 cup hot boiling water.",
                "With a spoon mix everything. Cover the pan and keep aside till the mixture cools down.",
                "Once the mixture has cooled down, begin to knead it. While kneading add warm water if required. 1 to 2 tablespoons of water can be added.",
                "Knead to a smooth dough. The dough should not be sticky. Otherwise you won’t be able to roll the pooris.",
                "Make small or medium sized balls from the dough. Take a dough ball and spread some oil on both sides.",
                "With a rolling pin, roll to a round circle. You can keep the kuttu pooris slightly thick, but do not make them thin.",
                "Heat oil for deep frying in a kadai or pan. Check the oil by adding a small piece of the dough in it. If it comes up steadily and gradually, the oil is hot enough for the pooris to be fried.",
                "Then gently slide one poori in the oil. Fry on medium flame. It will come on the surface and also puff up.",
                "If the poori does not puff, then gently nudge & press the surface with a slotted spoon, so that the poori puffs up.",
                "Fry till you see that oil has stopped sizzling and the kuttu poori looks golden and crisp.",
                "Then turn over the poori.",
                "Fry the second side also till it turns crisp and golden. Remove with a slotted spoon.",
                "Place them on paper towels to remove excess oil. Similarly fry the rest of pooris.",
                "Serve kuttu ke atte ki puri hot with vrat ke aloo or dahi arbi or dahi aloo."
            ],
            "Description": "Kuttu ki puri recipe with step by step photos. Kuttu or buckwheat plays a significant role in the food for fasts in India. This Kuttu Ki Puri is a crisp and tasty poori made with buckwheat flour or kuttu ka atta that can be easily prepared during fasts or vrats. The recipe is vegan and gluten free too.",
            "Prep Time": "15 minutes",
            "Cook Time": "15 minutes",
            "Total Time": "30 minutes",
            "Cuisine": "North Indian",
            "Course": "Main Course"
        },
        {
            "Title": "Sabudana Tikki | Sabudana Cutlet",
            "Ingredients": "½, cup, sabudana, (tapioca pearls or sago), 1, large potato, or 130 grams potato – boiled, peeled and mashed, ½, teaspoon, chopped green chilies, or 1 green chili, 10 to 12, cashews, – chopped or 4 tablespoon chopped cashews or 2 tablespoon roasted peanuts, coarsely crushed, ½, tablespoon, chopped raisins, or 8 to 9 raisins – chopped, ½, teaspoon, cumin powder, ¼, teaspoon, dry mango powder, (amchur) or add as per taste, 1, tablespoon, rock salt, – edible and food grade, ( ), add as required, 3 to 4, tablespoons, peanut oil, – for pan frying",
            "Instructions": [
                "Rinse and then soak the sabudana pearls in water covering them above 1 inch, for 5 to 6 hours or overnight. Depending on the quality of sabudana you can even soak for 2 to 3 hours.",
                "When properly soaked, the sabudana pearl, should get mashed when pressed. If you feel some hardness in the center, then soak for some more time.",
                "Then drain the soaked sabudana pearls very well in a strainer.",
                "Boil or steam 1 large potato in a pressure cooker, steamer or microwave oven. The potato has to be well cooked. Drain all the water from the boiled potato.",
                "When the potato is hot or becomes warm, peel and mash it very well in a bowl. Let the mashed potatoes become lukewarm or cool at room temperature.",
                "Later add the sabudana, chopped green chillies, chopped cashews and raisins to the mashed potatoes.",
                "Add cumin powder, dry mango powder. Also add rock salt (sendha namak) as required. You can also use roasted and slightly crushed peanuts instead of cashews.",
                "Mix very well.",
                "Then form flat patties from the mixture. Keep the width of the patties to ⅓ inch as when cooking they cook quickly from outside. If you make thick tikkis, then the outsides become golden, but the center will feel raw. Since we are pan frying the sabudana tikki and not deep frying.",
                "Heat 2 tablespoons peanut oil in a skillet or frying pan. Place 4 to 5 sabudana tikki in the pan. Fry them on medium heat.",
                "When the base is lightly browned, flip and pan fry the other side. Flip again with a spatula when the second side is golden and crisp.",
                "Flip a couple of times more till they are crisp and golden from both sides. If required you can add 1 to 2 tablespoons more oil.",
                "Place the fried sabudana cutlet on kitchen paper towels. Fry the remaining batch in the same way adding 1 to 2 tablespoons more oil.",
                "Serve sabudana tikki hot or warm with fasting a satvik green chutney or coconut chutney.",
                "You can also serve sabudana cutlet with curd (yogurt) sweetened with some sugar."
            ],
            "Description": "Sabudana tikki are thin pan-fried patties made with tapioca pearls, mashed potatoes and spices. Also known as sabudana cutlet, these crispy patties make for a delicious snack that will get over in no time. This recipe is suitable for Hindu fasting days like Ekadashi, Navratri, Mahashivratri or Chaturthi. It is also easy to customize this dish with the ingredients you include during your fast.",
            "Prep Time": "",
            "Cook Time": "20 minutes",
            "Total Time": "",
            "Cuisine": "Indian",
            "Course": "Snacks"
        },
        {
            "Title": "Sama Chawal Idli Recipe | Vrat Ki Idli Recipe | Vari Rice Idli Recipe",
            "Ingredients": "1, cup, sama ke chawal, (barnyard millet), ½, cup, sabudana, (tapioca pearls), 2, pinches, of baking soda, rock salt (edible and food grade) as required, soak for 2-3 hours., water for soaking",
            "Instructions": [],
            "Description": "Sama chawal, which is not actually rice but a seed, is a very popular ingredient in India. It is used in the recipes of many dishes that are consumed during the religious fasting season. Just like this Sama Chawal Idli or Vrat Ki Idli – a unique variation to the South Indian idlis. These are made without the regular rice, but with sama. Thus, a perfect choice of dish for your vrats or fasts and even on regular days. A vegan, gluten free and quite a nutritious recipe.",
            "Prep Time": "",
            "Cook Time": "10 minutes",
            "Total Time": "",
            "Cuisine": "Indian",
            "Course": "Breakfast"
        },
        {
            "Title": "Rajgira Puri | Amaranth Puri",
            "Ingredients": "2, cups, amaranth flour, (rajgire ka atta), 1, potato, – large, rock salt (edible and food grade), (sendha namak) as required, water, – as required to knead the dough, some rajgira atta, or amaranth flour – for dusting, oil, – for deep frying, as needed",
            "Instructions": [
                "Boil the potato with water almost covering it in a pan or pot.",
                "The potatoes can also be peeled first and then halved or quartered or cubed and later boiled in water.",
                "Once fork tender, drain all the water. Let the potato cool completely.",
                "Peel and mash it finely in a bowl. There should be no chunks in the mashed potatoes.",
                "Add rajgira flour and salt to the mashed potatoes. First mix the whole mixture well.",
                "Then add very little water, just about ½ to 1 teaspoon and begin to knead the dough.",
                "Again add ½ to 1 teaspoon of water and knead so that there is no dryness in the dough.",
                "Remember to add water as needed while kneading the dough.",
                "The dough should not be sticky or look floury or dry.",
                "Pinch portions of th dough and roll to small to medium-sized balls. Keep aside covered with a lid or a cotton napkin.",
                "On a flour dusted work surface, roll each ball to medium-sized poori, neither thin nor thick. Fry them in medium hot oil in batches until puffy and golden.",
                "Remove the rajgira puri with a slotted spoon and place them on kitchen paper napkins to remove excess oil.",
                "Serve Rajgire ke Poori hot or warm with a satvik vegetable curry/sabzi or paneer curry."
            ],
            "Description": "The Hindu vrat or fasting season in India is not just about observing fasts to cleanse the body, mind and soul but is also about mindful eating and consumption of some really nutritious and wholesome produce. One such plant is amaranth or rajgira, the seeds and flour of which, is very popular during religious fasting. Rajgira Puri is one of those many dishes that can be made with rajgira atta (amaranth flour). This happens to a be a non-cereal product, thus, is naturally gluten-free. This recipe also uses all plant-based ingredients and is therefore, vegan too.",
            "Prep Time": "25 minutes",
            "Cook Time": "25 minutes",
            "Total Time": "50 minutes",
            "Cuisine": "Indian",
            "Course": "Main Course"
        },
        {
            "Title": "Sabudana Thalipeeth | Sabudana Roti",
            "Ingredients": "⅔, cup, sabudana, (tapioca pearls), 2, medium or large potatoes, – boiled, peeled and mashed, ½, teaspoon, cumin powder, 4, tablespoon, peanuts, – roasted and coarsely ground, ½, inch, ginger, – finely chopped or grated, ¼, cup, coriander leaves, – chopped, 1, teaspoon, lemon juice, 1, teaspoon, sugar, or add as required, rock salt (edible and food grade), (sendha namak) as required, peanut oil, or ghee as required for pan-frying",
            "Instructions": [
                "Pick and rinse the sabudana well till you get transparent water when rinsing.",
                "Soak them overnight in enough water in a bowl.",
                "The next day, drain all the water very well.",
                "Make sure there is no water in them.",
                "Add the mashed potatoes and all the ingredients to the soaked sabudana. Mix well.",
                "Heat a non stick frying pan or a well seasoned cast uron skillet or tawa.",
                "Spread 1 or 2 teaspoon of peanut oil or ghee on the pan.",
                "You can also flatten on a ziplock bag.",
                "Place the flattened round (thalipeeth) on the frying pan. Keep the heat to medium-low or medium.",
                "If you have a large pan, you can cook 2 to 3 thalipeeth at the same time.",
                "On fasting days, serve sabudana thalipeeth with any chutney or raita or homemade tomato ketchup made without onions and garlic.",
                "You can also have it with curd (yogurt) that has been sweetened with some sugar or jaggery.",
                "For non-fasting days, you can serve with a chutney or raita or tomato ketchup made with onions or garlic."
            ],
            "Description": "Sabudana thalipeeth are crispy and soft pancakes made with tapioca pearls, mashed potatoes, ground peanuts and spices. These delicious sago pancakes are often made for Hindu religious fasting or vrat like Navratri, Ekadashi and Mahashivratri. They are also known as Upvasache Thalipeeth in the Marathi language.",
            "Prep Time": "",
            "Cook Time": "30 minutes",
            "Total Time": "",
            "Cuisine": "Indian, Maharashtrian",
            "Course": "Snacks"
        },
        {
            "Title": "Sabudana Vada Recipe (Traditional Fasting Recipe)",
            "Ingredients": "1, cup, sabudana, (sago or tapioca pearls), 4, potatoes, – medium-sized, ½, cup, peanuts, 1, teaspoon, cumin seeds, – optional, 1 to 2, green chillies, – finely chopped or ½ to 1 teaspoon, 1, teaspoon, ginger, – finely chopped, 2, teaspoons, lemon juice, (optional), 2, tablespoons, chopped coriander leaves, –  optional, 1.5, teaspoon, sugar, or as required, 1 to 2, tablespoons, buckwheat flour, or amaranth flour – optional, rock salt, (edible and food grade) or sendha namak, oil, as required, for deep frying",
            "Instructions": [
                "You need to plan ahead and soak the sago pearls. It is very important to soak the sago really well.",
                "Please refrain from using un-soaked or under-soaked sabudana to avoid scalding or burns as they will burst and shatter in oil when frying.",
                "First optionally, using a colander or mesh strainer rinse 1 cup sabudana lightly twice draining all the water.",
                "Soak the sabudana or sago in water for 5 hours at least or overnight. I soaked the sago pearls overnight and by morning they had become soft.",
                "When properly soaked, the sabudana pearls will be tender without any hard center. When you press the pearls between your forefinger and thumb, they should get mashed easily with a floury moist texture on your fingers.",
                "If you feel some hardness in the center, then soak for some more time. Drain all the water really well from the soaked sabudana.",
                "There should not be any water logged in the soaked pearls. Water will make the patties moist and sticky. The patties will soak up a good amount of oil while frying making them loaded with oil. So drain the water really well.",
                "You can opt to gently and lightly press the soaked pearls in the strainer with a spoon or spatula. Or set aside the pearls in a strainer (keeping a bowl beneath) for some 20 to 30 minutes dripping of any extra water.",
                "After draining the water thoroughly transfer the sabudana in a mixing bowl and set aside.",
                "Scrub and rinse 4 medium-sized potatoes thoroughly in water first.",
                "Place the potatoes in a 3 litre cooker. Add water which just about covers the potatoes. Pressure cook potatoes for 10 to 12 minutes or 4 to 5 whistles on medium heat.",
                "When the pressure settles down on its own in the cooker, open the lid and check the potatoes. Pass a knife or fork through the center of the potatoes and it should slide easily without any resistance.",
                "Take water and add peeled and chopped potatoes. The water should cover the potatoes. Add a 2 to 3 pinches of salt if preferred. Cover and simmer potatoes until fork tender. Drain the water really well. When the potatoes are tender, using a strainer, drain all the water.",
                "Place a trivet in the inner steel of your Instant Pot. Add 1.5 cups water. Place the rinsed potatoes on the trivet. Seal with the lid and position the valve to sealing. Press the manual/pressure cook button and set the time to 10 or 12 minutes with high pressure option.",
                "After you hear the beep when the pressure cooking is complete, wait for 5 minutes and then do a quick pressure release. Remove the potatoes with tongs and place them in a plate or tray. Check the potatoes to see if they are cooked tender with a fork or knife.",
                "Let the potatoes become warm. Later peel and then chop them or mash them.",
                "On a skillet or in a shallow pan, roast the groundnuts/peanuts till they become crisp and crunchy. Cool and then coarsely powder in a mortar-pestle or in a dry grinder. You can even make a fine powder.",
                "Add the mashed potatoes and coarsely ground roasted groundnuts to the sabudana in the mixing bowl.",
                "Add edible rock salt, cumin seeds, sugar, ginger, green chillies, coriander leaves and lemon juice to the sabudana . Mix the entire mixture very well.",
                "Now take some portion of the mixture in your hands and shape them into flat round vada or patty. Set aside.",
                "Repeat until you use up the entire dough mixture.",
                "Heat oil for deep frying in a kadai. Add a tiny ball made from the mixture.",
                "Fry it on medium flame. If this ball does not break while frying, then you are good to go.",
                "If it breaks, then add 1 to 2 tablespoons of rajgira atta (or amaranth flour) to the mixture and mix well.",
                "Now gently place the vada in the oil. Keep the heat to medium or medium-high while frying. If the oil is warm, the vada will absorb a lot of oil and become soggy.",
                "Add the vada for frying depending on the size of the kadai. Do not crowd the kadai or pan.",
                "When one side gets golden, then only flip the vada. Otherwise, don't even touch as they might break if not cooked.",
                "Turn over a couple of times so as to fry the sabudana vada evenly. Fry until they are crisp and golden",
                "Remove them with a slotted spoon. Place on kitchen paper towels to absorb excess oil. Fry the remaining batches of the mixture this way.",
                "Serve sabudana vada hot or warm.",
                "Sabudana Vada can be made for Hindu fasting days or an evening snack too. It is crispy and delicious and thus tastes great with simple",
                "and even sweetened",
                ".",
                "To make the sweetened curd, you will just need to add some sugar to the curd and mix it. If short of time, you can even serve with sweet",
                "or tomato ketchup.",
                "You can also enjoy it with",
                ".",
                "To make ahead, boil, peel, mash and store the potatoes in your refrigerator a day prior. Roast peanuts and powder them. Refrigerate them for 1 to 2 days.",
                "You can soak the sabudana a day earlier and keep it in the refrigerator after draining the water.",
                "Any leftover dough mixture stays well in the fridge for 1 to 2 days."
            ],
            "Description": "Sabudana Vada,",
            "Prep Time": "",
            "Cook Time": "30 minutes",
            "Total Time": "",
            "Cuisine": "Maharashtrian",
            "Course": "Breakfast, Snacks"
        },
        {
            "Title": "Farali Pattice",
            "Ingredients": "3, large potatoes, or 350 grams potatoes, 3, tablespoon, arrow root flour, (paniphal flour), rock salt (edible and food grade), as required, ¼, cup, tightly packed grated coconut, 3, tablespoon, peanuts,, roasted and coarsely crushed, 3, tablespoon, cashew,, coarsely crushed or finely chopped, 2, tablespoon, raisins,, chopped, ½, teaspoon, sugar, 1, teaspoon, lemon juice, 2 to 2.5, tablespoon, chopped coriander leaves, ½, teaspoon, green chili paste, or 1 small green chili crushed in mortar-pestle to a paste, rock salt (edible and food grade) as required, 3, tablespoon, peanut oil, or 2 tablespoon Ghee for frying",
            "Instructions": [
                "Rinse the potatoes very well in fresh water.",
                "Boil potatoes in a steamer or pressure cooker till they are tender and completely cooked.",
                "Mash the potatoes with a potato masher or fork very well. Allow the mashed potatoes to cool at room temperature.",
                "Once the mashed potatoes have come to room temperature, then add arrowroot flour and salt. Since these patties are made during fasting I have arrowroot flour. You can also add buckwheat flour or water chestnut flour if making for fasting. If making for regular days, then add corn starch, rice flour or bread crumbs.",
                "Mix the arrowroot flour with the mashed potatoes very well and lightly knead the mixture.",
                "Then heat a small pan and add peanuts.",
                "Roast the peanuts stirring often on a low flame till they become crunchy and have a few black spots on them. Remove the peanuts and keep aside. Ensure that the peanuts are evenly cooked.",
                "In the same pan add cashews.",
                "In a another mixing bowl, take the grated coconut.",
                "Then add chopped raisins, sugar, lemon juice, chopped coriander leaves and green chili paste. You can also add fresh ginger paste if you want.",
                "Stir and mix the stuffing mixture very well.",
                "Make medium sized balls from the potato dough mixture.",
                "Place 1 or 2 tablespoons of the prepared stuffing.",
                "Prepare all the farali patties this way.",
                "Heat 3 tablespoons of oil for frying in a tava or griddle or skillet. Coat the pattice with arrowroot flour. Dust off the excess flour from the pattice. This step of coating the pattice with arrowroot flour is optional and you can also skip it.",
                "Place the arrowroot flour coated pattice in medium hot oil for pan frying. You can also shallow fry.",
                "When one side is partly cooked and light golden, gently flip over with a spatula.",
                "Flip again when the other side is golden.",
                "Drain them on kitchen paper towels to absorb extra oil.",
                "Serve farali pattice hot with a no onion no garlic coriander chutney, sweetened curd or tamarind dates chutney."
            ],
            "Description": "Farali pattice is an easy snack of patties made with potatoes and stuffed with a sweet filling of coconut, nuts and raisins. This dish is from the Gujarati cuisine that is made during fast or upvas. I often make these pattice during Navratri and also on regular days.",
            "Prep Time": "30 minutes",
            "Cook Time": "30 minutes",
            "Total Time": "60 minutes",
            "Cuisine": "Gujarati",
            "Course": "Snacks, Starters"
        },
        {
            "Title": "Rajgira Paratha | Amaranth Roti",
            "Ingredients": "¾, cup, amaranth flour, (rajgira atta), 2, small to medium potatoes, or 1 large potato or ½ to ⅔ cup tightly packed mashed potatoes or 100 to 125 grams potatoes, ½, teaspoon, cumin powder, (jeera powder), 1 or 2, green chilies, – crushed or finely chopped or 1 to 1.5 teaspoon crushed green chilies, rock salt (edible and food grade), (sendha namak) as required. used specially for religious fasting days or vrat., ghee or oil as required",
            "Instructions": [
                "In a pan or bowl take the amaranth flour. I ground the flour at home using raw amaranth grains. ½ cup of amaranth grains yielded about ¾ cup flour.",
                "Add 1 or 2 tablespoons of water in parts and knead to a smooth dough. The addition of water depends on the quality of flour. Hence add as accordingly. Make sure you don't add too much of water. Allow the dough to come at room temperature as it will be slightly warm due to the addition of the hot mashed potatoes.",
                "Now gently remove the paratha from the cloth or place the cloth upside down on a hot tava or skillet and peel of cotton cloth. I do the first method of removing the rajgira paratha from the cloth and then placing it on the hot tava.",
                "Apply ghee or oil on this side as per your preferences. Flip again carefully using a spatula. Apply ghee or oil on this side.",
                "Flip a couple of times till the roti has become evenly golden and roasted evenly.",
                "Serve these rajgira roti hot or warm with curd or any curry meant for fasting like vrat ki kadhi or vrat ke dahi aloo or kaddu sabji or vrat ki aloo sabji."
            ],
            "Description": "Rajgira paratha is a healthy gluten-free flatbread made with amaranth flour (known as rajgira atta in Hindi), mashed potatoes and seasonings. Usually these rajgira roti or paratha are made during fasting or vrat days. Rajgira is one of the commonly used ingredients for Hindu religious fasting. Apart from these parathas you can also make",
            "Prep Time": "20 minutes",
            "Cook Time": "20 minutes",
            "Total Time": "40 minutes",
            "Cuisine": "Indian",
            "Course": "Main Course"
        },
        {
            "Title": "Easy Aloo ki Sabji | Satvik Aloo Tamatar Ki Sabji",
            "Ingredients": "2, potatoes, – medium-sized or 1 extra large potato, 4, tomatoes, – medium-sized, about 2 cups finely chopped tomatoes, 1, teaspoon, cumin seeds, ¼, teaspoon, red chili powder, or cayenne pepper, ¼, teaspoon, black pepper powder, 1, cup, water, 1, tablespoon, oil, or 1 tablespoon ghee, 1 to 2, tablespoons, coriander leaves, – chopped, for garnish, rock salt, – edible and food grade (sendha namak), add as required. or use regular salt or pink salt",
            "Instructions": [
                "Take 1.25 to 1.5 cups water in a 2 litre pressure cooker or pressure pan. Add 2 potatoes and the salt. Boil the potatoes on medium heat for 2 to 3 whistles.",
                "Let the pressure drop naturally in the cooker, then only open the lid.",
                "The potatoes should be just cooked. They should not become crumbly or mushy.",
                "Remove the potatoes and set aside on a plate to cool.",
                "Let the potatoes become warm or cool down slightly.",
                "Then peel the and dice them.",
                "Heat the oil or ghee in a pan.",
                "Add cumin seeds and let them crackle on low heat.",
                "Then add finely chopped tomatoes.",
                "Sauté till they become soft and mushy, stirring often on medium-low to medium heat.",
                "You will see the oil leaving the sides once the tomatoes have cooked completely.",
                "Next add red chili powder, black pepper and salt as required. Mix well.",
                "Add the chopped potatoes and stir to mix again.",
                "Add 1 cup water.",
                "Stir to mix well. Let the gravy cook for 7 to 8 minutes or more on a low heat, till it thickens slightly.",
                "Mash a few potato pieces with a spoon to help in thickening of the gravy.",
                "Garnish with chopped coriander leaves.",
                "Serve the Aloo ki Sabji hot or warm with your preferred breads like roti, paratha or poori."
            ],
            "Description": "This Easy Aloo Ki Sabji or Aloo Tamatar Sabji is a potato gravy preparation made with tomatoes and a few spices. This particular dish does not have onion, garlic or heavy spices and thus a satvik recipe. With minimum ingredients, Aloo Tamatar ki Sabji is very simple and easy to prepare, and makes for the perfect food on any day including the Hindu fasting days (vrat). The recipe is also vegan.",
            "Prep Time": "20 minutes",
            "Cook Time": "10 minutes",
            "Total Time": "30 minutes",
            "Cuisine": "North Indian",
            "Course": "Main Course"
        },
        {
            "Title": "Singhare ki Poori for Ekadasi Vrat",
            "Ingredients": "2.5 to 3, cups, singhare ka atta, (water chestnut flour), 1, cup, mashed potatoes, or 2 medium sized boiled potatoes, 1 or 2, green chilies, , minced or finely crushed in a mortar-pestle, 1, teaspoon, cumin powder, or coarsely crushed cumin, 2, teaspoon, oil, rock salt (edible and food grade), or sendha namak as required, water to bind the dough, oil, to deep fry pooris as required",
            "Instructions": [
                "Rinse the potatoes very well in fresh water. Then add them to a 2 liter pressure cooker. Add enough water covering the potatoes. Also season with a few pinches of edible rock salt.",
                "Steam or pressure cook the potatoes for 3 to 4 whistles or until they have softened and are fork tender.",
                "When the pressure drops on its own in the cooker then only open the lid.",
                "Remove the cooked potatoes with pasta tongs and set them aside on a plate. Ensure that the potatoes are drained well of water.",
                "When warm, peel and mash the potatoes with a fork or a potato masher in a bowl.",
                "Add the water chestnut flour, minced green chilies, cumin powder, edible rock salt and oil.",
                "Mix the ingredients first.",
                "Add very little water about 1 to 2 tablespoons and begin to knead the dough.",
                "Don't add water unless required.",
                "The dough should be smooth, soft and pliable.",
                "The dough should not be sticky. If the dough looks sticky then sprinkle some water chestnut flour and knead again.",
                "With a sticky dough you won't be able to roll the puri.",
                "Take small or medium sized balls from the dough. Shape them to a neat ball between your palms.",
                "Sprinkle some water chestnut flour on the rolling board and on the dough ball.",
                "When the oil is medium hot, place the poori gently in the oil.",
                "When one sides puffs up, aid the poori to puff up by gently nudging it with the slotted spoon. When this side becomes golden then gently turn over and fry the second side until golden and crisp.",
                "If needed you can flip a few more times for even cooking.",
                "When singhare ki puri is golden, remove from the slotted spoon and drain on paper towels to remove excess oil. This way fry the remaining puri in batches.",
                "Serve the singhare ki poori hot with vrat ke aloo or kaddu ki sabji."
            ],
            "Description": "Singhare ki poori is a delicious Indian fry bread made with water chestnut flour, mashed potatoes, edible rock salt and a few spices. These singhare ke atte ki puri are made during Hindu religious fasting days like Shivratri fast or Ekadashi fast or",
            "Prep Time": "25 minutes",
            "Cook Time": "25 minutes",
            "Total Time": "50 minutes",
            "Cuisine": "North Indian",
            "Course": "Main Course"
        },
        {
            "Title": "Mixture Recipe | Madras Mixture",
            "Ingredients": "1, teaspoon, carom seeds, (ajwain, omam), 1, cup, gram flour, (besan) – 120 grams, ½, cup, or 100 grams, 1, generous pinch, asafoetida, (hing), 2, pinches, turmeric powder, – optional, ¼, teaspoon, red chilli powder, 1, teaspoon, salt, or add as required, 1, tablespoon, oil, or ghee or butter, 6 to 7, tablespoons, water, or add as required, oil, as required for deep frying, ½, cup, gram flour, (besan), 1, tablespoon, 1, pinch, asafoetida, (hing), ½, teaspoon, salt, or as required, 8 to 9, tablespoons, water, to make thin batter, oil, for deep frying, as required, ¼, cup, peanuts, 25, cashews, ¼, cup, roasted chana dal, (roasted bengal gram), ¼, cup, poha, (flattened rice or parched rice), 12 to 15, curry leaves, ⅛, teaspoon, asafoetida, (hing) or about 2 pinches, ½, teaspoon, red chilli powder, 2, cups, omapodi, or add as required, 2, cups, boondi, or add as required, salt, as required",
            "Instructions": [
                "Heat a small pan and keep flame to a low. Add 1 teaspoon ajwain (carom seeds).",
                "Stirring often roast ajwain for some seconds till they are aromatic. No need to brown them. Let them cool down.",
                "Then add them in a small dry grinder jar or a spice grinder.",
                "Grind to a fine powder. Keep aside. You can even crush ajwain in a mortar-pestle. In this case, when adding ajwain, use a tea strainer and sift the ajwain powder through it.",
                "This is done so that when pressing through the sev maker, the dough strands do not break.",
                "In a mixing bowl or pan take 1 cup besan (gram flour) and ½ cup rice flour.",
                "Add the ground ajwain powder.",
                "Then add 1 generous pinch asafoetida (hing), 2 pinches turmeric powder, ¼ teaspoon red chilli powder and 1 teaspoon salt. You can add salt as per taste.",
                "Turmeric powder can be skipped. For a spicy omapodi, you can increase the amount of red chilli powder. For more crispiness you can add a pinch of baking soda also.",
                "Mix very well with a spoon or spatula.",
                "Now heat 1 tablespoon oil in a steel bowl or a steel measuring cup.",
                "When the oil becomes hot, add it to the flour mixture. Instead of oil you can also use ghee or butter.",
                "Now add water in parts. First add 2 to 3 tablespoons of water. Mix well and begin to knead to a smooth dough.",
                "Overall I used 7 tablespoons of water. You can add 6 to 7 tablespoons of water depending on the quality of besan and rice flour.",
                "Knead to a smooth dough. If the dough becomes sticky, then you can add some more besan. If the dough looks dry, then add some more water and knead again. Cover the bowl and set aside.",
                "Use the disc to make sev or omapodi and assemble the sev press or murukku press. You can even use the disc with fine holes. Also heat a kadai and add oil as required for deep frying omapodi.",
                "Apply some water or oil in the sev/murukku maker. Then take a portion of the omapodi dough and place it inside the sev maker. Cover with the top part and keep aside.",
                "Let the oil in the kadai become medium hot. Check the oil temperature by adding a small tiny piece of the omapodi dough.",
                "If the small piece of dough comes up gradually and steadily on top, the oil is hot enough to fry.",
                "If it comes up too quickly, then oil is too hot. If it settles down at bottom of kadai or comes up very slowly, the oil is not hot enough for frying.",
                "When the oil is hot enough, directly press holding the sev maker on top of the oil and let the sev directly fall in the oil.",
                "While pressing rotate in a concentric circle from the center to outwards similar to making a chakli. Do not over crowd the kadai with omapodi.",
                "Add as much as needed without overcrowding the kadai. Be careful when pressing the dough in the oil.",
                "After the omapodi is pressed in the oil, break the top strands with a spoon or knife and let the dough strands fall in the oil.",
                "After adding the omapodi, do not touch them immediately with the slotted spoon as they break. Let them get fried first for a minute.",
                "They need to become crisp first and then you can turn them over with the slotted spoon.",
                "Gently begin to turn with a slotted spoon.",
                "Now fry the second side. You can turn over a couple of times for even frying.",
                "When the oil stops sizzling, continue to fry for some more seconds till the omapodi are golden and crisp. Turn over as needed when frying.",
                "Do not break the omapodi while frying as then it becomes extra work to remove the small pieces of omapodi from the oil. So fry the entire round shaped omapodi as one piece and do not break it.",
                "Once done then remove omapodi with a slotted spoon or a strainer spoon draining off the extra oil.",
                "Place them on kitchen paper towels. Fry the remaining omapodi in the same way.",
                "When the omapodi are cooled, then place them in an air tight container or box. Break omapodi before adding in the mixture.",
                "Take ½ cup besan (gram flour) and 1 tablespoon rice flour in a mixing bowl.",
                "Then add 1 pinch asafoetida (hing), 1 pinch of baking soda, 2 pinches turmeric powder and ½ teaspoon salt.",
                "Mix everything with a spoon.",
                "Now add 8 to 9 tablespoons water in parts.",
                "Using a wired whisk make a smooth and slightly thin batter without lumps.",
                "The batter consistency is slightly thin. The amount of water to be added depends on the quality of gram flour. So add accordingly.",
                "Heat oil for frying in a kadai or pan. When the oil becomes hot, then tap the wired whisk or the handle of a spoon which has a bit of batter in to the hot oil.",
                "Now take a dry perforated ladle/",
                "and place it above the hot oil. Don't keep too much on a height, as the batter droplets, when falling from a height, do not give a round shape.",
                "With a spoon add some batter on the perforated spoon ladle/jhara. Spread the batter lightly with a spoon. Finish up the batter on the perforated spoon ladle this way.",
                "On a medium flame heat to fry the boondi. Do not turn them. Let them become slightly crisp and then turn them.",
                "When the boondi have become crisp, turn them with a slotted spoon.",
                "After the oil stops sizzling, continue to fry the boondi for some more seconds so that they become crisp.",
                "Remove with a strainer spoon or a slotted spoon draining the extra oil.",
                "Place the fried salted boondi on kitchen paper towels.",
                "After each batch, wipe the perforated ladle/",
                "with a clean piece of moist thin cotton kitchen towel from both sides.",
                "Continue to fry boondi this way. Once the boondi cools at room temparature, store in an air tight jar or box.",
                "When the boondi are frying you can remove the other ingredients and keep everything ready for the next step.",
                "Use a fine sieve ladle with a handle to fry as shown in the stepwise photos in the post. Heat oil on medium heat.",
                "Take the peanuts first in the sieve. Immerse in the oil and begin to fry.",
                "With a spoon stir often while frying so that the peanuts are fried evenly.",
                "Fry peanuts till they are crisp and crunchy.",
                "Using the same seive drain the extra oil. So this ladle is helpful for frying as well as for getting rid of extra oil after frying.",
                "Place the fried peanuts on kitchen paper towel.",
                "Then take cashews in the same ladle.",
                "Stirring often with a spoon fry cashews till they are golden.",
                "Place the fried cashews on the same kitchen paper towel.",
                "Next take roasted chana dal.",
                "Stirring often with a spoon fry roasted chana dal till they are crisp.",
                "Frying chana dal will take some seconds and their color will change.",
                "Place the fried chana dal on the same kitchen paper towel.",
                "Now take thick poha.",
                "Stirring often with a spoon fry poha till they are crisp and pale golden. Don't brown the poha.",
                "Once the poha is fried well, then drain off the extra oil using the same ladle.",
                "Place the fried poha on the same kitchen paper towel.",
                "Next add curry leaves. stirring often fry curry leaves till they become crisp.",
                "Curry leaves take a few seconds to fry. Place the fried curry leaves on the kitchen paper towel.",
                "In a large bowl or tray or plate take 2 cups of the omapodi and 2 cups of fried boondi.",
                "The remaining omapodi you can serve as a snack. With the remaining boondi, you can make boondi raita. You can also take more of the omapodi or boondi if you prefer.",
                "Add the fried nuts, poha, chana dal, curry leaves.",
                "Add ½ teaspoon red chilli powder, ⅛ teaspoon asafoetida (hing) and salt over the fried chana dal, poha, nuts and curry leaves as they will be still hot.",
                "Mix well with a spoon first and then later you can mix with your hands.",
                "Then place the mixture in a jar or container. Store at room temperature.",
                "Serve South Indian Mixture as a diwali snack or a tea time snack."
            ],
            "Description": "Here is another of my recipe versions for the popular and tasty Madras Mixture, which is basically a snack dish made of a medley of various ingredients, dry fruits/nuts, seasonings and spices. Though you might find a little hesitant towards this Mixture Recipe by looking at the number of steps in the methodology, but trust me, it is going to be totally worth once you prepare it. So, just go for it! Because serving the homemade version of this snack mixture during Diwali, will also just brighten the already lit festivities.",
            "Prep Time": "15 minutes",
            "Cook Time": "",
            "Total Time": "",
            "Cuisine": "South Indian, Tamil Nadu",
            "Course": "Snacks"
        },
        {
            "Title": "Kara Boondi Recipe | Masala Boondi Mixture",
            "Ingredients": "½, cup, besan, (gram flour), 1, tablespoon, 1, pinch, asafoetida, (hing), 1, pinch, baking soda, 2, pinches, turmeric powder, ½, teaspoon, salt, or add as required, 8 to 9, tablespoons, water, or add as required, 1 to 2, teaspoons, oil or ghee, 8 to 9, curry leaves, 12 to 15, cashews, 2, tablespoons, peanut, ¼, teaspoon, kashmiri red chilli powder, 1, pinch, asafoetida, (hing), salt as required, oil, as required for deep frying",
            "Instructions": [
                "Take ½ cup besan and 1 tablespoon rice flour in a mixing bowl.",
                "Then add 1 pinch asafoetida (hing), 1 pinch of baking soda, 2 pinches turmeric powder and ½ teaspoon salt.",
                "Mix everything with a spoon.",
                "Now add 8 to 9 tablespoons water in parts.",
                "Using a wired whisk make a smooth and slightly thin batter without lumps.",
                "The batter consistency is slightly thin. The amount of water to be added depends on the quality of besan (gram flour). So add accordingly.",
                "Heat oil for frying in a kadai or pan. When the oil becomes hot, then tap the wired whisk or the handle of a spoon which has a bit of batter in to the hot oil.",
                "The boondis should have a round shape. If they become flat, then the batter is thin. If they get tail ends, then the batter is thick. If the batter is thin, then add 1 to 2 teaspoons of gram flour and check by frying a few boondis. If the batter is thick, then add a few teaspoons of water and then do the same test. Once you get the correct consistency, proceed with the next step of frying the boondis.",
                "Now take a dry perforated ladle/jhara and place it above the hot oil. Don’t keep too much on a height, as the batter droplets, when falling from a height, do not give a round shape. With a spoon add some batter on the perforated spoon ladle/jhara. Spread the batter lightly with a spoon. Finish up the batter on the perforated spoon ladle this way.",
                "On a medium flame begin to fry the boondis. Do not turn them. Let them become slightly crisp and then turn them.",
                "When the boondis have become crisp, turn them with a slotted spoon.",
                "Continue to fry till the boondis becomes crisp and golden.",
                "After the oil stops sizzling, continue to fry the boondis for some more seconds so that they become crisp.",
                "Remove with a strainer spoon or a slotted spoon draining the extra oil.",
                "Place the fried salted boondi on kitchen paper towels.",
                "After each batch, wipe the perforated ladle/jhara with a clean piece of moist thin cotton kitchen towel from both sides. Continue to fry boondis this way.",
                "In another small pan, take 1 to 2 teaspoons ghee or oil.",
                "Add 2 tablespoons peanuts.",
                "Stirring them often fry till the peanuts becomes crunchy and change their color. Remove and keep aside on kitchen paper towels.",
                "Then add 12 to 15 cashews.",
                "Stirring often fry the cashews till they become golden. Remove and keep aside on kitchen paper towels. You can add more peanuts or cashews if you want.",
                "Now add 8 to  9 curry leaves. fry for some seconds till the curry leaves become crisp. Do not burn them.",
                "Remove and keep aside on kitchen paper towels.",
                "Now take the fried peanuts, cashews, curry leaves and boondi in a plate or bowl. Add ¼  teaspoon kashmiri red chilli powder and 1 pinch asafoetida. You can also add black pepper powder instead of red chilli powder. For a spicy taste you can add more red chilli powder.",
                "Add salt as per taste. mix very well.",
                "Store kara boondi mixture in an air tight container or jar.",
                "Serve kara boondi as a tea time snack or diwali snack."
            ],
            "Description": "You may know tiny fried pearls of spiced or plain gram flour mixture as ‘boondi’ across the Indian subcontinent. But here’s Kara Boondi or a Masala Boondi Mixture, which I’m sure, is going to get you addicted to it. Yes, it is this good! This is a South Indian style spiced Kara Boondi Recipe which is also a delectable, crunchy-munchy mix of boondi, peanuts, cashews, curry leaves and some spices and seasonings. A great choice as a festive treat, especially for Diwali. You should try this one, for sure!",
            "Prep Time": "5 minutes",
            "Cook Time": "40 minutes",
            "Total Time": "45 minutes",
            "Cuisine": "South Indian, Tamil Nadu",
            "Course": "Snacks"
        },
        {
            "Title": "Sev Recipe | Karasev | Besan Sev",
            "Ingredients": "1, cup, gram flour, (besan), ⅛, teaspoon, turmeric powder, ½, teaspoon, red chili powder, 1, pinch, asafoetida, (hing), ¼, teaspoon, carom seeds, (ajwain), ½, teaspoon, salt, or add as required, 1, pinch, baking soda, – optional, 2, tablespoons, hot oil, – to be added in the dough, 2, tablespoons, water, – to be added in the dough or add as required, 2, cups, oil, for deep frying or add as required",
            "Instructions": [
                "Measure and keep all the ingredients. Sieve the gram flour and set aside.",
                "Add the sifted besan in a mixing bowl or pan. Add all the spices like – teaspoon turmeric powder, red chili powder, carom seeds, asafoetida.",
                "Also add salt as required. If you are using baking soda then add it now.",
                "Mix everything very well. Make a small depression in the center of the flour. Set aside.",
                "For making the karasev, you will require the discs with slightly larger holes. Grease the chakli moulds and the discs with little oil.",
                "Heat 2 cups of oil in a pan or kadai on medium heat. The oil has to hot before you fry the sev. You can do a small test by adding a piece of dough, if it rises gradually and steadily. Then the oil is hot enough.",
                "In the moderately hot oil, directly press the sev maker to make sev. Move in a circular motion so that sev is equally distributed.",
                "The oil will sizzle as soon as it comes in contact with the sev.",
                "Fry until the color changes to golden and the besan sev becomes crisp and the oil stops sizzling.",
                "With a slotted spoon remove the fried besan sev from the oil.",
                "Repeat the same with leftover dough. Once they come to room temperature, then break the besan sev. Store into an air-tight container. The sev should last for about a month.",
                "Serve the karasev as a diwali savory snack or tea time snack."
            ],
            "Description": "I’ve got one of those quintessential Diwali snacky treats for you in this post of mine. Call it Besan Sev or Karasev or just Sev, these medium-thick, crispy and tasty spiced strands are just a thing of awesomeness. Gram flour (besan), some spices and seasonings are turned into a dough and fried to a golden perfection. This Sev recipe is also quick and isn’t any rocket science to get done with. I’d say, save this Sev Recipe for a yummylicious homemade snack.",
            "Prep Time": "15 minutes",
            "Cook Time": "20 minutes",
            "Total Time": "35 minutes",
            "Cuisine": "Indian, South Indian",
            "Course": "Snacks"
        },
        {
            "Title": "Thattai Recipe | Thattu Vadai",
            "Ingredients": "1, tablespoon, urad dal, – 10 to 11 grams, 1, cup, – 160 grams, 1, tablespoon, roasted chana dal, – 5 grams, 1, tablespoon, (salted or unsalted) or ghee, 1, tablespoon, chopped curry leaves, or 10 to 12 curry leaves chopped, 1, tablespoon, chana dal, –  soaked in hot water for 30 minutes, ¼, teaspoon, asafoetida powder, (hing), ½, teaspoon, salt, or add as required, 1, teaspoon, white sesame seeds, ½, teaspoon, red chilli powder, or add as required, 2, tablespoons, fresh grated coconut, – optional, 9 to 10, tablespoons, water, or add as required, oil as required, – for deep frying",
            "Instructions": [
                "Firstly rinse and then soak chana dal in hot water for 30 minutes.",
                "Heat a heavy kadai or pan. Keep the heat to low or medium-low. Add urad dal (husked and whole or split black gram).",
                "Lightly roast urad dal for 1 to 2 minutes. Urad dal need not be browned. Remove and set aside.",
                "In the same kadai or pan, add rice flour.",
                "On a low to medium-low heat stirring often, roast the rice flour till it becomes warm to touch.",
                "Remove and set aside in a mixing bowl.",
                "In a small grinder, take the roasted urad dal. Also add roasted chana dal. Roasted chana dal can be skipped too if you do not have it.",
                "Grind to a fine powder.",
                "In the bowl containing the rice flour add the ground lentil flours.",
                "Add chopped curry leaves, asafoetida powder, red chilli powder, white sesame seeds and salt. You can even add freshly grated coconut or thinly sliced fresh coconut (optional).",
                "Mix the salt, spices and herbs with the flours evenly.",
                "Now sprinkle 2 tablespoons water and add 1 tablespoon butter or ghee in the flour mixture. You can add opt to add ghee instead of butter. The butter can be cold or at room temperature.",
                "With your fingertips mix the butter with the flour. Mix thoroughly.",
                "Add 3 tablespoons water.",
                "Gently mix and start bringing the mixture together.",
                "Drain all the water and then add the soaked chana dal to the dough mix.",
                "Mix and then knead to a semi-soft dough. Add 3 to 4 tablespoons more water or as required while kneading the dough.",
                "I added about a total of 9.5 tablespoons of water. Addition of water will depend on the texture and quality of rice flour. So add in portions.",
                "– avoid making a soft dough as then it becomes difficult to shape and lift the thattai rounds. Do not make the dough too hard as then thattai will not be crisp. It will have a hard and dense texture.",
                "Also check the taste of dough and add more salt if needed. Cover and keep aside.",
                "Take a butter paper or parchment paper or a ziplock bag or a clean cotton napkin. Grease the butter paper or parchment paper with some oil.",
                "Keep oil for deep frying in a kadai or pan. Keep the heat to medium or medium-high.",
                "Make 5 to 6 thattai on the parchment paper.",
                "Lift the prepared thattai round gently from the paper.",
                "Gently place in the hot oil.",
                "Begin to fry thattai on a medium or medium-high heat.",
                "When one side is crisp, then flip over each thattai with a slotted or spider spoon.",
                "Fry the second side till crisp. You can flip a couple of times to get an even golden color and crispness.",
                "Fry thattai till crispy and crunchy. When the oil stops bubbling and sizzling, this means the thattai is fried well.",
                "Remove fried thattai with a slotted spoon and place on kitchen paper towels.",
                "When frying the first batch of thattai, shape the second batch and keep them ready. However do keep an eye on the batch of the thattai that is being fried. This way make all thattai in batches.",
                "As soon as the thattai cools at room temperature, place them in a steel box or jar.",
                "Serve thattai to the deities. If making as an evening snack, then serve with chai or filter coffee."
            ],
            "Description": "Bringing you one more recipe of a popular South Indian snack called Thattai or Thattu Vadai. This savory snack is common during the festivals of Diwali and Krishna Jayanti in the southern parts of India. Not just a festive treat, it is available all year round in sweet and bakery stores, in this part of the Indian subcontinent. This Thattai Recipe is one of those that’ll help you to master the art of making this dish. You just have to follow the methodology and give the tips, a read for even a better understanding.",
            "Prep Time": "20 minutes",
            "Cook Time": "20 minutes",
            "Total Time": "40 minutes",
            "Cuisine": "South Indian, Tamil Nadu",
            "Course": "Snacks"
        },
        {
            "Title": "Ribbon Pakoda | Ribbon Murukku",
            "Ingredients": "½, cup, roasted chana dal, – 70 grams, 1, dry red chilli, – broken and seeds removed, ½, teaspoon, cumin seeds, ½, cup, gram flour, (besan) – 70 grams, ½, cup, heaped rice flour, – 100 grams, ⅛, teaspoon, hing, or 2 pinches of hing (asafoetida), 1, teaspoon, salt, or add as required, 1, teaspoon, white sesame seeds, – optional, 2, tablespoons, (salted or unsalted) or oil, ⅓, cup, water, or add as required, oil, for deep frying as required",
            "Instructions": [
                "In a spice grinder or grinder jar, take the roasted chana dal, 1 dry red chilli (broken and seeds removed) and cumin seeds.",
                "You can choose to add ½ to 1 teaspoon red chili powder and ½ teaspoon cumin powder instead of dry red chili and cumin seeds.",
                "Grind to a fine powder and set aside.",
                "Take a plate, pan or a large mixing bowl. Place a sieve on top of it. Add gram flour and rice flour.",
                "Then add the ground roasted chana dal, salt and asafoetida.",
                "Sift the whole mixture.",
                "Next add white sesame seeds to the mixture and set aside.",
                "In a small pan or a bowl heat 2 tablespoons butter or oil. I have used salted butter, but you can even use unsalted butter.",
                "Heat till all the butter melts. Now add the hot melted butter in the flour mixture.",
                "With a spoon or spatula mix the butter with the flour. Mix very well. Check the taste and if required you can add some more salt.",
                "Now add ⅓ cup water in parts and begin to knead the flour mixture.",
                "Knead to a smooth and non-sticky dough. Cover and set aside. If the dough looks dry then you can add some more water. If it becomes sticky then add some more gram flour.",
                "Use the nozzle shown in the below picture for preparing ribbon pakoda. This one has serrated edges.",
                "You can even use the plain one without the serrated edges. Also heat a kadai and add oil as required for deep frying ribbon pakoda.",
                "Apply some water or oil in the chakli/murukku maker. Then take a portion of the dough and place it inside the murukku maker. Cover and seal with the top part and keep aside.",
                "Let the oil in the kadai become medium hot. Check the oil temperature by adding a small piece of the dough.",
                "If the dough comes up gradually and steadily on top, the oil is hot enough to fry. If it comes up too quickly, then oil is too hot.",
                "If it settles down at bottom of kadai or comes up very slowly, the oil is not hot enough.",
                "When the oil is hot enough, directly press holding the murukku maker on top of the oil and let the ribbon murukku directly fall in the oil.",
                "While pressing rotate in a concentric circle from the center to outwards on top of the kadai or pan.",
                "Do not over crowd the kadai with ribbon pakoda. Add as needed without overcrowding the kadai.",
                "After adding the murukku, do not touch them immediately with the slotted spoon as they break. Let them get fried first.",
                "They need to become crisp first and then you can turn them over with the slotted spoon.",
                "Fry till they have become light golden.",
                "Turn over the ribbon pakoda gently with a slotted spoon, so that they get fried evenly.",
                "Now fry this side also till it becomes light golden.",
                "Turn over a couple of times for even frying. Fry till they are crisp and golden.",
                "When the oil stops sizzling it means the pakoda are fried. Then remove them with a slotted spoon or a strainer spoon.",
                "Do not over brown or else the pakora becomes slightly dense. Also do not fry at low heat or low flame or else the pakora absorbs too much oil.",
                "Place them on kitchen paper towels. Fry the remaining pakoda in the same way.",
                "When they are cooled, then place them in an air-tight container or box.",
                "Serve ribbon pakoda as a diwali snack or a tea time snack."
            ],
            "Description": "Here’s another South Indian fried snack from the world of murukkus – the Ribbon Pakoda or Ribbon Murukku. Given its shape, which resembles more or less like a ribbon or even medium size bands, it is called so. This crisp, golden fried savory dish is also referred to as Ola Pakoda or Nada Thenkuzhal. The Ribbon Pakoda Recipe not just makes for a scrumptious snack, but is quite easy to prepare too. Just get your dough right and fry these ribbon-like pakoda for a tasty festive treat.",
            "Prep Time": "10 minutes",
            "Cook Time": "20 minutes",
            "Total Time": "30 minutes",
            "Cuisine": "South Indian, Tamil Nadu",
            "Course": "Snacks"
        },
        {
            "Title": "Butter Murukku | Butter Chakli",
            "Ingredients": "1, cup, or 150 grams, 1, tablespoon, roasted chana dal flour, (porikadalai flour) or 1 tablespoon roasted chana dal ground to a fine flour, 2, tablespoons, gram flour, (besan), 2, tablespoons, salted butter, – can swap with unsalted butter, ½, teaspoon, cumin seeds, ½, teaspoon, asafoetida, (hing), ⅓, teaspoon, salt, or add as required, 9 to 10, tablespoons, water, or add as required, oil, for deep frying, as needed",
            "Instructions": [
                "Take rice flour, besan and roasted chana dal flour in a mixing bowl or pan. For roasted chana dal flour, grind 1 tablespoon roasted chana dal in a small grinder or coffee grinder till fine.",
                "Measure the flour using 1 tablespoon standard tablespoon. Then sift it directly in the pan containing rice flour and gram flour.",
                "Add ⅓ teaspoon salt or as per taste.",
                "Add cumin seeds and asafoetida (hing).",
                "Now add water in parts – about 2 to 4 tablespoons at a time. Begin to mix and knead the flour. Add water in parts and knead to a smooth soft dough.",
                "I first added 4 tablespoons water and later added 5 tablespoons. Depending on the quality of flours, you can add less or more water.",
                "Let the oil become medium hot. Check the oil temperature by adding a small piece of the dough.",
                "If the dough comes up gradually and steadily on top, the oil is hot enough to fry. If it comes up too quickly, then oil is too hot.",
                "If it settles down at bottom of kadai or comes up very slowly, the oil is not hot.",
                "Fry till they are half done or have become slightly crisp. After adding the murukku, do not touch them immediately with the slotted spoon as they break.",
                "They need to become slightly crisp first and then you can turn them over with the slotted spoon.",
                "Turn over with a slotted spoon, so that they get fried evenly.",
                "Keep on turning to get them evenly golden. Fry them till the sizzling in the oil reduces and the butter murukku becomes golden.",
                "Remove with a slotted spoon and drain them on kitchen paper towels to remove excess oil."
            ],
            "Description": "Murukku is one of the most loved snacks in South India. Why? It is fried, crunchy-munchy, goes great with tea or coffee, stays for long and is easy to make if you have the right equipment and follow the procedure accurately. This Butter Murukku is one of the variations which can be touted as a close cousin of the Maharashtrian",
            "Prep Time": "5 minutes",
            "Cook Time": "25 minutes",
            "Total Time": "30 minutes",
            "Cuisine": "South Indian",
            "Course": "Snacks"
        },
        {
            "Title": "Murukku Recipe | Murukulu Recipe (Crunchy Rice Flour Spirals)",
            "Ingredients": "3, tablespoons, urad dal, – 40 grams, 1, cup, – 150 grams, ¼, teaspoon, asafoetida powder, (hing) – can also add ⅛ teaspoon asafoetida, ¼, teaspoon, red chilli powder, or add as required, ½, teaspoon, salt, or add as required, 1, teaspoon, white sesame seeds, – can also add black sesame seeds, ½, teaspoon, carom seeds, (ajwain) – can also add ½ teaspoon cumin seeds, 2, tablespoons, – 40 grams, 10 to 11, tablespoons, water, or add as required, oil, as required for deep frying",
            "Instructions": [
                "Heat a small frying pan or kadai. Keep the heat to its lowest and add urad dal.",
                "Begin to roast urad dal and keep stirring often when roasting the lentils.",
                "Roast urad dal till they become aromatic or are light golden. Do not make them brown.",
                "Remove in a plate and let the roasted urad dal cool at room temperature.",
                "Take the roasted urad dal in a small dry grinder jar or a small chutney grinder jar. Grind to a fine flour. Keep aside.",
                "Meanwhile, spread oil on the murukku disc. Also spread some oil on the part of the murukku maker where the dough will be placed.",
                "In a fine sieve, take rice flour. Also add the urad dal flour to the same sieve.",
                "Next add red chilli powder, asafoetida powder and salt.",
                "Sift the dry ingredients twice.",
                "To the sifted flours add sesame seeds, carom seeds and ghee.",
                "Mix everything very well. Then with your fingertips mix the ghee in the flour evenly. The mixture should resemble breadcrumbs.",
                "Hold a small portion of the murukku mixture in your palms and it should hold itself together.",
                "It should not break or fall apart. If it breaks or falls apart, then add 1 to 2 teaspoons more of the ghee. Mix again very well and then check.",
                "Now add water in parts and begin to mix and knead.",
                "Keep on adding water in parts and knead very well.",
                "You will need about 10 to 11 tablespoons of water. The amount of water needed will depend on the quality of rice flour. Check the taste of dough and add more salt if required.",
                "Knead to a smooth and soft dough. Also keep the dough slightly moist, but do not make too moist or wet as then the murukku absorbs more oil.",
                "Murukku has to be made as soon as you knead the dough, so keep everything ready before you shape and fry them.",
                "Now divide the dough in two parts and add first part in murukku maker. Cover the second part of dough with a kitchen towel.",
                "Before you begin to shape the murukku, keep oil in a kadai (wok) or frying pan to get heated.",
                "Keep the oil on a low or medium-low heat, so that it does not become very hot. Use any neutral flavored oil with a high smoke point.",
                "Use butter paper or parchment paper squares. Cut them in squares and keep ready before you make murukku.",
                "Press the murukku maker and move in rounds to get the concentric circles or spiral shape on the paper squares.",
                "Break the dough towards the end and press it to the last concentric circle of the spiral.",
                "– If the murukku breaks while forming them, this means that the dough does not have enough moisture. Add 1 or 2 tablespoons of water and knead the dough again.",
                "– If you are not getting proper shape, this mean that the dough is too moist. Add some rice flour and knead again.",
                "Make a batch of murukku. E.g make 3 to 5 murukku that you will be frying at a time.",
                "Next test the hotness of the oil. Add a small piece of the murukku dough in the oil and it should come up gradually.",
                "If it comes up fast, the oil is hot, so reduce the heat. If it sticks or is at the bottom or comes up slowly, the oil is not hot enough, so increase the heat.",
                "Take the butter paper with the murukku in your hands. Then take a small to medium sized wooden spatula and place it on the murukku gently.",
                "Then gently turn over the spatula. The butter paper will be facing you. Lift the butter paper gently.",
                "The murukku will be neatly placed on the wooden spatula.",
                "Now gently tilt or place the spatula in oil, so that the murukku slides in the oil.",
                "Add the remaining murukku also in this manner. Fry on a medium heat.",
                "When they turn light golden, then flip them gently. Fry the second side.",
                "Fry the murukku till the oil stops sizzling or till they become crisp and golden. Do not brown them too much. Turn over as needed for even frying.",
                "– Check the first batch of murukku. If it looks like that the murukku has absorbed oil or breaks in oil, then add some rice flour, about 1 to 2 tablespoons and knead again. This happens if too much fat has gone in the dough.",
                "Remove with a slotted spoon draining extra oil in the kadai or pan itself.",
                "Place them on kitchen paper towels to soak extra oil.",
                "Once they cool at room temperature, then store murukku in an air-tight box at room temperature.",
                "Serve Murukku as a tea-time snack."
            ],
            "Description": "Not just the land of curries and spices, India is also synonymous with a plethora of fried snacks. One of it is the crispy, crunchy Murukku or Murukulu. Popular under this name in South India, this savory snack usually consists of rice and lentil flours along with spices and seasonings. Different South Indian households have different varieties. Mine here, is the basic Murukku Recipe with many troubleshooting tips and pointers, which’ll help you make this yummy snack from scratch, at home.",
            "Prep Time": "20 minutes",
            "Cook Time": "30 minutes",
            "Total Time": "50 minutes",
            "Cuisine": "South Indian, Tamil Nadu",
            "Course": "Snacks"
        },
        {
            "Title": "Peda Recipe | Doodh Peda | Milk Peda",
            "Ingredients": "200 to 205, grams, – grated or 1 cup tightly packed grated khoya (mawa or evaporated and dried milk solids), ½, cup, sugar, – 125 grams sugar or add as required, ½, teaspoon, cardamom powder, 2 to 3, tablespoons, milk, 3 to 4, pistachios, or almonds- slivered or thinly sliced",
            "Instructions": [
                "First grate the khoya. Take the grated khoya in a heavy kadai or skillet. You will need 1 cup tightly packed grated khoya. You can use homemade or store brought khoya. I have used instant khoya.",
                "Add sugar and cardamom powder.",
                "Keep the pan on a stove top on a low heat.",
                "Then mix the khoya with the sugar very well.",
                "Next add milk and again stir to combine. Keep stirring often.",
                "You will see the sugar melting and the mixture getting a liquid consistency.",
                "Continuously keep on stirring and simmer the peda mixture with a spatula. You have to stir non-stop so that the mixture does not get browned from the bottom.",
                "Stir often and the mixture will start bubbling.",
                "Continue to stir and cook till the mixture thickens and leaves the sides of the pan.",
                "Then immediately pour the entire peda mixture in a steel plate or a tray. When you pour the mixture it will still be in a molten state but thickened. Do not over cook as then the pedas will become chewy.",
                "Let it become warm at room temperature.",
                "Now take small portions from the lukewarm peda mixture and roll them into small to medium balls.",
                "Place a few slivered pistachios or almonds on top of each peda ball.",
                "With a peda maker, press each ball to give a distinct design on top of it. If you do not have a peda maker, then just roll the mixture in balls and then flatten them. Press a few almonds or pistachios on top.",
                "Make a design on all doodh peda with the peda maker. In case the doodh peda falls flat and does hold shape, then they are slightly undercooked. Gather all the mixture together and heat again in the pan for 2 to 3 minutes or till the mixture leaves sides of the pan.",
                "Now you can store the milk peda for a few hours at room temperature and then serve later. Leftovers can be refrigerated. This doodh peda recipe yields 12 medium sized peda."
            ],
            "Description": "Creamy and rich peda is a delightfully sweet fudge-like confection often found in Indian shops and made traditionally with khoya (dried milk solids), sugar, nuts and fragrant spices. But this popular treat is surprisingly easy to make at home! Here you’ll find step-by-step instructions with photos to prepare a simple doodh peda recipe (milk peda) anytime you like.",
            "Prep Time": "5 minutes",
            "Cook Time": "10 minutes",
            "Total Time": "15 minutes",
            "Cuisine": "North Indian",
            "Course": "Sweets"
        },
        {
            "Title": "Barfi Recipe | Khoya Barfi | Mawa Barfi",
            "Ingredients": "250, grams, (mawa or dried evaporated milk solids), 5, tablespoons, sugar, or add as required, 3 to 4, green cardamoms, – powdered in a mortar-pestle. (about ⅓ teaspoon of cardamom powder, husks removed), 12 to 15, pistachios, – finely chopped, 12 to 15, almonds, or cashews – finely chopped, 12 to 15, strands of, saffron, – optional, 1 to 1.5, teaspoons, milk, – optional, ¼ to ⅓, teaspoon, – for greasing the pan or tray",
            "Instructions": [
                "First grate or finely crumble the unsweetened khoya or mawa.",
                "In a small bowl dissolve the saffron strands in 1 to 1.5 teaspoons of milk. This is an optional step.",
                "Grease a bit of ghee, on a butter paper or parchment lined on a tray or small baking pan.",
                "Add the grated khoya in a thick bottomed pan.",
                "Begin to cook on a low heat for 2 to 3 minutes stirring often.",
                "Switch off the heat and add sugar.",
                "Stir to mix. Then turn on the stovetop heat. The whole mixture's consistency will become smooth and slightly thin, due to the sugar getting melted.",
                "Stir often and continue to cook on a low heat.",
                "When the mixture becomes slightly thick and starts leaving the sides of the pan, its time for the next step.",
                "Add chopped almonds, pistachios or your choice of nuts. Also add green cardamom powder.",
                "Stir to mix and turn off the heat.",
                "Keep in mind that the time taken to get this consistency right from the time, sugar is added is about 8 to 9 minutes on a low heat.",
                "Also make a note that this time will vary a couple of minutes here and there, depending on the size, type, quality of the pan and intensity of the heat.",
                "Pour the entire barfi mixture in the greased pan or butter paper.",
                "Spread evenly keeping 1 inch thickness at the edges.",
                "Sprinkle the saffron scented milk on the burfi.",
                "Once the burfi cools, slice into squares or diamond shape.",
                "Serve Mawa Barfi immediately. You can also store them in an airtight box. These Khoye ki Barfi stay good for about 4 to 5 days in the refrigerator."
            ],
            "Description": "Just like for ladoo, halwa and kheer, Indians have a certain affinity and love towards another very popular sweet called Barfi, also spelled as Burfi. So much, that we even have a mainstream movie named after it! While there is no dearth of types of barfis here, this Barfi Recipe on my blog is that of a quick Khoya Barfi (also called Mawa Barfi). It is an easy-peasy and quick one made with khoya/mawa (evaporated milk solids), sugar and some flavorings. Gets done within 20 minutes, right from the preparation to the cooking.",
            "Prep Time": "6 minutes",
            "Cook Time": "14 minutes",
            "Total Time": "20 minutes",
            "Cuisine": "North Indian",
            "Course": "Desserts"
        },
        {
            "Title": "Unniyappam Recipe | Unni Appam",
            "Ingredients": "1, cup, rice, or 200 grams rice – use any type of short grained rice, water as required, ½, tablespoon, oil, for frying coconut, 3, tablespoons, chopped fresh coconut, 2, medium sized banana, or 175 grams bananas (with their peels) or ¾ cup chopped bananas, 1, teaspoon, black sesame seeds, ½, cup, jaggery powder, or add as required, ¼, cup, water, or add as required, 3 to 4, green cardamoms, ½, teaspoon, cumin powder, ½, teaspoon, dry ginger powder, ¼, teaspoon, baking soda, – you can also add ⅛ teaspoon baking soda (about 2 pinches), ½ to 1, teaspoon, coconut oil, or ghee for each mould",
            "Instructions": [
                "Rinse 1 cup rice in water a couple of times. Then soak rice in enough water for 3 to 4 hours. You can even soak rice overnight if you want.",
                "Later drain all the water and add the soaked rice in a grinder jar.",
                "Add ¾ cup chopped bananas, ½ cup jaggery powder or grated jaggery and seeds from 3 to 4 green cardamoms.",
                "For a more sweet taste you can add ¾ cup jaggery.",
                "Then add ¼ cup water or add as required.",
                "Grind till you get a fine rava like consistency in the rice grains. The batter should be ground to a semi-fine consistency.",
                "Now pour the batter in another bowl or pan. Keep aside.",
                "Next heat ½ tablespoon coconut oil or ghee in a small pan or tadka pan. Add 3 tablespoons chopped coconut pieces. Chop the coconut in small pieces.",
                "Stirring often fry the coconut pieces till they become golden.",
                "Add the fried coconut pieces along with the remaining oil in the batter.",
                "Then add 1 teaspoon black sesame seeds, ½ teaspoon cumin powder, ½ teaspoon dry ginger powder, ¼ teaspoon baking soda. You can also add a pinch of salt if you want. Baking soda can be skipped too, but adding them makes the appams have a soft texture.",
                "Mix very well.",
                "Now heat the appe chatti pan. Add ½ to 1 teaspoon coconut oil in each mould. Keep the flame to a low.",
                "When the oil becomes hot, with a spoon pour batter in the chatti moulds till ¾ of each mould.",
                "On a low to medium-low flame cook till the base is golden and crisp.",
                "Then turn over each unniyapam with a wooden skewer or stick.",
                "You can turn over a couple of times more for even cooking.",
                "Once golden and crisp from all sides, then place the unni appams on kitchen paper towels. Prepare unniappam with the remaining batter in the same way. If there is oil in the moulds, then no need to add extra oil.",
                "Serve unniappam warm or at room temperature as a sweet snack. You can even place them in a casserole. In the casserole these appams stay warm for some time.",
                "The recipe makes for 28 unniyappam. These stay good at room temperature for 1 to 2 days. You can even refrigerate them."
            ],
            "Description": "Unniyappam recipe with step by step pics. Unniyappam or Unni Appam are sweet fritters made with rice, banana, a few spices and coconut. This sweet snack is a popular one in the scenic state of Kerala in South India. This Unniyappam Recipe is quite a nutritious preparation, and is gluten free as well as vegan-friendly too.",
            "Prep Time": "20 minutes",
            "Cook Time": "30 minutes",
            "Total Time": "50 minutes",
            "Cuisine": "Kerala, South Indian",
            "Course": "Sweets"
        },
        {
            "Title": "Kaju Katli Recipe | Kaju Barfi",
            "Ingredients": "1 cup/160, grams, cashews, (whole), at room temperature, ½ cup/100, grams, sugar, 5, tablespoons, water, 1, tablespoon, or coconut oil or any neutral tasting oil, optional, 1, teaspoon, chopped rose petals, or 1 teaspoon rose water or 8 to 9 strands of saffron, optional",
            "Instructions": [
                "Add the cashews to a spice grinder, blender or a mixer-grinder. Use cashews that are at room temperature and not refrigerated ones.",
                "Grind the kaju to a smooth and fine powder, but make sure you don't over do the grinding process as fat should not release from the cashews.",
                "Remember to grind in short intervals. The cashews should be in powder form and not become pasty or buttery like cashew butter.",
                "If there are tiny pieces in the cashew powder, then just let them be. Or opt to sieve the cashew powder and set aside. Use a medium fine sieve and not a fine one to sift the powdered cashews.",
                "When all the sugar has dissolved in the water, add the cashew powder. There is no consistency in the sugar syrup required like one string or two string. Simply let the sugar dissolve in the water and then proceed with the next step.",
                "Mix and keep on stirring the cashew mixture non-stop on a low flame.",
                "Cook the kaju mixture for approx 7 to 9 minutes until the whole dough starts to come together.",
                "Remove the whole lump of the kaju dough from the pan and place it on your work surface or in a bowl or plate.",
                "When the heat in the dough is hot enough to handle, then knead the cashew mixture lightly.",
                "Flatten the dough and place it on a butter paper or on a greased plate or tray.",
                "Place a butter paper on top and then using a rolling pin, roll gently the dough from all sides till you reach a thickness of 3 to 5 mm in the dough.",
                "Remove the butter paper and let the rolled dough cool.",
                "Gently remove the kaju barfi with a butter knife.",
                "Serve the kaju katli straight away or keep in an airtight container."
            ],
            "Description": "Perfect Kaju Katli or Kaju Barfi is a traditional Indian cashew fudge candy that’s terrifically smooth, thin, and melts in your mouth. This lovely treat includes a hint of rose but is completely customizable with your favorite flavors. And while it’s not the easiest recipe to make from scratch, I promise it’s worth every bit of effort! My step-by-step photos, video and instructions will help you make this foolproof kaju katli recipe as a dessert for yourself or a sweet gift for family and friends.",
            "Prep Time": "5 minutes",
            "Cook Time": "15 minutes",
            "Total Time": "20 minutes",
            "Cuisine": "Indian, North Indian",
            "Course": "Desserts, Sweets"
        },
        {
            "Title": "Mysore Pak Recipe",
            "Ingredients": "1.25, cups, sugar, – 200 to 210 grams, 1, cup, gram flour, (besan) – 100 grams, 1, cup, (clarified butter) – 200 to 210 grams ghee, ½, cup, water",
            "Instructions": [
                "Firstly measure all the 3 ingredients and set aside – sugar, gram flour and ghee.",
                "Sieve the gram flour once or twice. This helps in reducing the lumps if any while mixing gram flour in the sugar syrup.",
                "Grease a pan or tray with some ghee. Use a pan or tray which can give you some depth and height, so that you can get rectangular or square pieces.",
                "Now take the sugar in a heavy thick bottomed kadai. Since a lot of stirring happens, I would suggest you to u",
                ".",
                "Please do not use non stick pan as due to the heat and lot of stirring, the non stick coating can get affected.",
                "Add ½ cup water in the sugar.",
                "Keep the pan on the stove top. On a medium-low or medium flame, heat the sugar syrup.",
                "Stir so that the sugar dissolves.",
                "Meanwhile also take the ghee in another pan and keep it on stove top. Let the ghee melt on a low flame or sim.",
                "The ghee has to be hot when we add it in the gram flour mixture. So let it be on a slow simmer.",
                "Let the sugar syrup start bubbling and boiling. We are not looking for one string consistency in the sugar syrup.",
                "Just let the sugar solution come to a boil and then add the gram flour.",
                "Add the gram flour in three to four portions. First add some of the gram flour.",
                "With a wired whisk, stir the gram flour briskly, so that it dissolves with the sugar solution.",
                "With one hand using a spoon, add the gram flour and with the other hand mix it with a wired whisk.",
                "Finish of all the gram flour this way.",
                "Stir very well, so that the gram flour has got mixed evenly with the sugar syrup.",
                "Then add ghee in parts. First add a ladle full of the hot ghee.",
                "You will see a lot of bubbles and frothing in the gram flour mixture after you add ghee.",
                "As soon as you add ghee, mix it with the gram flour with a spoon or spatula. Using a ladle, with one hand, add ghee and with the other hand mix it with a spatula.",
                "Then add the second portion of ghee and again mix it very well. Keep the heat to a medium-low or medium.",
                "This way finish off adding all the ghee in parts. Mix thoroughly.",
                "Do use a bigger kadai and also some gloves on your hands, as there is a lot of sizzling, frothing and bubbling that happens.",
                "All the ghee will be absorbed first and what you will see is a smooth molten gram flour mixture.",
                "On a medium-low to medium heat with non-stop stirring cook the gram flour mixture.",
                "You have to continue to cook and stir till you start seeing many bubbles in the mixture and the ghee is released from it. So continue to cook and stir. The mixture will also start to leave the sides of the kadai or pan.",
                "While stirring also scrape the bottom of the kadai and the sides. If you do not scrape, then the mixture starts sticking and gets browned or burnt.",
                "So you have to stir nonstop and scrape. Do use a flat steel spatula (",
                ") as this helps in scraping the gram flour mixture.",
                "When the mixture comes together in one mass and you see some ghee at the sides, then also continue to stir and scrape.",
                "When you see many small bubbles and holes in the mixture, then switch off the heat.",
                "If you cook too much, then you will get a very hard mysore pak.",
                "Immediately and quickly tilt the kadai and pour the whole mixture in the pan. It falls in one lot and you don’t need to use any spoon for it.",
                "Level with a spatula or the back of small glass or a small steel bowl.",
                "Let the mysore pak mixture become warm or cool down.",
                "If there is too much ghee at the sides or top, then invert the pan after 20 to 30 minutes, so that the excess ghee is removed.",
                "You can use this ghee while preparing dosa or greasing idli plates.",
                "Once warm or cooled, then just invert the pan on a chopping board or tray or plate.",
                "Tap the sides and the bottom of the pan. The mysore pak block falls of easily.",
                "Then cut the mysore pak into rectangular or square pieces.",
                "Store in an air-tight container. It stays good for about a week to ten days at room temperature.",
                "Serve as a festive sweet to your family or friends."
            ],
            "Description": "Rich, luxurious, fudge-like Mysore Pak is a famous Indian treat that is simultaneously buttery and nutty, and will simply melt in your mouth. Made with just three ingredients – gram flour (besan), ghee and sugar – this Ghee Mysore Pak recipe is a perfect introduction to candy-making.",
            "Prep Time": "5 minutes",
            "Cook Time": "20 minutes",
            "Total Time": "25 minutes",
            "Cuisine": "Karnataka",
            "Course": "Sweets"
        },
        {
            "Title": "Malpua Recipe (Classic Homemade Sweet)",
            "Ingredients": "1, cup, all-purpose flour, – 125 grams, 1, teaspoon, fennel seeds, – kept whole or crushed, 3 to 4, green cardamoms, – crushed or ⅓ teaspoon cardamom powder, 3, pinches, baking soda, or ⅛ teaspoon baking soda, ½, cup, water, or add as required, 3, tablespoons, (mawa or dried evaporated milk solids) – 50 grams khoya or 3 tablespoons of whole milk powder or dairy whitener, 3, tablespoons, (yogurt), 4, tablespoons, (clarified butter) – for frying, ½, cup, sugar, ¼, cup, water, 1.25, litres, whole milk, or about 5 cups, 2.5 to 3, tablespoons, sugar, or add as required, 5 to 6, green cardamoms, – crushed or ½ teaspoon cardamom powder, 2, pinches, saffron strands, 1, teaspoon, rose water, or water (pandanus water), 2, tablespoons, almonds, – blanched and sliced, 2, tablespoons, pistachios, – blanched and sliced",
            "Instructions": [
                "In a mixing bowl take the all-purpose flour, fennel seeds and cardamom powder. Mix the dry ingredients well.",
                "Add the khoya and curd (yogurt). Please use fresh yogurt. Instead of khoya you can also use milk powder.",
                "Add water and begin to stir to a thick or medium-thick flowing batter without lumps.",
                "Cover the bowl and allow the batter to rest for 30 minutes.",
                "In a pan take sugar and water. Stir so that the sugar dissolves. On a low heat simmer this mixture.",
                "You need to have a ½ string or 1 string consistency in the sugar syrup. If you cannot achieve these string consistencies than just make a sticky syrup.",
                "The sugar needs to be kept warm. For this keep the sugar syrup on a hot water bath so that it stays warm throughout and does not crystallize.",
                "Meaning you have to keep the sugar syrup pan on a bowl or another pan filled with hot water. The hot water should touch the base of the pan containing the sugar syrup.",
                "Heat ghee in a frying pan or skillet.",
                "When the ghee is heating up add baking soda to the batter.",
                "Stir to combine so that the baking soda is mixed evenly with the batter.",
                "Lower the heat. Take 2 to 3 tablespoons or a ladle of the batter and gently pour it on the hot ghee.",
                "Spread the batter lightly with the back of the spoon. Make 2 to 4 malpua depending on the size of the frying pan.",
                "Fry on a low to medium heat. When one side is light golden and crisp, gently turnover and fry the second side until crisp and light golden.",
                "Fry until both sides are golden flipping the malpua as needed for a couple of times.",
                "Drain them on paper towels to remove excess oil.",
                "Then immediately place them in the warm sugar syrup. Gently coat the malpua with the sugar syrup with a spoon or small tongs.",
                "Immediately remove them and place them in a serving tray or plate. Prepare all malpua this way and coat them with the sugar syrup.",
                "Pour some rabri on top. Garnish with the chopped almonds and pistachios. Serve the malpua with rabdi hot.",
                "You can also just serve them coated with the sugar syrup and garnished with the blanched nuts.",
                "In a broad thick bottomed pan or sauce pan or a kadai take the whole milk and bring it first to boil.",
                "Lower the heat and continue to simmer the milk stirring at intervals.",
                "Do stir often so that the milk does not get burned at the bottom of the pan.",
                "Keep on simmering, stirring, removing the clotted cream and scraping the cream of the sides.",
                "Switch off the heat when the milk has reduced to ⅓ or ¼ of its original volume. The milk would also have thickened. It will take about 45 minutes to 1 hour for the milk to thicken on a low heat.",
                "Remove the rabri in a bowl and serve it later with the malpua. Refrigerate if not using it immediately.",
                "The combo of malpua rabdi taste good and is liked by many people. It is best and recommended to have malpua rabdi hot or warm."
            ],
            "Description": "Malpua is a traditional North Indian sweet of sugar syrup coated pancakes made with all-purpose flour, curd (yogurt), spices, khoya (dried milk solids) and topped with nuts. Malpua recipe is often made during festivals, special occasions and are a street food as well. Soft and fluffy on the inside, yet crisp and lacy on the outside, these  syrup dipped pancakes are a real treat – especially when you serve them with",
            "Prep Time": "35 minutes",
            "Cook Time": "25 minutes",
            "Total Time": "60 minutes",
            "Cuisine": "North Indian",
            "Course": "Desserts, Sweets"
        },
        {
            "Title": "7 Cups Sweet | Easy 7 Cup Burfi | 7 Cup Cake",
            "Ingredients": "½, cup, besan, (gram flour) or 50 grams, ½, cup, fresh coconut, or 35 grams fresh coconut, ½, cup, or 100 to 110 grams ghee (clarified butter), ½, cup, milk, 1.25, cups, sugar, or 200 to 210 grams sugar, ½, teaspoon, cardamom powder",
            "Instructions": [
                "Take all the ingredients and keep them ready – besan, grated coconut, milk, ghee and sugar. Instead of 1.25 cup sugar, you can use 1 cup sugar.",
                "Grease a tray or a pan with some ghee.",
                "Heat a heavy iron kadai or pan. Keep the heat to a low and add besan or gram flour.",
                "Stir often and roast the besan for 3 to 4 minutes or till you get a nice nutty aroma from it.",
                "Do not brown the besan. Also stir continuously while roasting besan.",
                "Once the besan becomes aromatic, then add fresh coconut, ghee and milk.",
                "Mix very well.",
                "Then add sugar and cardamom powder.",
                "Mix again very well and stir so that the sugar dissolves. The mixture will also become liquid like.",
                "Keep on stirring and cooking on a low heat.",
                "The mixture will begin to thicken and reduce.",
                "Continue to cook and stir till the mixture leaves the sides of the pan. While stirring also scrape the bottom of the kadai and the sides. If you do not scrape, then the mixture starts sticking and gets browned or burnt. So",
                ". do use flat steel spatula (palta) as this helps in scraping the besan mixture.",
                "Even after leaving the sides of the pan,",
                ".",
                "If you cook too much, then the burfi will become hard and crumbly.",
                "pour the entire burfi mixture in the greased tray or pan.",
                "With a spatula or spoon, even and smoothen the top.",
                "Let the burfi become warm or cool down at room temperature.",
                "Then cut with a sharp knife and serve 7 cup burfi or store in an air-tight box. You can keep the barfi at room temperature in a cold season for 1 day or you can refrigerate.",
                "Offer the 7 cup burfi to the deities or serve as a sweet."
            ],
            "Description": "This decadent 7 cup burfi (also known as 7 cups sweet and 7 cup cake) is a tasty fudge-like sweet made with 7 measures of ingredients. All you need is gram flour, grated coconut, milk, ghee and sugar to make this tasty sweet! Make in 30 minutes and serve during festive or religious occasions.",
            "Prep Time": "5 minutes",
            "Cook Time": "25 minutes",
            "Total Time": "30 minutes",
            "Cuisine": "South Indian, Tamil Nadu",
            "Course": "Sweets"
        },
        {
            "Title": "Kalakand Recipe (Indian Milk Cake)",
            "Ingredients": "400, grams, sweetened condensed milk, or 1 tin or can, 250 to 300, grams, or 2 cups tightly packed grated or crumbled paneer, ¾, teaspoon, cardamom powder, (choti elaichi powder) or 6 to 7 green cardamoms – crushed in a mortar-pestle to a fine powder, 1, tablespoon, sugar, (optional), 1, teaspoon, rose water, (optional), 10 to 12, pistachios, (pista), 10 to 12, cashews or almonds, (kaju or badam), 7 to 8, strands of saffron, (kesar) – optional",
            "Instructions": [
                "Grease a pan or a tray with some ghee or oil.",
                "Crush coarsely pistachios, saffron and cashews or almonds in a mortar-pestle. You can also sliver or slice the nuts.",
                "Grate 250 to 300 grams paneer. You can also crumble the paneer. If the paneer is refrigerated, then I suggest to grate it. If freshly made, then you can crumble it finely. There should be no chunks in the crumble.",
                "Take 1 tin/can (400 grams) of sweetened condensed milk in a thick bottomed pan or kadai.",
                "I did add some sugar as I felt the sweet taste was less for us. I added 1 tablespoons sugar. You can check the taste and add accordingly.",
                "Keep the heat on low or sim and cook this mixture of condensed milk and grated paneer.",
                "The kalakand mixture will start thickening as it simmers and begins to cook.",
                "When the mixture gets thickened well, looks like one mass and starts leaving the sides of the pan then switch off the heat.",
                "Keep in mind that the kalakand mixture should have some moisture and should not look dry. It should not have a liquid consistency or be runny.",
                "It took me 15 minutes on a low heat. Depending on the quality of your pan, pan thickness and size, flame intensity it may take 12 to 16 minutes.",
                "Remove the pan from the heat. Add cardamom powder and rose water. Stir very well.",
                "Now pour the kalakand mixture in the prepared greases pan or tray.",
                "Sprinkle coarsely crushed nuts or slivered nuts all over the kalakand.",
                "Gently press the nuts with a spoon. Cover and allow the kalakand to become warm or cool completely at room temperature. Then keep in the fridge for a couple of hours for it to set.",
                "Serve kalakand as a sweet or as a dessert. Keep any leftovers in the fridge in an air-tight container. Kalakand keeps well for 2 to 3 days in the fridge."
            ],
            "Description": "Kalakand is a popular Indian sweet made with milk, sugar and a few flavorings. My three ingredient, super fast recipe for Kalakand (a.k.a. Indian Milk Cake) comes together in just 15 minutes thanks to the help of a can of sweetened condensed milk. This fudgy sweet is easy to customize and is naturally gluten free, making it the perfect dessert to celebrate with.",
            "Prep Time": "5 minutes",
            "Cook Time": "15 minutes",
            "Total Time": "20 minutes",
            "Cuisine": "North Indian",
            "Course": "Sweets"
        },
        {
            "Title": "Maladu Recipe | Maa Laddu | Roasted Gram Ladoo",
            "Ingredients": "1, cup, roasted chana dal, (roasted bengal gram or pottukadalai), ½, cup, sugar, or add as required, 3, green cardamoms, or ½ teaspoon cardamom powder, 1, pinch, nutmeg powder, (ground nutmeg), 10 to 12, cashews, – chopped, 1, tablespoon, golden raisins, ¼, cup, or 4 tablespoons – remove 1 tablespoon from ¼ cup ghee to fry the cashews and raisins",
            "Instructions": [
                "Sieve the ground chana dal.",
                "Powder the sugar with the cardamom seeds.",
                "Sieve the powdered sugar also in the same bowl.",
                "Mix the sifted chana dal flour and powdered sugar thoroughly to an even mixtute.",
                "Fry cashews in 1 tablespoon of ghee.",
                "Remove and add them to the chana dal flour and powdered sugar mixture in the bowl.",
                "Now in the same ghee fry the raisins till plump.",
                "Add the raisins along with ghee to the flour and sugar mixture.",
                "In the same pan heat up the remaining 3 tablespoons of ghee and add it to the ladoo mixture.",
                "Keep the ladoo mixture pan on low heat and sauté for 2 to 3 minutes stirring non-stop. Switch off heat and let the mixture cool.",
                "When the mixture has become warm or cooled enough for you to handle the ladoo mixture, then make small or medium sized ladoos.",
                "Serve maladu or keep them stored in an air tight container. They will stay good for 7 to 10 days."
            ],
            "Description": "Maladu or Maa Laddu a.k.a Maa Ladoo is one of the popular sweets in Tamil Nadu, South India. This ladoo variety is made with just 3 ingredients viz roasted Bengal gram flour, ghee and sugar. Locally, the sweet is referred to as Pottukadalai Urundai as the Tamil word ‘Pottukadalai’ means roasted Bengal gram which is ground and used in this recipe. This is an easy to make and delightful ladoo, which is usually prepared during festivals like",
            "Prep Time": "10 minutes",
            "Cook Time": "2 minutes",
            "Total Time": "12 minutes",
            "Cuisine": "South Indian",
            "Course": "Sweets"
        },
        {
            "Title": "Ragi Laddu | Nachni Ladoo",
            "Ingredients": "1.5, cups, ragi flour, (nachni or finger millet flour) or 210 grams ragi flour, ¾, cup, organic powdered jaggery, or 140 grams powdered jaggery, ⅓, cup, or 65 to 70 grams ghee, ½, teaspoon, cardamom powder, or 3 to 4 green cardamoms (choti elaichi) – crushed in mortar-pestle",
            "Instructions": [
                "Roast till the color changes and you get a nice aroma from the ragi flour. About 6 to 8 minutes on a low flame.",
                "Timing will vary with the material, size and thickness of the pan. I used a steel kadai which does not have a thick bottomed base, thus it took me just 6 minutes to roast the ragi flour.",
                "Let this ragi ladoo mixture become warm, then mix everything again very well with your hands and break small lumps if any with your hands.",
                "Take a portion of the mixture and shape into ladoos.",
                "If you are unable to form ragi ladoos, then add a few tablespoons of ghee, which is at room temperature. Mix again very well and begin to shape the ragi ladoos."
            ],
            "Description": "Ragi laddu recipe with step by step photos. This is a quick, easy and tasty ragi ladoo made with three ingredients – ragi (finger millet), jaggery and ghee.",
            "Prep Time": "1 minutes",
            "Cook Time": "14 minutes",
            "Total Time": "15 minutes",
            "Cuisine": "Indian",
            "Course": "Sweets"
        },
        {
            "Title": "Boondi Laddu | Boondi ke Ladoo",
            "Ingredients": "1.5, cups, sugar, ¾, cup, water, 1.5, cups, gram flour, (besan), 1, cup + 1 tablespoon, water, or add as required – the amount of water to be added depends on the quality of besan, 2, pinches, crushed saffron strands, or saffron powder, ½, teaspoon, cardamom powder, or 5 to 6 green cardamoms crushed to powder in a mortar-pestle, 1, tablespoon, melon seeds, (magaz), 2, black cardamoms, – seeds kept and the husks discarded, 1, pinch, edible camphor, – optional, 1, tablespoon, and some more ghee for applying on your palms while shaping the laddu, oil, for deep frying, as required",
            "Instructions": [
                "Cook the sugar syrup, till you get a one thread consistency. Stir often. Switch off the heat. Set the sugar solution aside.",
                "The sugar syrup should be hot when you add the boondi. So you can keep the sugar solution on a hot water bath by place the pan on a plate or tray filled with hot water. You can choose to fry the boondi and prepare the sugar solution side by side.",
                "Take the dry ingredients for the boondi batter in a mixing bowl – gram flour and crushed saffron or saffron powder.",
                "If they become flat, the batter is thin and if they get tail ends, the batter is thick.",
                "If thin, then add a bit of gram flour and check by frying a few boondi.",
                "If thick, then add a bit of water and then do the same test. Once you get the correct consistency, proceed with the next step of frying the boondi.",
                "Take a dry perforated ladle and place it above the hot oil. Don't keep the ladle too much on a height, as the batter droplets, when falling from a height, do not give a round shape.",
                "Fry the boondi till they are cooked. Don't make them crisp or over do the frying. When the oil stops sizzling, remove the boondi.",
                "This step is also important because if boondi becomes crisp then the boondi ladoo won’t be soft and they won’t be able to absorb the sugar syrup.",
                "After each batch, wipe the perforated ladle with a clean piece of kitchen towel from both sides.",
                "Strain the fried boondi well with a slotted spoon and then add them directly to the hot sugar syrup. Fry all the boondi in batches with the above method and then add them to the sugar syrup.",
                "Finally add melon seeds (magaz), cardamom powder, black cardamon seeds, ghee and a pinch of edible camphor (optional).",
                "Mix well and shape the boondi mixture into a small to medium-sized round spherical ball. If you are not able to shape them, then add 1 to 2 tablespoon more ghee as it helps in binding.",
                "You can place the boondi ladoo in a small muffin liners. You can also garnish them with raisins or cashews or slivered nuts like almonds or pistachios.",
                "Serve boondi laddu. If not serving the same day, refrigerate them in an airtight container. These laddu keep well for about a week in the fridge."
            ],
            "Description": "Boondi Laddu are sweet spherical treats made by combining lovely little bits of fried and sugar-soaked batter (made with gram flour/besan) with seeds and fragrant spices. Each bite is a delightful blend of smooth, soft, and melt-in-the mouth for a snack or dessert you can’t get enough of! Here I share step-by-step photos and instructions to make a classic boondi ladoo recipe. I also share some steps on how to make Tirupati Laddu.",
            "Prep Time": "15 minutes",
            "Cook Time": "20 minutes",
            "Total Time": "35 minutes",
            "Cuisine": "Indian",
            "Course": "Sweets"
        },
        {
            "Title": "Motichur Laddu Recipe (Motichoor ke Ladoo)",
            "Ingredients": "1, cup, sugar, ½, cup, water, a generous pinch of saffron powder, or crushed saffron (kesar), 1, cup, besan, (gram flour), a generous pinch of saffron powder, or crushed saffron (kesar), ¾, cup, water, 2 to 3, black cardamoms, – seeds removed and the skins discarded, ½, tablespoon, magaz, (melon seeds), oil for deep frying, a bit of oil or ghee, for applying on the palms while shaping the ladoo",
            "Instructions": [
                "This step is important because if boondi becomes crisp then motichur laddu won't be soft and they won't be able to absorb the sugar syrup.",
                "For collecting the fried boondi use a large slotted spoon/jhara. Drain the oil very well after removing the boondi and then add them directly to the sugar syrup. Also note that the sugar syrup should be hot.",
                "If the sugar syrup is not hot, then just heat it. In case, the sugar syrup crystallizes, then reheat again mixing 1 to 2 tablespoons water. No need to bother about the tailed or flat boondis as we will be pulsing them in the blender later.",
                "In a blender or mixer add the boondi and the sugar syrup. Add 1 tablespoon of hot water and pulse the boondi mixture for a few times to get a smaller shape.",
                "Don't pulse too much otherwise you won't be able to shape the motichur laddu. The amount of water to be added depends on the texture of the boondis.",
                "If the boondis are a bit crisp, then add 1 or 2 tablespoons more of the hot water. The boondis absorb the hot water and remain soft and moist.",
                "Apply some oil or ghee on your palms and shape the motichoor ladoo. The mixture would be warm when preparing the laddu. On cooling they become firm.",
                "You can garnish the motichoor ladoo with melon seeds/magaz or raisins. These motichur ladoo can also be refrigerated since they are not made from ghee. If you fry them in ghee then the ghee will solidify on refrigeration."
            ],
            "Description": "Motichur laddu are soft, delish melt in the mouth ladoo made mainly with gram flour, sugar, and spices. The gram flour batter is fried to make tiny balls or boondi and mixed with sugar syrup, nuts or seeds and later shaped to neat round balls. Motichoor ladoo is a popular sweet from the North Indian cuisine and often made during festivals or celebrations. Here I share my detailed step-by-step photos to make these soft, tender and tasty homemade laddu recipe from scratch.",
            "Prep Time": "15 minutes",
            "Cook Time": "15 minutes",
            "Total Time": "30 minutes",
            "Cuisine": "Indian",
            "Course": "Sweets"
        },
        {
            "Title": "Til Ke Laddu | Sesame Laddu",
            "Ingredients": "⅓, cup, white sesame seeds, – 50 grams, unhulled or hulled, ¼, cup, peanuts, ¼, cup, desiccated coconut, ½, cup, powdered jaggery, or grated jaggery (heaped) – 100 grams, 3, tablespoon, water, ¼, teaspoon, cardamom powder, (ground cardamom), water, or oil – a bit for greasing the palms",
            "Instructions": [
                "Heat a kadai or pan and add the white sesame seeds in it. The pan should not be too hot, but on a low heat.",
                "The sesame seeds pop and change color. On a low heat, this takes about 2 to 3 minutes. Do not brown them.",
                "Remove and set aside in a plate.",
                "Then add the peanuts. Dry roast the peanuts on a low heat stirring often until they become crunchy and get a few black spots or blisters on them.",
                "Remove the peanuts in a mortar-pestle or on a plate. Allow them to cool.",
                "In the same pan, add the desiccated coconut.",
                "Stir continuously and roast the coconut until it become light golden or golden. Switch off the heat. Remove from the pan and set aside.",
                "When the peanuts have cooled, crush them coarsely. You can also crush them in a dry grinder.",
                "Next add the cardamom powder.",
                "Mix very well. Set aside.",
                "In the same pan or kadai, take the powdered jaggery or grated jaggery and water.",
                "Keep the kadai on the stove top on a low heat.",
                "Keep on stirring the jaggery so that it dissolves in the water.",
                "On a low heat simmer this jaggery and water solution. It will start bubbling first.",
                "To check the soft ball stage, take some water in a small bowl. Drop a bit of jaggery solution in the water.",
                "The water will cool the jaggery syrup and when you remove it, the consistency will be sticky and forming a soft ball.",
                "At this stage, switch off the heat and add the dry roasted mixture of sesame seeds, desiccated coconut, crushed peanuts and cardamom powder.",
                "Mix the dry roasted mixture with the jaggery solution thoroughly.",
                "Keep the pan on your work surface or kitchen countertop.",
                "When the mixture is still hot, begin to shape til laddu from it. If too hot, then wait for a minute and then form the laddu.",
                "Spread some oil or water in your palms to shape the ladoo. If you are not able to shape laddu when the mixture is too hot, wait for some seconds and then shape the laddu",
                "You can also use a ½ to 1 tablespoon measuring spoon for scooping the mixture and making the til ke laddu Then just shape the laddu once you scoop them out.",
                "For the last batch, scrape the sides very well and then make til ladoo from it.",
                "Make all the til ladoo this way. Store in an airtight jar at room temperature.",
                "Serve til ke laddu ladoo during makar sankranti or have them as a sweet snack."
            ],
            "Description": "When sesame seeds (til) and jaggery (gud or gur) come together, it’s just firework on the palate! Just like this Sesame Laddu. No doubt, this is one of my favorite combinations, as not just supremely tasty, it is also a wholesome package. Apart from these 2 main ingredients, these Til Ke Laddu also have peanuts and coconut which only enhance the flavor and makes these nutty laddus, a loved one. This sweet is a",
            "Prep Time": "12 minutes",
            "Cook Time": "8 minutes",
            "Total Time": "20 minutes",
            "Cuisine": "Maharashtrian",
            "Course": "Sweets"
        },
        {
            "Title": "Moong Dal Laddu",
            "Ingredients": "200, grams, moong dal, or 1 cup moong dal (husked and split mung lentils), 75, grams, sugar, or ⅓ cup sugar, (I used raw sugar), 55, grams, or ¼ cup ghee (clarified butter), 2 to 3, green cardamoms",
            "Instructions": [
                "If you want you can rinse the moong dal first. Spread the lentils on a plate or tray or on a cloth.",
                "Dry the moong dal naturally or in sunlight. Once the mung lentils have dried, then add them to the wok or kadai. If you want you can add directly too.",
                "The moong dal needs to be golden and become aromatic. Use a thick bottomed pan or kadai.",
                "If the pan or kadai is not heavy or has a heavy base, then the moong dal will get browned too fast with uneven cooking and roasting.",
                "Grind to a fine flour.",
                "Melt ¼ cup ghee in a pan. You just need to melt the ghee and not heat it.",
                "If adding dry fruits, you can add some sliced or chopped dry fruits at this step and saute them in ghee till they become light golden.",
                "Add the melted ghee to moong dal flour and sugar mixture.",
                "Let this mixture become warm or cool.",
                "Now start shaping portions of the mixture into neat round balls. If you are not able to make the ladoo, then allow to cool for some more time at room temperature.",
                "Prepare ladoo like this with all of the mixture.",
                "You can offer these Moong Dal Laddu to the deities as naivedyam or serve to your family.",
                "Store the remaining Moong Dal Ladoo in an air tight box or jar and keep at room temperature or refrigerate."
            ],
            "Description": "When it comes to ladoo, this Moong Dal Laddu is a personal favorite. More so, because it is one of those delicious sweet offerings that I can make during",
            "Prep Time": "5 minutes",
            "Cook Time": "12 minutes",
            "Total Time": "17 minutes",
            "Cuisine": "Andhra, Indian, South Indian",
            "Course": "Sweets"
        },
        {
            "Title": "Sunnundalu Recipe | Urad Dal Laddu",
            "Ingredients": "230, grams, urad dal, or 1 cup urad dal (black gram) – hulled and split, 70, grams, raw sugar, or ⅓ cup sugar, can use regular sugar, 80, grams, (clarified butter) or ⅓ cup ghee at room temperature, 3 to 4, green cardamoms",
            "Instructions": [
                "Heat a thick bottomed pan or kadai on a low flame. Then add 1 cup urad dal in it.",
                "If you want you can rinse the urad dal first. Spread the lentils on a plate or tray or on a cloth. Dry the lentils naturally or in sunlight.",
                "Once the lentils have dried, then add them into the kadai or pan. If you want you can add directly too.",
                "Keep the heat to a low and begin to roast the dal.",
                "Continue to stir often while roasting. Keep on roasting and stirring for even browning and cooking.",
                "Roasting urad dal very well is very important. Half-roasted urad dal can give stomach aches.",
                "The dal needs to be golden and become fragrant.",
                "When the urad dal become golden, then cool them in the pan itself or you can remove the dal in a plate and let it cool.",
                "Once the urad dal have become warm or cooled down, add them in a grinder jar. Also add cardamom seeds removed from 3 to 4 green cardamom pods.",
                "Grind to a fine flour. It should have a fine texture and be floury.",
                "In the same grinder, add the sugar.",
                "Now melt ghee in a pan. You just need to melt the ghee and not heat it.",
                "If adding nuts or dry fruits, you can add some sliced or chopped dry fruits at this step and fry them in ghee till they become light golden.",
                "Mix thoroughly with a spatula or spoon.",
                "After mixing, the sunnundalu mixture will have a molten consistency and will be a bit fluid. Let this mixture cool at room temperature and let the ghee solidify.",
                "Once the mixture becomes dense, then you can easily shape the mixture into laddu.",
                "Make small to medium sized urad dal laddu. From the warmth of your hands, the laddu will soften while you shape them.",
                "Prepare the remaining sunnundalu like this with all of the mixture.",
                "You can even offer sunnundalu to the deities as naivedyam or serve to your family.",
                "Store the remaining Sunnundalu or Urad Dal Laddu in an air tight box or jar and refrigerate."
            ],
            "Description": "Of the various",
            "Prep Time": "5 minutes",
            "Cook Time": "12 minutes",
            "Total Time": "17 minutes",
            "Cuisine": "Andhra, South Indian",
            "Course": "Sweets"
        },
        {
            "Title": "Besan ke Laddu Recipe (Easy Diwali Sweet)",
            "Ingredients": "2, cups, gram flour, (besan) – 200 grams, ½, cup, (clarified butter) – 125 grams, add more ghee, if required, 1, cup, powdered sugar, (heaped) or boora or castor sugar or confectioner's sugar – 175 grams (powder ¾ cup white sugar or raw sugar in a mixer-grinder, small blender), 1, teaspoon, cardamom powder, or 5 to 6 green cardamoms, powdered in a mortar-pestle, 1 to 2, tablespoons, golden raisins, – chopped, 10 to 12, cashews, – finely chopped",
            "Instructions": [
                "Dry roast the besan in a heavy kadai or pan on low to medium-low heat for about 10 to 12 minutes.",
                "Keep on stirring continuously right from the beginning. So that the besan is not burned and cooks evenly.",
                "After 12 minutes of total roasting time, add the ghee.",
                "Mix very well and continue roasting the besan for some more 12 to 15 minutes stirring non-stop.",
                "You will see that the mixture will start releasing ghee and will give a nice fragrant nutty aroma.",
                "Some ghee will float on top and and you will see a molten lava kind of consistency where the ghee is floating.",
                "The mixture will also loose sides of the pan and become one. These are the signs that the besan is fully cooked.",
                "Once you see these signs, you can move on to the next step.",
                "Remove the pan from the stove-top and place it on your kitchen countertop. Add powdered sugar.",
                "Begin to mix with all the strength from your hands. You have to mix this part vigorously so that the powdered sugar melts in the roasted besan and ghee mixture and no lumps are formed.",
                "Add the powdered cardamom, raisins and cashews. Mix again.",
                "Once you have mixed the ladoo mixture well then let it become lukewarm or cool at room temperature.",
                "When cooled, make small or medium-sized besan ladoo and store them in an airtight steel container.",
                "If you are not able to shape in balls then freeze the mixture for 5 minutes or refrigerate for 20 minutes.",
                "Depending on the quality and consistency of ghee as well as the room temperature you may be able to easily shape these or not.",
                "Serve besan ladoo garnished with some nuts.",
                "Besan laddu keeps well at room temperature for a month. Keep in a clean covered jar or container in a cool dry place. You can use a steel jar.",
                "You can refrigerate these. But on refrigerating the ghee in the laddu solidifies making them dense or hard. So before serving, let them thaw completely."
            ],
            "Description": "Besan Ladoo is a popular Indian sweet made from gram flour a.k.a besan, powdered sugar and clarified butter (ghee). Also known as Besan ke Laddu these are round sweet balls made by roasting gram flour and ghee together, and then adding sugar to make a thick pasty dough – that is then formed into delicious, melt-in-your-mouth balls. Make this decadent sweet during festivals like",
            "Prep Time": "5 minutes",
            "Cook Time": "25 minutes",
            "Total Time": "30 minutes",
            "Cuisine": "North Indian",
            "Course": "Sweets"
        },
        {
            "Title": "Aval Laddu | Poha Laddu",
            "Ingredients": "1, cup, poha, – heaped, thick variety (flattened rice or parched rice), 100 grams, ⅓, cup, jaggery powder, or finely chopped jaggery or grated jaggery, 3 to 4, tablespoons, or add as required, 1, tablespoon, milk, – cold or at room temperature, ¼, teaspoon, green cardamom powder, 8 to 10, cashews, – optional, 1, tablespoon, raisins, – optional",
            "Instructions": [
                "Heat a pan. Lower the heat and add the thick poha in it.",
                "On a low heat roast the poha stirring often.",
                "The poha need to become crisp. If some of them become light brown its fine, but they need to be roasted or toasted well.",
                "Just break few poha/aval with your fingers and if they snap easily or break easily, they are done.",
                "Remove the poha/aval and add them to a grinder jar.",
                "Now add jaggery powder or finely chopped or grated jaggery.",
                "Grind to a slightly semi-coarse mixture, like that of fine sooji or rava.",
                "Remove this poha and jaggery mixture in a mixing bowl or pan.",
                "On a low to medium heat, fry the cashews till they start to turn light brown.",
                "Then add the raisins the green cardamom powder.",
                "Now add the ghee+cashews+raisins+cardamom mixture to the ground poha and jaggery mixture.",
                "Then add 2 tablespoon ghee which is in a semi-solid state. Mix thoroughly again.",
                "Now add 1 tablespoon milk. Mix again and start shaping the laddu.",
                "If you are not able to make the ladoo, then add ½ to 2 tablespoons more of the ghee. You have to keep on adding ghee till you can easily make the aval laddu",
                "Shape into small poha laddu and keep aside.",
                "Serve the Poha Laddu or Aval Laddu. Or store them in a container and refrigerate."
            ],
            "Description": "If you’ve considered flattened/beaten/parched rice or poha to be only used in making savory or salty dishes, then this post of Poha Laddu is going to change that thought of yours. Also called as Aval Laddu in Malayalam and Tamil languages, this recipe is quick and easy, yet equally delicious. This",
            "Prep Time": "1 minutes",
            "Cook Time": "14 minutes",
            "Total Time": "15 minutes",
            "Cuisine": "Indian",
            "Course": "Sweets"
        },
        {
            "Title": "Rava Laddu Recipe | Suji Ke Laddu",
            "Ingredients": "1, tablespoon, (clarified butter), 1, cup, rava, heaped, finer quality (sooji or semolina) – 185 grams, 6, tablespoons, fresh grated coconut, or desiccated coconut, optional, ½, cup, sugar, – 120 grams or add as per taste, 3, tablespoons, (clarified butter), 3, tablespoons, chopped nuts, like cashews, almonds, pistachios, 1, tablespoon, golden raisins, ½, teaspoon, cardamom powder, – or 5 to 6 green cardamoms seeds crushed to a powder in a mortar-pestle",
            "Instructions": [
                "Heat 1 tablespoon ghee in a heavy pan or kadai. Keep the heat to medium and let the ghee melt.",
                "Once the ghee has melted, lower the heat and add 1 heaped cup fine rava. use the fine variety of rava.",
                "Mix rava very well with the ghee. stir often and begin to roast rava on a low heat.",
                "Continue to roast rava till the rava become fragrant and changes its color. No need to brown the rava. The texture will also appear crumbly, loose and light. Roasting rava takes about 10 to 12 minutes on a low heat.",
                "Once the rava becomes hot, then you have to stir non-stop so that the rava does not get browned or burnt.",
                "Once the rava is roasted well, then add 6 tablespoons grated fresh coconut. You can also add desiccated coconut instead of fresh coconut.",
                "Stir and roast for about one to two minutes on a low heat.",
                "Now keep the pan on the kitchen counter and let the laddu mixture cool at room temperature.",
                "When the laddu mixture had cooled, take ½ cup sugar in a grinder jar.",
                "Grind the sugar to a fine powder. Now do not open the lid. Wait for a few minutes. If you open the lid immediately after grinding, you will some of the sugar powder drifting in the air.",
                "To the powdered sugar in the jar, add the rava+coconut mixture.",
                "Grind to a semi-fine or fine texture but do not make to a floury texture. Keep the grinder jar aside.",
                "In the same pan, in which rava was roasted heat 3 tablespoons ghee on a low to medium-low heat.",
                "Add 3 tablespoons chopped nuts. You can add almonds, pistachios, cashews or any nuts you like.",
                "Fry the nuts in the ghee till they start to become golden.",
                "Then add 1 tablespoon raisins. stirring often fry the raisins till they plump and swell in size.",
                "Turn off heat and keep the pan on the kitchen counter.",
                "Add the ground rava+coconut+sugar mixture directly from the grinder jar. the ghee should be hot when you add the powdered rava mixture.",
                "Mix very well with a spoon or spatula.",
                "Add ½ teaspoon cardamom powder.",
                "Mix again very well and then wait for the laddu mixture to become lightly warm or completely cooled at room temperature.",
                "If unable to form ladoo, then add 2 to 3 teaspoons of melted ghee.",
                "In case ladoo don’t hold shape and flatten, then keep the mixture in the fridge for 20 to 30 minutes and then shape in rava ladoo.",
                "Then take some portion of the mixture in your palms and shape into round balls which we call as ladoo.",
                "Make rava laddu with the entire mixture. Keep them in an air-tight steel jar.",
                "Serve rava laddu as a festive sweet or as an evening sweet snack. Store them in the fridge in air tight container."
            ],
            "Description": "Love laddu? Here’s the Rava Laddu Recipe that’s going to get you addicted to it, as soon as you bite into it! Also known as Suji Ke Laddu, these are delicious balls made with semolina or cream of wheat (rava/suji), ghee, sugar and flavored with green cardamom and nuts. My recipe of the Rava Ladoo also has some coconut in it as I personally love the flavor. While there are many variations of this popular Indian festive mithai (sweet), my version not only tastes awesome, but gets done quickly too.",
            "Prep Time": "5 minutes",
            "Cook Time": "25 minutes",
            "Total Time": "30 minutes",
            "Cuisine": "Indian, Maharashtrian",
            "Course": "Desserts, Sweets"
        },
        {
            "Title": "Badam Kheer Recipe | How To Make Badam Kheer | Badam Payasam",
            "Ingredients": "¼, cup, almonds, or 35 almonds, ⅓, cup, water, for soaking almonds, ¼ to ⅓, cup, milk, for grinding, 5, tablespoons, sugar, or add as required, 4, green cardamoms, 2.5, cups, milk, 10 to 12, strands of saffron",
            "Instructions": [
                "Rinse ¼ cup almonds (about 35 almonds) and add them in a bowl. Then pour ⅓ cup hot boiling water. Cover and keep aside for 30 to 40 minutes.",
                "Then drain all the water.",
                "Peel the almonds. You just need to press the skin and it comes out easily.",
                "Take 3 to 4 of blanched almonds and slice them thinly.",
                "Add the remaining almonds in a grinder jar.",
                "Next add 5 tablespoons sugar or add as required, seeds from 4 green cardamoms.",
                "Add ¼ to ⅓ cup milk. Milk can be chilled or at room temperature.",
                "Grind till smooth. The almonds should be ground very well to a smooth consistency. If there are coarse particles or chunks, then it can be irritating to the throat.",
                "Take 2.5 cups milk in a pan. Make sure that the pan is large enough so that the milk does not spill out while boiling.",
                "Keep the pan on a low flame and begin to heat badam milk till it comes to a boil. Stir at intervals so that the milk does not scorch from the bottom.",
                "Add 10 to 12 saffron strands and stir.",
                "Simmer on low flame for 3 to 4 minutes. Do stir at intervals.",
                "Then add the almond paste. mix very well with a spoon.",
                "Let the entire badam ki kheer come to a boil.",
                "Then switch off the flame. Scrape the evaporated and dried milk at the sides of the pan and add them in the kheer.",
                "You can serve badam kheer  hot, warm or chilled. While serving garnish badam ki kheer with the sliced almonds and a few strands of saffron."
            ],
            "Description": "In this Badam Kheer Recipe, 2 of my most-liked things have come together! One is my favorite nut, almond (badam) and the other is one of the most favorite desserts, kheer or payasam. This Badam Kheer is thus, a rich and creamy Indian style pudding made with blanched almond paste, milk and saffron. No doubt it is super decadent, is easy to make and gets done quickly as well. The only major time that goes in it is when you keep the almonds to blanch. Other than that, the kheer actually cooks within 20 minutes. Try it!",
            "Prep Time": "30 minutes",
            "Cook Time": "20 minutes",
            "Total Time": "50 minutes",
            "Cuisine": "Indian",
            "Course": "Desserts"
        },
        {
            "Title": "Semiya Payasam | Vermicelli Payasam",
            "Ingredients": "2, tablespoons, (clarified butter), 12 to 15, cashews, 2, tablespoon, raisins, 1, cup, semiya, (seviyan or vermicelli), 3.5, cups, whole milk, 4, tablespoons, sugar, or add as required, ½, teaspoon, cardamom powder, or 5 to 6 green cardamoms, crushed in mortar-pestle",
            "Instructions": [
                "In a heavy kadai, add the ghee. Let it melt.",
                "When the ghee melts, add cashews. On a low heat fry the cashews until they become golden.",
                "Remove the golden fried cashews with a slotted spoon and then the raisins.",
                "Fry the raisins on a low heat. The raisins will soon start to swell up. Stir often while frying.",
                "Once the raisins swell, then remove them with a slotted spoon.",
                "Set the raisins aside with the fried cashews.",
                "In the same kadai add the broken semiya (seviyan or vermicelli).",
                "Mix well. Keep the flame to a low and begin to roast the semiya stirring often.",
                "Roast until the semiya becomes golden. Stir often while roasting semiya for even browning.",
                "When the semiya has turned golden, add 3.5 cups milk. Milk can be chilled, warm, hot or at room temperature. For a thin payasam, add 4 cups milk. Do note that on cooling the payasam thickens. So add milk accordingly.",
                "Mix very well.",
                "Keep the heat to a low or medium-low and simmer until the semiya softens. Do stir at intervals so that the milk or semiya does not stick or get burnt at the bottom of the pan or kadai.",
                "Simmer until the vermicelli strands are softened.",
                "Then add sugar. You can add less or more sugar according to your desired sweetness.",
                "Sprinkle the cardamom powder.",
                "Mix very well and simmer on a low flame to medium-low flame for 2 to 3 minutes more. The sugar should dissolve.",
                "Switch off the heat and then add the fried cashews and raisins. You can even keep a few of the fried raisins and cashews as a garnish.",
                "Serve semiya payasam hot or warm.",
                "Press the sauté button of your IP. When you see the \"hot\" display on the screen, add ghee. Let it melt.",
                "Add the cashews and stirring often fry them until golden. Remove and set aside.",
                "Tip in the raisins and fry them until they swell. Remove and set aside.",
                "Add the vermicelli. Stirring non-stop roast them until golden. If the heat becomes too much, then press the sauté button to get the \"less\" option.",
                "Add milk and sugar. Give a good stir.",
                "Close the lid and position the pressure valve to sealing position. Press the porridge button and set the time to 7 minutes on high pressure.",
                "When the cooking is done (after you hear the Instant pot beep), give a quick pressure release after 10 minutes.",
                "Open the lid carefully. Add the cardamom powder and the fried cashews and raisins. Mix and stir.",
                "If the consistency is thin for your liking, then using the sauté function, simmer for a couple of minutes until the consistency thickens a bit.",
                "Semiya payasam can be served hot, warm or chilled. When it comes to a room temperature, then you can refrigerate and serve later if you prefer that.",
                "On cooling and refrigerating payasam will thicken. So keep it to a slight flowing consistency when you want to serve it cold, so that it does not thicken too much. If at all the payasam has thickened too much, then simply add a bit of milk to thin the consistency.",
                "If there any leftovers, then refrigerate for 3 to 4 days in a covered container. I would not recommend freezing as the taste and texture changes and becomes way off.",
                "After refrigeration, you can reheat the payasam on low heat if you want to eat it hot or warm. Add some milk or water if the consistency has thickened too much."
            ],
            "Description": "Semiya payasam is a creamy, sweet vermicelli pudding from the South Indian cuisine. This cardamom scented vermicelli payasam comes together in 20 minutes and can be made by beginners too. Being so easy, you can make it any day when you fancy something sweet or for any festive or religious occasion. I share both stove-top and Instant pot method for making this delicious semiya payasam recipe.",
            "Prep Time": "5 minutes",
            "Cook Time": "15 minutes",
            "Total Time": "20 minutes",
            "Cuisine": "South Indian",
            "Course": "Sweets"
        },
        {
            "Title": "Paruppu Payasam | Moong Dal Payasam",
            "Ingredients": "½, cup, moong dal, – 100 grams, (pasi paruppu), 1, cup, water, – to be added in the pan containing moong dal, 1.5, cups, water, – to be added in pressure cooker, ½, cup, thin coconut milk, or second or third extract or water, add as required, ¾, cup, jaggery powder, or chopped or grated jaggery, 1, cup, or first extract, 2, tablespoons, coconut oil, ½, teaspoon, green cardamom powder, or seeds of 4 to 5 green cardamons, crushed in a mortar-pestle, 12 to 15, cashews, 1, tablespoons, raisins",
            "Instructions": [
                "Rinse the moong lentils a couple of times. Take the moong lentils and 1 cup water in a small pan.",
                "Pour 1.5 cups water in a stovetop pressure cooker. Keep a small trivet in the cooker. Place this small pan with the lentils and water on the trivet.",
                "Pressure cook moong dal for 5 to 6 whistles on medium heat or for 9 to 10 minutes.",
                "You can also opt to cook the lentils directly in the cooker. In this case, you can add 1.5 cups water to the lentils and then pressure cook.",
                "When the pressure drops naturally, remove the lid and check the lentils. The lentils should be cooked well and softened.",
                "Pour the entire contents of the small pan (cooked moong dal + water) in another pan or a kadai (wok).",
                "Add ½ cup thin coconut milk or water and mix well.",
                "Add the jaggery. For a less sweet taste, you can add ½ cup jaggery powder or grated jaggery.",
                "Keep the pan or kadai on stovetop and on a low flame heat this mixture.",
                "Once all the jaggery dissolves, then add 1 cup of thick coconut milk.",
                "Mix very well and just gently heat through for a minute or two. Turn off the flame and set aside. Do not over heat or boil as the coconut milk can curdle.",
                "Fry until the cashews begin to get golden.",
                "Now pour the entire content of the tadka pan (coconut oil + cashews + raisins) in the payasam.",
                "Mix very well and serve pasi paruppu payasam hot or warm. Refrigerate the paruppu payasam as soon as it comes to room temperature.",
                "This payasam has to be refrigerated and it keeps well for a couple of days.",
                "On cooling it thickens. Opt to serve it cold or reheat until warm."
            ],
            "Description": "Dals/lentils are an integral source of proteins and other nutrients for us Indians, especially vegetarians and vegans. India is also the nation that produces the largest quantity of these food crops. Paruppu as it is known in South India, has uses in various dishes ranging from salty and savory to sweets like Paruppu Payasam. This is a Pasi Paruppu Payasam or Moong Dal Payasam – a creamy, decadent pudding of yellow moong lentils, jaggery, coconut milk and flavored with cardamom.",
            "Prep Time": "15 minutes",
            "Cook Time": "5 minutes",
            "Total Time": "20 minutes",
            "Cuisine": "South Indian",
            "Course": "Sweets"
        },
        {
            "Title": "Aval Payasam Recipe | Poha Kheer",
            "Ingredients": "2, tablespoons, (clarified butter), 10 to 12, cashews, 1, tablespoon, raisins, ½, cup, thick poha, (aval or flattened rice), 2.5, cups, full fat milk, 1, pinch pinch, saffron strands, – optional, 4, tablespoons, sugar, or add as required, ⅓, teaspoon, cardamom powder, – can also add ½ teaspoon cardamom powder if saffron has been skipped",
            "Instructions": [
                "In a heavy kadai or pan, take 2 tablespoons ghee and heat it on a low to medium flame.",
                "When the ghee melts, add 10 to 12 cashews.",
                "Begin to fry the cashews on a low flame till they become golden.",
                "Remove with a slotted spoon and keep them aside.",
                "Then add 1 tablespoons raisins.",
                "Stirring often fry the raisins, till they swell and become plump. Remove fried raisins with a slotted spoon and keep them aside.",
                "Add ½ cup thick poha.",
                "Mix the poha very well with the ghee.",
                "Begin to roast poha on a low flame stirring often till they get a light golden color.",
                "Then add 2.5 cups full fat milk. Milk can be chilled, warm, hot or at room temperature.",
                "Next add 1 pinch saffron strands. Saffron is optional and can be skipped. Stir.",
                "Keep the flame to a low and bring the payasam mixture to a boil stirring at intervals. Let the milk boil for 2 minutes. Do keep a check and stir at intervals or else the milk can froth over and spill out.",
                "Then add 4 tablespoons sugar or add as required.",
                "Next add ⅓ teaspoon cardamom powder. You can also add ½ teaspoon cardamom powder if you have not added saffron.",
                "Mix very well so that the sugar dissolves.",
                "Continue to simmer for 3 to 4 minutes more. Scrape the dried and evaporated milk solids from the sides and add to milk.",
                "Switch off the flame. Lastly add the fried cashews and raisins and mix. You can reserve a few cashews and raisins for garnish.",
                "Serve aval payasam hot or warm or chilled."
            ],
            "Description": "Its not just rice that is a versatile grain and can be used in a variety of ways to make the most delicious dishes, it is the forms of rice too that have the same feature. For instance, take poha or flattened rice with which this Poha Kheer is made. Known as Aval Payasam in Tamil Nadu (since poha is aval in Tamil), this is one of the easiest kheers you can make at home. Just like this",
            "Prep Time": "5 minutes",
            "Cook Time": "15 minutes",
            "Total Time": "20 minutes",
            "Cuisine": "South Indian, Tamil Nadu",
            "Course": "Desserts, Sweets"
        },
        {
            "Title": "Paal Payasam | Rice Payasam",
            "Ingredients": "3, tablespoons, basmati rice, or any regular or long grained non-sticky rice, 1, litre, whole milk, or full fat milk, 4, tablespoons, sugar, or add as per taste, 1, tablespoon, (clarified butter)",
            "Instructions": [
                "Heat ghee in a thick bottomed wide pan or kadai until it melts. Keep the heat to a low or medium-heat.",
                "When the ghee melts, add basmati rice.",
                "Stir the rice grains and sauté for about 30 seconds on a low to medium heat or till you get a nice fragrant aroma from the rice.",
                "Then add milk which has been boiled before. The pre-boiled milk can be hot, warm or refrigerated. Stir the rice grains with the milk.",
                "Bring the milk to a boil first on a low to medium heat. Do stir when the milk is getting heated up, so that the bottom of the milk does not get scorched.",
                "After the milk has come to a boil, continue to simmer till the rice grains are cooked completely and softened.",
                "For quick cooking of the rice, I kept a lid on the pan. But in this case, you have to be in the kitchen so that you open the lid when the milk starts frothing up. Or else you can cook the rice uncovered. But do stir regularly.",
                "Continue to cook further till the rice grains are completely softened. After the rice grains are cooked, you can even mash them while stirring with a spoon or spatula.",
                "Simmer for a further 8 to 10 minutes till the milk has reduced and the payasam has thickened.",
                "Serve Paal Payasam as is or garnished with saffron, rose petals or sliced almonds. You can serve the payasam hot or cold.",
                "You can also offer the payasam to any deity first before serving to anyone else.",
                "Keep any leftover payasam in the fridge after it comes at room temperature."
            ],
            "Description": "This Paal Payasam recipe is a typical Tamil style Rice Payasam – a creamy, delicious pudding of milk and rice. No extras added, just the basic rice pudding in South Indian style. Rice is a staple grain in the Indian cuisine and we make many preparations from it. Particularly in South India, savory and salty preparations like",
            "Prep Time": "10 minutes",
            "Cook Time": "50 minutes",
            "Total Time": "60 minutes",
            "Cuisine": "South Indian, Tamil Nadu",
            "Course": "Desserts, Sweets"
        },
        {
            "Title": "Kesari Recipe | Perfect Rava Kesari",
            "Ingredients": "6, tablespoons, (clarified butter), 3 to 4, tablespoons, cashews, 1, tablespoon, raisins, 1, cup, rava, – finer textured, 160 grams, (sooji or semolina or cream of wheat), ¾ to 1, cup, sugar, or as add required – 190 to 200 grams, 2.5, cups, water, or milk, 2 to 3, pinches, saffron strands, – about 20 to 30 saffron strands, 2 to 3, drops, natural orange color extract, – optional, ½, teaspoon, green cardamom powder, 1, pinch, edible camphor, – optional",
            "Instructions": [
                "In a heavy kadai or a thick bottomed pan take 6 tablespoons ghee. Heat ghee on a medium-low flame till it melts completely.",
                "Add the cashews.",
                "Begin to fry cashews stirring them often till they become golden. Remove with a slotted spoon and keep fried cashews aside.",
                "Next add the raisins to the hot ghee.",
                "Stirring non-stop fry the raisins till they become plump and swell.",
                "Remove them and keep aside with the fried cashews.",
                "Now reduce heat to a low and add the fine rava to the ghee. Mix well.",
                "Begin to roast rava on a low to medium-low heat.",
                "Stir frequently while roasting rava for even cooking.",
                "Roast till you can see the ghee getting separated and the color of rava will also change. A nice aroma will also emanate from the roasted rava.",
                "The color of the rava should not become brown.",
                "Roasting rava takes about 9 to 11 minutes on low to medium-low heat. But do note that the timing will vary with the type and make of the kadai or pan and the heat intensity.",
                "When you begin to roast rava, at that time take the sugar in a saucepan. I added ¾ cup sugar.",
                "Add 2 to 3 pinches of saffron strands. You can also add a natural yellow or orange color extract. I also added 2 drops of natural orange color extract.",
                "Add 2.5 cups water.",
                "Keep the pan on stovetop and on a medium to medium-high flame begin to heat the sugar solution.",
                "When you keep the pan on the stove-top for heating, at that time stir with a spoon so that all the sugar is dissolved.",
                "Bring this sugar solution to a rolling boil.",
                "By the time the sugar solution starts boiling, the rava will also get roasted well.",
                "Lower the heat and now carefully pour the sugar-saffron solution in the well roasted ghee-rava mixture in a steady stream and slowly.",
                "Take care while pouring as the mixture splutters.",
                "Stir and mix very well. Break lumps, if any while mixing.",
                "Cook rava kesari mixture on a low to medium-low heat stirring often.",
                "The rava or sooji will absorb the water and swell and the mixture will begin to thicken.",
                "When the mixture starts thickening, add the fried cashews and raisins reserving a few for garnish.",
                "Also add the green cardamom powder. At this step you can also add a pinch of edible camphor if you want. Mix very well.",
                "Stir till the mixture releases some ghee and the rava has absorbed all the water and cooked well.",
                "Then turn off the heat and cover the pan for 5 minutes just to allow the rava kesari to steam.",
                "After five minutes, remove the lid. Stir rava kesari.",
                "If you want to make slices, then immediately pour it in a steel pan or tray. Spread evenly and when warm or cooled, cut into diamond shaped or square slices.",
                "Serve rava kesari hot or warm. You can also serve it as a side sweet dish with a South Indian lunch or dinner."
            ],
            "Description": "Here’s a dish that is the South Indian variant of the North Indian suji ka halwa. Meet Kesari Recipe – a popular, delicious South Indian sweet dish made with rava or suji (cream of wheat or semolina), sugar, ghee (clarified butter), saffron, nuts and dry fruits. This melt-in-mouth, orange colored preparation is also referred to as Rava Kesari Recipe. Make this decadent sweet treat with my simple recipe that I have shared with step-by-step pictures and video.",
            "Prep Time": "10 minutes",
            "Cook Time": "15 minutes",
            "Total Time": "25 minutes",
            "Cuisine": "South Indian, Tamil Nadu",
            "Course": "Desserts, Sweets"
        },
        {
            "Title": "How to Make Paneer | Homemade Paneer Recipe",
            "Ingredients": "1, litre, full fat whole milk, 2 to 4, teaspoons, lemon juice, or vinegar or 3 to 4 tablespoons curd or yogurt, cheese cloth or muslin or a thin cotton napkin, some bowls and a heavy weight object or plates",
            "Instructions": [
                "First, rinse a large, heavy duty pot with water. Add milk to the pot.",
                "Then begin to heat the milk on a medium-low heat.",
                "Stir occasionally so that the skin does not form on the surface and also so that the milk does not get burnt from the bottom.",
                "Meanwhile, take a pan or a bowl. Place a strainer on the pan. Line the strainer with clean muslin or cheesecloth or cotton napkin. You can even line the pan directly with the muslin.",
                "When the milk starts boiling, add the lemon juice or vinegar. Begin to stir.",
                "The milk has to curdle completely. Stir the milk when it is curdling so that the curdled milk does not stick to the base of the pan.",
                "Sometimes you will see the milk has curdled partly but no watery whey can be seen. In this case also add 1 to 2 teaspoons more of the food acid and stir again. You should see the greenish colored whey in the milk.",
                "After the milk has curdled completely and you see the greenish whey, switch off the heat and then immediately pour the entire mixture in the strainer lined with the muslin, cheesecloth or cotton napkin.",
                "Carefully gather the edges of the muslin as the coagulated milk mixture will be very hot. While doing this more of the whey will be strained.",
                "Run some clean fresh water on the gathered muslin all over.",
                "With the ends tightly gathered, run clean, fresh water all over the cloth to rinse.",
                "Keep a heavy weight on top of the muslin or cheesecloth for 30 to 40 minutes. Use a heavy object having 500 to 600 grams weight. You can even hang the muslin bundle for an hour on your kitchen basin faucet if not using a heavyweight object.",
                "Some more whey will be strained when you place the heavyweight object. So remove the whey from the plate.",
                "After 30 to 40 minutes the paneer will set.",
                "Once warm or cooled cut homemade paneer into cubes or any shape.",
                "You can also refrigerate the paneer. Keep it in an air tight container or immerse the paneer block in a bowl of water and keep in the fridge.",
                "Homemade paneer stays fresh for 2 to 3 days in the fridge in an air-tight container. You can slice the paneer cheese later and use it any recipe."
            ],
            "Description": "Learn how to make fresh paneer at home with only a few simple ingredients. This easy homemade paneer recipe creates the softest, most tender paneer cheese from scratch – with no preservatives or special additives needed.",
            "Prep Time": "2 minutes",
            "Cook Time": "13 minutes",
            "Total Time": "15 minutes",
            "Cuisine": "North Indian",
            "Course": "Main Course"
        },
        {
            "Title": "Khoya Recipe | Mawa Recipe",
            "Ingredients": "1.25, litres, whole milk, or 1250 ml",
            "Instructions": [
                "Bring milk to gentle boil first on a low to medium heat.",
                "Then lower the heat and simmer the milk. Stir at intervals whilst the milk is simmering.",
                "A stage will reach when the reduced milk will resemble rabdi (an indian sweet).",
                "Towards the end when the milk has reduced much, you will see bubbles bursting in the reduced milk.",
                "At this point continuously stir. If you don't then the reduced milk will get browned or burnt. The bubbles are due to moisture in the milk.",
                "Add this homemade khoya or mawa as needed while making various indian sweets or Indian curries.",
                "When cooled, store khoya in an air-tight container. Refrigerate for 2 to 3 days or freeze for 6 to 8 days."
            ],
            "Description": "Khoya, also known as Mawa or Khoa, is a key ingredient for making most Indian sweets, especially in the Northern parts of the country. These dried, evaporated milk solids are made using just one ingredient: milk. Learn how to make this simple ingredient for yourself at home using the traditional Khoya recipe!",
            "Prep Time": "0 minutes",
            "Cook Time": "",
            "Total Time": "",
            "Cuisine": "North Indian",
            "Course": "Sweets"
        },
        {
            "Title": "How To Make Rice Flour | Rice Flour Recipe",
            "Ingredients": "1.5, cups, rice, – 285 grams or as required in small to medium quantities, water, as required",
            "Instructions": [
                "Take the required quantity of rice you will need. Rinse in water a couple of times.",
                "Soak rice for 2 to 3 hours in enough water.",
                "After 2 to 3 hours, drain all the water from the soaked rice grains.",
                "Now place a large clean kitchen napkin or kitchen towel on the countertop or on a table.",
                "Spread the rice on the kitchen towel. Let the rice grains dry in shade for about about 45 minutes to 1 hour. Do not dry in the sun.",
                "Depending on the type of snacks you are making, you can completely dry the rice grains or let them have a faint moist touch.",
                "Then add the rice grains in a mixer-grinder jar or a sturdy blender. For larger quantities of rice, use a grain mill.",
                "Grind to a texture you prefer – it can be fine, semi-fine or coarse. The texture of the rice flour will depend on the recipe you will be using.",
                "I ground rice grains in one batch. But if you use more cups of rice, then you will have to grind in 2 to 3 batches and for more quantities, grind in a mill.",
                "Take the rice flour in a fine sieve and then sift it.",
                "After sieving you will see small granules of rice grains in the sieve. You can add these back to the grinder jar and then grind again and sift again.",
                "Or you can use these small idli rava like rice grains to make idli or dosa or any recipe that calls for rice rava.",
                "Now spread the rice flour in the plate and let it dry for some more time till its completely dry.",
                "Then spoon the rice flour in an air-tight container. Store in a cool place and use as required.",
                "If the recipe calls for roasting the rice flour, then you can roast till you see some steam coming from it.",
                "If not using in a few days, then you can refrigerate or freeze rice flour. From 1.5 cups of rice, I got 2.33 cups rice flour."
            ],
            "Description": "Speaking of gluten free flours, my personal favorite is the rice flour. It is neutral, tastes delicate and also acts as an excellent ingredient to crumb coat patties, cutlets and other fried dishes. The Indian cuisine itself has a varied range of Rice Flour Recipes ranging from lovely steamed dishes and pancakes to bakes and more. If you are searching for How To Make Rice Flour, this post is going to be your best guide. Here, I’ve explained a DIY process of making this flour, which will be helpful to you.",
            "Prep Time": "20 minutes",
            "Cook Time": "0 minutes",
            "Total Time": "20 minutes",
            "Cuisine": "Indian, World",
            "Course": "Snacks"
        },
        {
            "Title": "How to Make Ghee | Homemade Ghee Recipe",
            "Ingredients": "500, grams, – unsalted, preferably cultured",
            "Instructions": [
                "Take a large, heavy-bottomed pot or pan. Chop butter roughly and place in the pan covering the entire surface of pan evenly.",
                "Place pan on stovetop and heat on medium-low to medium heat. The butter will begin to melt.",
                "Stir in intervals when butter begins to melt to assist the larger pieces. When all the butter has melted, reduce heat to the lowest setting and simmer gently.",
                "About a minute or so after all the butter is melted, you will hear sounds from the bottom of the pan and see milk solids appearing on the surface.",
                "The entire surface will be covered with milk solids. Continue to simmer.",
                "You will see the color change gradually to a from a buttery, pale yellow to light golden with the butter bubbling and shimmering. Continue to stir occasionally.",
                "After some time, the milk solids will begin to settle at the bottom and the surface will start to look clearer.",
                "Continue to simmer for a couple of minutes after all the milk solids have settled.",
                "When you see medium to large sized bubbles forming on the top and the entire mixture is bubbling, you are almost done! Continue to simmer for a 1 to 2 minutes more.",
                "Remove from heat and place the pan on the countertop. You will see a layer of fine tiny bubbles on the top. Don't worry – these bubbles go away as the ghee gradually cools.",
                "The milk solids will begin to caramelize and turn golden from the residual heat, and you will see the color of ghee become darker.",
                "Wait until all the simmering stops and you see the browned bits of milk solids at the bottom.",
                "While the ghee is still hot, pour it through the strainer or cheese cloth placed on top of a glass jar.",
                "If your pan isn't very heavy, simply lift it and pour the ghee. I used a heavy ceramic coated cast iron pan, so using a ladle made this process easier.",
                "Use ghee as required. I recommend pulling out enough ghee for a week or so worth of cooking and keeping it in a small container in the kitchen.",
                "Store the rest in a cool, dark spot in the pantry for best storage. If stored well, ghee can last up to one year at room temperature."
            ],
            "Description": "Ghee is a type of clarified butter that is traditional in Indian cuisine. This nutty flavored and high smoke point fat has been used for thousands of years, with deep roots in Ayurvedic practices. Making desi ghee at home is simple, easy and cost effective and will render much better flavor than commercially available varieties. Follow along with me as I show you how to make homemade ghee recipe in the traditional Indian way with the help of step-by-step photos and video!",
            "Prep Time": "5 minutes",
            "Cook Time": "20 minutes",
            "Total Time": "25 minutes",
            "Cuisine": "Indian",
            "Course": "Condiment"
        },
        {
            "Title": "Coconut Burfi | Nariyal ki Barfi",
            "Ingredients": "1, cup, desiccated coconut, – heaped, unsweetened and finer textured, ¾, cup, whole milk, ¾, cup, sweetened condensed milk, ½, teaspoon, cardamom powder, or 3 to 4 green cardamoms crushed to powder in a mortar-pestle, ½, teaspoon, rose water, – optional, 1, tablespoon, sugar, – optional, 1, tablespoon, (clarified butter), 12 to 15, saffron strands, – crushed or 2 to 3 pinches of ground saffron powder, optional, 8 to 10, cashews, – halved or chopped, optional",
            "Instructions": [
                "Warm the milk first in the microwave or stovetop.",
                "Grease a baking tray or steel plate with ghee or a neutral flavored oil.",
                "Heat ghee in a pan. Add the milk soaked coconut. Stir to mix and sauté on a low heat for 2 to 3 minutes.",
                "Now add the condensed milk and stir to mix the ingredient thoroughly. Cook on a low heat stirring often.",
                "Add sugar if you prefer. Then add cardamom powder.",
                "Continue to cook and stir. The coconut burfi mixture will thicken slowly.",
                "Ghee should start releasing from the sides of the mixture. You will see tiny drops of ghee. Takes about 20 to 25 mins on a low heat.",
                "Add rose water if using. Stir again.",
                "Then pour the burfi mixture in the greased tray or thali.",
                "Sprinkle saffron powder or press some halved or chopped cashews on the top.",
                "Let it cool completely at room temperature.",
                "Slice the burfi and then serve.",
                "Coconut Burfi can also be refrigerated. It keeps well for 1 to 2 days in the refrigerator."
            ],
            "Description": "This recipe of Coconut Burfi (also known as Nariyal ki Barfi in Hindi), is a decadent sweet treat made with condensed milk and delicious coconut. It’s fudge-like consistency is soft so that each bite simply melts in your mouth. Here I share my favorite Coconut Barfi recipe with step-by-step instructions and photos to make this delish snack or dessert for all of your special occasions!",
            "Prep Time": "",
            "Cook Time": "25 minutes",
            "Total Time": "",
            "Cuisine": "Indian, Maharashtrian",
            "Course": "Sweets"
        },
        {
            "Title": "How to Make Butter",
            "Ingredients": "2, cups, heavy cream, or heavy whipping cream, with 35% fat and above, 2, cup, cold water, or as needed, salt, or ground black pepper as required – optional",
            "Instructions": [
                "After you have collected 2 or 3 cups of cream, then you can easily convert it into butter. Defrost the cream. You can defrost it in microwave or keep it on the countertop till it comes to room temperature.",
                "To culture this cream add ¼ cup yogurt (curd) to 2 cups of cream. The cream can be cold when you add the yogurt.",
                "Mix well and set aside for 7 to 8 hours until the cream gets cultured. After fermentation, the cream will thicken, be wobbly and set nicely.",
                "Keep this cultured cream in the refrigerate for a few hours until it becomes cold.",
                "Later in a blender, or in a food processor or in a bowl add the cream or the cultured cream. Turn on the blender or food processor or use an electric blender to whip the cream in a bowl.",
                "While whipping, initially, the cream will begin to smoothen and you will get whipped cream with soft peaks first and later with stiff peaks.",
                "Continue until you see buttermilk and the thick butter getting separated. You will see lumps of butter floating in the buttermilk.",
                "The butter will also be stuck on the whipping blades, so ensure to scrape the whipping blades with a spatula and add the butter solids back to the bowl.",
                "Now add ½ cup of cold icy water all over the butter in the bowl. This will solidify the butter and firm it up.",
                "after",
                "Line a mesh strainer with cheesecloth or muslin and place it on top of a bowl. Pour the buttermilk and butter from the bowl into the cheesecloth. Scrape the butter at the sides of the bowl with a spatula and transfer it onto the cheesecloth.",
                "Collect the edges and form a bundle, gently pressing off the extra whey or buttermilk from the butter. Open the cheesecloth and you will see a nice lump of soft homemade white butter.",
                "After you have collected the butter, you will see buttermilk collected in the bottom of the bowl. Use buttermilk as needed in any recipes.",
                "Now place the cheesecloth with the butter on the mesh strainer. Keep the mesh strainer on top of the same bowl in which you whipped the cream. We will be rinsing the butter with ice cold water so that more of the buttermilk is extracted from it.",
                "Gently pour ½ cup cold water all over the butter. This will help chill the butter, helping it to solidify. Press the butter with a wooden spoon or spatula so that more of the buttermilk is removed from it.",
                "Repeat – pour ½ cup cold water all over, press the butter to extract the buttermilk. Discard the water.",
                "Pour ½ cup cold water over the butter for a third time and press again to remove any extra buttermilk. While rinsing, you will see that the milky white color of the water will become more faint.",
                "You could also strain the butter from the buttermilk through a superfine strainer. Some people use their hands to rinse the butter and remove the buttermilk. I do not prefer to use my hands as I find it messy.",
                "Bring the edges of the cheesecloth together and press gently to extract as much buttermilk from the butter as possible. The more the buttermilk that is removed, the longer will the shelf life of your homemade butter.",
                "Remove the butter from the cheesecloth and place it in an airtight container. With a spoon or spatula collect any white butter clinging on the cheesecloth and transfer to the container.",
                "Feel free to line the container with parchment paper. I prefer to store the butter unsalted in the refrigerator.",
                "At this point, as a variation, you could also add salt or ground pepper or your choice of dried herbs to the butter and mix very well.",
                "With a spatula, smooth the top and the edges making the butter even from all sides. Cover with an airtight lid and let the butter set in the refrigerator until you are ready to use it.",
                "Butter stays good in the refrigerator for a couple of weeks. If you have drained the buttermilk very well, then the butter will keep for about a month. You can also freeze this homemade white butter.",
                "To culture cream you can use homemade cream as I have explained above or use packaged cream to culture it.",
                "To culture packaged cream, take 2 cups of heavy cream. The cream can be cold or at room temperature. Add ¼ cup of yogurt or curd to the cream and mix well.",
                "Cover and let the cream set for 8 to 9 hours. You can also use the Instant Pot yogurt setting to make this sour cultured cream.",
                "When the cream is perfectly cultured, it will be wobbly and thickened. Place the cultured cream in the fridge and let it cool completely before churning.",
                "Then follow the steps as mentioned above to whip the cultured cream until the cultured butter gets separated. You can choose to whip the cultured cream in a blender, stand-mixer or with a hand-held electric blender.",
                "Collect the cultured butter in a muslin draining all the buttermilk. Rinse the butter in ice cold water and remove as much buttermilk from it as you can.",
                "Transfer completed cultured butter to an air-tight box and refrigerate or freeze it. You can use this cultured butter to make cultured ghee."
            ],
            "Description": "If you have ever wondered how to make butter at home, you have come to the right place. In this post, I’ll show you how to make pure, fresh, homemade white butter – called",
            "Prep Time": "20 minutes",
            "Cook Time": "0 minutes",
            "Total Time": "20 minutes",
            "Cuisine": "Indian, World",
            "Course": "Side Dish"
        },
        {
            "Title": "Easy Dry Fruits Laddu Recipe",
            "Ingredients": "1, cup, chopped dates, 3, tablespoons, almonds, 2, tablespoons, raisins, 2, tablespoons, cashews, 8, dried figs, 1, tablespoon, desiccated coconut, – optional, 2, green cardamoms, – crushed in a mortar-pestle",
            "Instructions": [
                "Firstly begin to roast the almonds in a pan until they get browned.",
                "Keep stirring the almonds at intervals. You can also lightly roast the almonds. Set aside.",
                "Roughly chop the dates and figs.",
                "You will be needing 1 cup of chopped dates – so measure the chopped dates and set aside.",
                "First lightly crush the cardamom pods in a mortar-pestle. Then remove the peels and crush the seeds coarsely. Set aside.",
                "In a spice grinder, blender or mixer-grinder add the chopped dates, figs, cashews, raisins, almonds, desiccated coconut and the coarsely powdered cardamom powder.",
                "Make small balls from your hands and the dry fruits laddu are ready.",
                "Serve the dry fruits laddu immediately or store in an air tight container and refrigerate. Dry fruits ladoo stays good for a few days at room temperature and a couple of weeks in the refrigerator.",
                "You could also make a large batch and refrigerate them for a few weeks or freeze them for a couple of months."
            ],
            "Description": "Dry Fruits Laddu is an easy, nutritious recipe of energy balls that are healthy and tasty. This dry fruit laddu recipe is made without any added sugar or jaggery, ghee or oil, is naturally vegan and comes together under 20 minutes. Packed with nutrients, good fats and fibre, these energy balls are made with dates, figs and various nuts.",
            "Prep Time": "15 minutes",
            "Cook Time": "5 minutes",
            "Total Time": "20 minutes",
            "Cuisine": "Indian",
            "Course": "Desserts, Sweets"
        },
        {
            "Title": "Lauki Halwa (Bottle Gourd Halwa)",
            "Ingredients": "4, tablespoons, (clarified butter), 2, cups, tightly packed grated lauki, or 300 grams lauki (bottle gourd or opo squash or dudhi), 2, cups, whole milk, – milk can be pasteurized or boiled before and can be used at room temperature or chilled, 7 to 8, tablespoons, sugar, or add as required, 5 to 6, green cardamoms, – powdered or crushed or ½ to 1 teaspoon cardamom powder, 3 to 4, tablespoons, chopped nuts, – almonds, cashews or pistachios, 1, tablespoons, raisins, – optional",
            "Instructions": [
                "Firstly rinse, peel and grate the lauki. Before grating taste the lauki. If it tastes sour or bitter then discard and do not cook it.",
                "You will need 2 cups tightly packed grated lauki.",
                "Heat ghee in a heavy pan or kadai on medium-low to medium flame. Use a large kadai so that milk does not spill outside.",
                "Add the grated lauki. Mix grated lauki very well with the ghee.",
                "On a low to medium-low flame begin to saute the lauki. Stir often when sauteing lauki.",
                "Saute lauki till the moisture dries. Then add whole milk and mix very well.",
                "Continue to cook on a low to medium-low flame till the milk comes to a boil. In between do stir at times.",
                "The milk will start boiling. At this step be attentive and keep on stirring, so that the milk does not spill from the pan.",
                "Stirring often continue to cook till ¾ or 75% of the milk has reduced and absorbed.",
                "Add sugar and chopped nuts. Mix very well. You can even add 2 to 3 teaspoons of rose water or kewra water (pandanus water) if you want at this step.",
                "Stirring often cook till the halwa mixture starts coming together and thickens.",
                "The halwa will gradually thicken and you will see some ghee being released from the sides. There should not be any liquid in the dudhi halwa.",
                "Then switch off the heat and add golden raisins. Adding raisins is optional. Mix very well.",
                "Garnish with some chopped nuts and serve lauki halwa hot or warm. Refrigerate remaining halwa. It stays good for a couple of days in the refrigerator."
            ],
            "Description": "Lauki halwa is a sweet Indian dessert made with bottle gourd or opo squash, milk, ghee, sugar and flavored with cardamom and nuts. This is a well known variant of halwa made with a vegetable – here in this case with Bottle Gourd which is also called as Lauki or Ghiya in Hindi and Dudhi in Marathi languages. So this sweet is known by the name ‘lauki ka halwa’ or ‘dudhi halwa’. You can easily make this halwa variant as a sweet dish on any day or during Hindu fasting days like Navratri fast or Ekadashi.",
            "Prep Time": "10 minutes",
            "Cook Time": "45 minutes",
            "Total Time": "55 minutes",
            "Cuisine": "Indian",
            "Course": "Desserts"
        },
        {
            "Title": "Apple Halwa (Indian Apple Pudding)",
            "Ingredients": "1, kilogram, apple, or 7 to 8 medium sized apples or 7 cups chopped apples, 5, tablespoons, sugar, or add as required – optional, 3, tablespoons, 2, tablespoons, water, 1, teaspoon, cinnamon powder, (ground cinnamon), 1, teaspoon, vanilla extract, or ½ teaspoon vanilla essence, 10, almonds, – chopped, 10, cashews, – chopped",
            "Instructions": [
                "Rinse 1 kg apples (7 to 8 medium-sized apples) very well in water using a colander. Drain all the water. Then peel each apple.",
                "Quarter them and slice off the part containing seeds and pith.",
                "Then chop the apples in small cubes. You will need 7 cups chopped apples.",
                "Heat a heavy kadai or pan and keep the heat to medium-low. Add 2 tablespoons ghee in the kadai and let it melt.",
                "Add the chopped apples.",
                "Mix it with the ghee and begin to saute the apples on a low to medium-low flame for some 5 to 6 minutes. Some apples will soften and some won’t.",
                "Then add 2 tablespoons water. Mix again.",
                "Cover the kadai or pan cook for 12 to 15 minutes. stir at intervals.",
                "On a low to medium-low heat cook covered with the lid till all the apples have softened and become mushy. The apples mixture will start to thicken.",
                "With a spoon or potato masher, mash the cooked apples and keep on stirring so that the mixture does not stick to the bottom of the pan. You could keep some small chunk sized pieces if you want.",
                "Then add sugar. Tangy apples will require more sugar. So amount of sugar to be added depends upon the sweetness of the apples. mix well.",
                "Stirring often cook till some ghee can be seen at the sides for about 9 to 10 minutes on a low to medium-low heat. At this point, there should be no bubbling of apple juices in the halwa.",
                "Then add cinnamon powder. Apples and cinnamon together are a wonderful combination.",
                "Next add vanilla extract.",
                "Add chopped nuts. Also keep a few chopped nuts aside for garnish.",
                "Mix very well. Check the taste of halwa and if required add some more sugar.",
                "Sauté stirring often for 3 to 4 minutes till the apple halwa mixture starts coming together and pulls away from the sides of the kadai or pan.",
                "Serve apple halwa hot or warm garnished with some chopped nuts. Leftover halwa can be refrigerated. Stays good for a week."
            ],
            "Description": "Apple halwa is an easy and delicious halwa or Indian apple pudding that is made with sweet apples, ghee (clarified butter), sugar and nuts. The smooth texture of this apple halwa has aromatic hints from cinnamon and vanilla. Make this delish apple sweet when a sweet craving strikes. The recipe is easy but requires some hand work and patience.",
            "Prep Time": "15 minutes",
            "Cook Time": "30 minutes",
            "Total Time": "45 minutes",
            "Cuisine": "Indian",
            "Course": "Desserts"
        },
        {
            "Title": "Basundi Recipe | How to make Basundi Sweet",
            "Ingredients": "½, can, sweetened condensed milk, – 200 grams or ½ cup + 2 tablespoons, 2, cups, whole milk, ½, teaspoon, cardamom powder, or 4 to 5 green cardamoms, powdered in a mortar-pestle, 6, cashews, – slivered or chopped, 10, pistachios, – slivered or chopped, unsalted, 8, almonds, – slivered or chopped, 10 to 12, saffron strands, 2 to 3, pinches, grated nutmeg, or nutmeg powder, 2, tablespoons, chironji, (charoli seeds), 1 to 2, tablespoons, almond slivers, 1 to 2, tablespoons, pistachio slivers, – unsalted",
            "Instructions": [
                "Add whole milk and condensed milk in a thick bottomed saucepan or kadai. Stir and mix with a wired whisk so that the condensed milk is mixed evenly with milk.",
                "If you do not prefer a sweeter basundi add ¼ cup milk or more according to your preferences. Keep in mind the mixture thickens while cooking, so add the milk accordingly.",
                "Place the pan on stovetop. Keep heat to a low. Bring this mixture to a gentle boil. Keep on stirring at intervals so that the liquids do not get browned or burn from bottom.",
                "Cook on low heat and simmer for 20 to 25 minutes. Stir after intervals of 3 to 4 minutes.",
                "Gradually the basundi mixture would begin to thicken.",
                "Scrape the milk solids from the sides and the cream collected on the top and add it back to the basundi mixture.",
                "Add grated nutmeg or nutmeg powder, slivered nuts, cardamom powder and saffron strands.",
                "Mix and stir to combine. Continue to simmer for 1 to 2 minutes more.",
                "Pour in serving bowls. Serve basundi hot or warm or cold. While serving garnish with some slivered nuts like almonds or pistachios. You can serve as is or with poori."
            ],
            "Description": "Basundi is a rich, creamy Indian sweet or dessert that’s made with whole milk and flavored with fragrant spices, nuts and optionally dry fruits like raisins. My easy basundi recipe is ready in under 30 minutes thanks to a secret ingredient. I use sweetened condensed milk to prepare this wonderfully indulgent dish in a jiffy! Here you’ll find step-by-step instructions and photos to make the best (and fastest) basundi from scratch.",
            "Prep Time": "5 minutes",
            "Cook Time": "20 minutes",
            "Total Time": "25 minutes",
            "Cuisine": "Indian",
            "Course": "Sweets"
        },
        {
            "Title": "Papaya Halwa (Papaya Sweet)",
            "Ingredients": "1, papaya, medium-sized and semi-ripe,  approx. 4.5 cups of chopped papaya or 3.5 to 4 cups of grated papaya, 2 to 3, tablespoons, sunflower oil, or any neutral oil, can add ghee instead, 4 to 5, tablespoons, sugar, – or as required as per the sweetness of the papaya, 2 to 3, green cardamoms, powdered or ½ teaspoon green cardamom powder, 2, tablespoons, almond powder, or milk powder or coconut powder or evaporated milk solids (khoya or mawa) – I used 15 almonds and ground them to get about 2 tablespoons of almond powder, 12 to 15, halved, cashews, or as required",
            "Instructions": [
                "Rinse the papaya and slice them.",
                "Remove the seeds and the pith from the top. Peel the slices.",
                "Then chop the papaya slices, finely. You could also grate the papaya if its semi-ripe.",
                "Heat oil or ghee in a kadai or pan. Add the finely chopped papaya.",
                "Stir and cook on a low flame for about 14 to 15 minutes.",
                "At this point, add sugar and then stir to combine. Continue to cook for further 18 to 20 minutes on a low heat.",
                "Cook for 5 to 6 minutes more till the whole papaya halwa has gotten together and become one whole.",
                "Add cashews and cook for 1 to 2 minutes more.",
                "Serve papaya halwa hot or warm. You can also refrigerate and serve the halwa as a cold dessert."
            ],
            "Description": "Yes, a halwa made with papaya. And why not? This rich and easy Papaya Halwa sweet is prepared by slow-cooking semi ripe papaya, sugar and almond powder in oil or ghee. With hints of lovely cardamom, it makes for tasty dessert to end your meals with. Not to forget, this Indian dessert with Papaya is also a great choice when you want to have something different and delicious during",
            "Prep Time": "10 minutes",
            "Cook Time": "40 minutes",
            "Total Time": "50 minutes",
            "Cuisine": "Indian",
            "Course": "Desserts, Sweets"
        },
        {
            "Title": "Sweet Potato Halwa (Shakarkandi ka Halwa)",
            "Ingredients": "2, sweet potatoes, (shakarkandi), medium to large, 4, tablespoons, sugar, or as required, depends on the sweetness of the sweet potatoes, 7 to 8, tablespoon, oil, (any neutral oil), can add ghee instead, 3 to 4, green cardamoms, crushed or powdered or ½ teaspoon green cardamom powder, 12 to 15, strands of, saffron, – optional, 10 to 12, cashews",
            "Instructions": [
                "Boil the sweet potatoes first adding water as needed in a pot on the stovetop or in a pressure cooker or the Instant Pot.",
                "Drain the water and set aside the cooked sweet potatoes to become warm. The sweet potatoes should be fork tender and softened well after cooking.",
                "When the sweet potatoes become warm, peel and mash them with a potato masher.",
                "Heat oil or ghee in a heavy kadai (wok) or pan.",
                "First fry the cashews.",
                "Remove when they become golden and keep aside.",
                "Stir well and sauté for 3 to 4 mins on medium-low to medium heat.",
                "Add sugar. Mix and sauté for 4 to 5 mins on medium-low to medium heat.",
                "Now add cardamom powder and stir to mix.",
                "Add saffron and mix again.",
                "Keep on stirring and cooking the halwa till the oil or ghee starts to leave the sides of halwa. This will take approx. 10 to 12 minutes on a medium-low to medium heat."
            ],
            "Description": "Here’s one of the not so popular Shakarkandi or Sweet Potato, which I quite like because it is one of those vegetables that can be naturally turned into many sweet dishes. Just like this Sweet Potato Halwa. It is an easy and quick dessert that you can make for any occasion as well. This Shakarkandi ka Halwa recipe is gluten free and vegan (when not using ghee), and is perfect during vrats/fasts, any other festive celebrations or even when you want to have something sweet as well as nutritious.",
            "Prep Time": "20 minutes",
            "Cook Time": "20 minutes",
            "Total Time": "40 minutes",
            "Cuisine": "North Indian",
            "Course": "Desserts, Sweets"
        },
        {
            "Title": "Javvarisi Payasam | Saggubiyyam Payasam | Sago Payasam",
            "Ingredients": "1, tablespoon, (clarified butter), 10 to 12, cashews, 1, tablespoons, raisins, ½, cup, javvarisi, (sago, saggubiyyam or tapioca pearls), 3, cups, water, 2, cups, whole milk, ½, cup, sugar, or add as required, ½, teaspoon, green cardamom powder, 1, pinch, saffron, – optional, 1, pinch, edible camphor, – optional",
            "Instructions": [
                "In a heavy kadai or pan, take 1 tablespoon ghee and heat it on a low to medium flame.",
                "When the ghee melts, add 10 to 12 cashews (kaju).",
                "Begin to fry the cashews on a low heat.",
                "Fry cashews till they become golden. Remove with a slotted spoon and keep them aside.",
                "Then add 1 tablespoons raisins (kishmish).",
                "Stirring often fry the raisins, till they swell and become plump.",
                "Remove fried raisins with a slotted spoon and keep them aside along with the fried cashews.",
                "Now add ½ cup sago.",
                "Mix the sago well with the ghee and begin to roast on a low flame stirring often.",
                "Roast for 2 to 3 minutes on low flame.",
                "Then add 3 cups water.",
                "Mix well and simmer on low to medium heat.",
                "The sago pearls will begin to get cooked and start floating on the top.",
                "When cooking the javvarisi pearls, there will be some scum on top. If you want you can remove the scum with a slotted spoon.",
                "Do stir at intervals when the sago pearls are cooking, so that they do not stick at the bottom of the pan.",
                "Simmer until you see the sago pearls becoming translucent and floating on top.",
                "Then add 2 cups full fat milk. mix well.",
                "Add ½ cup sugar and stir well so that all the sugar granules dissolves.",
                "Add ½ teaspoon green cardamom powder and 1 pinch saffron. You can skip saffron strands also.",
                "Simmer the payasam on a low heat till the sago pearls have cooked well and softened.",
                "Do stir often so that the javvarisi does not get stuck at the bottom.",
                "Simmer until all the sago has cooked well. Cooking sago takes about a total of 20 to 25 minutes on a low heat right from the start when they are cooked in water.",
                "Do remember to stir so that the sago does not stick to the bottom of pan and become lumpy.",
                "Check the pearls and press them between your fingers. They should be completely softened and look translucent. The milk will also thicken by the time the sago pearls are cooked.",
                "Some milk solids will be stuck at the sides. Scrape them with a spoon or spatula and add back to the payasam.",
                "Keep in mind that the payasam thickens after cooling. So if you want a thin payasam, you can add some more hot milk and sugar as needed at this step.",
                "Lastly add the fried cashews and raisins along with 1 pinch edible camphor (optional). Mix well.",
                "Serve Javvarisi Payasam hot or warm or chilled as a dessert after meals. If offering to your deity, then first offer the sago payasam to the deity and later serve it to your family as prashad."
            ],
            "Description": "30 minutes flat, and you get a thick, creamy and decadent kheer, popularly known as a payasam in South India, made with an uncommon ingredient. Sago or tapioca pearls is locally called Sabudana and is the main ingredient in this South Indian style Javvarisi Payasam. This creamy sweet pudding made with sago, milk, ghee and sugar is also known as Sago Payasam or Saggubiyyam Payasam in the Telugu language. The recipe is super easy and a great way of using sabudana pearls in a dessert form. It is also gluten-free.",
            "Prep Time": "5 minutes",
            "Cook Time": "25 minutes",
            "Total Time": "30 minutes",
            "Cuisine": "South Indian, Tamil Nadu",
            "Course": "Desserts, Sweets"
        },
        {
            "Title": "Lauki ki Kheer",
            "Ingredients": "1, tablespoon, or a neutral flavored oil, 200, grams, lauki, or 1 cup grated lauki (dudhi or ghia or bottle gourd or opo squash), 2.5, cups, full fat milk, 1, pinch, saffron strands, ¼ to ½, teaspoon, cardamom powder, 5, tablespoon, sugar, or add as required, 5 to 6, dried rose petals,, crushed (optional), 1 to 2, teaspoon, rose water, (optional), 12 to 15, cashews, 1, tablespoon, raisins, – optional",
            "Instructions": [
                "In a thick bottomed pan, heat ghee or a neutral flavored oil. Add the lauki.",
                "Stir the lauki well and begin to saute it on a low to medium heat.",
                "Then add fresh whole milk and stir.",
                "On a low to medium heat simmer the milk stirring at intervals, so that the milk does not scorch at the bottom of the pan.",
                "Once the milk has reduced a bit, add sugar as per your taste.",
                "Then add cardamom powder and cashews.",
                "Simmer the kheer for 2 to 3 minutes more.",
                "Lastly switch off the heat and add rose water.",
                "Now you can serve lauki ki kheer hot or warm or chilled. On cooling, the consistency of the lauki kheer will thicken."
            ],
            "Description": "Lauki ki kheer recipe with step by step photos. This is an easy recipe method to make kheer from bottle gourd, milk and flavoring spices. Lauki is also known as opo squash or dudhi or ghia or doodhi.",
            "Prep Time": "5 minutes",
            "Cook Time": "25 minutes",
            "Total Time": "30 minutes",
            "Cuisine": "North Indian",
            "Course": "Desserts"
        },
        {
            "Title": "Paneer Kheer",
            "Ingredients": "3, cups, whole milk, ½, cup, crumbled chenna or grated paneer, or 50 grams of chenna or paneer (cottage cheese), 5 to 6, tablespoon, sugar, or as required, 3 to 4, green cardamoms, – powdered in a mortar-pestle or ½ teaspoon cardamom powder, 12 to 15, unsalted almonds, – chopped or sliced, 12 to 15, unsalted pistachios, – chopped or sliced, 12 to 15, unsalted cashews, – chopped or sliced, 5 to 6, strands of saffron, – optional, 1 to 1.5, teaspoon, rose water, or one drop of rose essence (optional)",
            "Instructions": [
                "Take milk in a wide-bottomed pan or saucepan and keep it on stovetop on a low to medium heat. Remember to use a heavy pan so that the milk does not burn while cooking.",
                "Stir at intervals a few times when the milk is heating up.",
                "Meanwhile crumble the paneer and keep aside.",
                "Crush the cardamoms in a mortar-pestle to a fine powder. Chop the nuts and keep aside.",
                "Whilst the milk comes to a boil, lower the heat and simmer the milk till it thickens a bit for about 5 to 6 minutes.",
                "Keep stirring the milk at intervals when it is simmering. Then add sugar and continue to cook further for 5 minutes.",
                "Stir to mix the sugar with the milk. Then add chopped almonds, pistachios, cashews, cardamom powder and saffron. Mix well and simmer for 1 or 2 minutes.",
                "Add the crumbled paneer. You can also grate the paneer and add. Since I was using fresh paneer, I crumbled it. If adding refrigerated or frozen paneer, then you can grate it. If the paneer appears dry, then just soak it warm water and then crumble or grate.",
                "Simmer for 1 minute on a low heat till the crumbled paneer gets cooked. Then add rose water and stir.",
                "Serve paneer kheer hot, warm or chilled. This kheer can be had plain and they also taste good with pooris. While serving you can garnish it with few saffron strands or chopped nuts or rose petals"
            ],
            "Description": "Paneer kheer recipe with step by step photos – This is one more quick sweet dessert recipe of kheer, that can be made for Indian festivals like Navratri, Dussehra and Diwali. This delicious Indian sweet is made with paneer, milk, nuts, sugar and flavorings.",
            "Prep Time": "5 minutes",
            "Cook Time": "20 minutes",
            "Total Time": "25 minutes",
            "Cuisine": "Indian",
            "Course": "Sweets"
        },
        {
            "Title": "Rajgira Kheer | Amaranth Kheer for Vrat",
            "Ingredients": "⅓, cup, amaranth grain, (rajgira or ramdana), 1.5, cups, water, for pressure cooking, 1, cup, milk, 4 to 5, tablespoon, sugar, or add as per taste, 12 to 15, cashews or blanched almonds,, sliced or 4 to 5 tablespoon sliced cashews or almonds, 4 to 5, green cardamoms,, crushed to a powder in mortar-pestle or ½ teaspoon cardamom powder, 7 to 8, dried rose petals,, chopped (optional)",
            "Instructions": [],
            "Description": "Rajgira kheer recipe with step by step photos. This is a simple, easy dessert made with ramdana (rajgira or amaranth grains), milk, sugar, cashews and flavored with cardamom powder.",
            "Prep Time": "10 minutes",
            "Cook Time": "10 minutes",
            "Total Time": "20 minutes",
            "Cuisine": "North Indian",
            "Course": "Desserts"
        },
        {
            "Title": "Sabudana Kheer | How to make Sabudana Kheer",
            "Ingredients": "½, cup, sabudana, or sago (tapioca pearls) – for a thicker kheer, you can add ⅔ cup of sabudana, 2, cups, water, 2, cups, whole milk, 4 to 5, tablespoons, sugar, or raw sugar – add as required, ½, teaspoon, green cardamom powder, or 4 to 5 green cardamoms crushed in a mortar-pestle, 2, tablespoon, cashews, – chopped or preferred nuts, ½, tablespoon, raisins, 3 to 4, strands of, saffron, – for garnish, optional",
            "Instructions": [
                "Rinse the sabudana pearls until the water runs clear of the starch.",
                "Cover and let the pearls get soaked in the water for 15 to 20 minutes.",
                "Later keep this pan on the stovetop and begin to cook the sabudana pearls.",
                "After 4 to 5 minutes, add the milk to the pan and continue to cook.",
                "Add sugar and green cardamom powder and simmer till the sabudana have cooked well and softened – for about 20 to 25 minutes on a low to medium heat.",
                "The sabudana pearls should be soft and look translucent after they are cooked really well. They should not be hard or dense or chewy. This means that they need to be cooked for some more time.",
                "Keep on stirring often so that the kheer or the cooked sabudana does not stick to the bottom of the pan.",
                "Turn off the heat and add cashews and raisins. Do a taste test and add more sugar if the kheer has a less sweet taste.",
                "Easily adjust the consistency of the kheer by adding less or more milk. Keep in mind that the consistency thickens on cooling.",
                "Garnish with a few saffron strands while serving.",
                "Serve Sabudana Kheer hot or warm or chilled."
            ],
            "Description": "From main course and snacks to desserts – sago or sabudana is a versatile ingredient that is used to make a variety of dishes and has many uses in Indian cuisine. It is also a favorite of us Indians, especially during the Hindu fasting or vrat season. While you may crush over the regular khichdi and vada made with sabudana, here’s an Indian dessert made with it, which is all things delish. Sabudana Kheer, the sweet pudding made with sago pearls, milk and sugar is also a popular pick as fasting food during the Hindu",
            "Prep Time": "15 minutes",
            "Cook Time": "20 minutes",
            "Total Time": "35 minutes",
            "Cuisine": "Indian, North Indian",
            "Course": "Desserts"
        },
        {
            "Title": "Makhane ki Kheer",
            "Ingredients": "1, cup, makhana, (foxnuts or phool makhana), 2, cups, whole milk, 3-4, green cardamom, – husked and powdered in a mortar-pestle, 10-12, cashews, or 10-12 almonds – blanched and sliced, 1, tablespoon, golden raisins, 3.5 to 4, tablespoon, sugar, or as required, 1, pinch, saffron, 2 to 3, teaspoons, (clarified butter)",
            "Instructions": [
                "Heat ghee in a pan.",
                "Add the phool makhana and cashews.",
                "On a low heat, roast the makhana and cashews in ghee till the makhanas become crunchy.",
                "The cashews will also get golden. Stir often while roasting them.",
                "Then remove them in a plate and keep aside. However keep the cashews separate from the makhana as we will be making a powder of the roasted makhana.",
                "Heat whole milk in a sauce pan or a thick bottomed pan on medium-low to medium heat.",
                "Whilst the milk is getting heated up, reserve ⅓ cup of the roasted makhana and add the remaining in a grinder or blender jar. Add cardamom seeds from 4 green cardamom pods along with a pinch of saffron strands.",
                "Grind or blend to a fine powder.",
                "When the milk comes to a boil, then add sugar.",
                "Also add the reserved ⅓ cup makhana.",
                "Mix very well.",
                "Simmer till the makhane softens and the milk thickens a bit. About 9 to 10 minutes on a low to medium heat.",
                "Scrape the evaporated milk solids from sides of the pan and add to the milk.",
                "Stir and simmer the kheer for a minute.",
                "Serve makhane ki kheer hot or warm or cold. Leftover kheer can be refrigerated. On refrigeration the kheer's consistency thickens a bit."
            ],
            "Description": "Makhane ki kheer is a sweet dessert pudding made with Makhana (foxnuts), milk, ghee, sugar and dry fruits. This is an easy and popular sweet that is often made during",
            "Prep Time": "15 minutes",
            "Cook Time": "20 minutes",
            "Total Time": "35 minutes",
            "Cuisine": "North Indian",
            "Course": "Desserts"
        },
        {
            "Title": "Coconut Ladoo Recipe | Nariyal ke Laddu Made In 3 Unique Ways",
            "Ingredients": "1.5, cups, coconut, – fresh, grated and tightly packed, 1, teaspoon, (clarified butter), ½, teaspoon, cardamom powder, or 4 to 5 green cardamoms crushed in a mortar-pestle, ½, can, sweetened condensed milk, or milkmaid – 200 grams, ⅓, cup, desiccated coconut, or fresh grated coconut – for rolling, chopped nuts or dry fruits, – of your choice, optional, 2.5, cups, desiccated coconut powder, – unsweetened, 1, cup, sweetened condensed milk, or milkmaid, ⅓, teaspoon, cardamom powder, 1, tablespoon, 3, tablespoons, desiccated coconut, – for coating ladoo, 1.5, cups, desiccated coconut powder, – unsweetened, ⅔, cup, sugar, or raw sugar, ½, cup, water, ½, teaspoon, cardamom powder, or 3 to 4 green cardamoms husked and powdered in a mortar-pestle, optional",
            "Instructions": [
                "Heat ghee in a heavy frying pan or kadai. Keep flame to a low.",
                "Stir and roast the coconut on a low flame for 3 to 4 minutes. The roasting is to just get rid of some moisture. Don't brown the coconut.",
                "then no need to roast it in ghee. Simply mix the desiccated coconut with condensed milk and heat the mixture.",
                "Now add the sweetened condensed milk and cardamom powder.",
                "Mix thoroughly and cook this mixture on a low heat.",
                "When you see that the mixture has begun to thicken, then keep stirring nonstop.",
                "When the mixture begins to leave the sides of the pan and when you see some coconut fat at the sides, switch off the heat.",
                "Pour the ladoo mixture in another bowl or pan. Allow it to cool at room temperature.",
                "When the mixture has cooled completely, pinch small to medium balls from the mixture and form ladoo.",
                "Roll the coconut ladoo in desiccated coconut or in fresh coconut evenly.",
                "You can also make all the ladoo at once and then roll in the desiccated coconut.",
                "Place them in small muffin liners or just place them in a tray.",
                "Serve coconut ladoo straight away or refrigerate and serve them later.",
                "This ladoo stay good for a week in the fridge.",
                "Keep a heavy bottomed pan or kadai on stove top. Add ghee and let it melt on a low heat.",
                "Keeping the heat to a low add the desiccated coconut powder. Mix and sauté the for 1 minute.",
                "Then add the condensed milk and mix it thoroughly with the coconut.",
                "On a low to medium-low heat with non stop stirring sauté the mixture till it starts to leave sides of pan. Then switch off the heat and add cardamom powder. Mix very well.",
                "Let the mixture become warm or cool at room temperature.  With a spoon, scoop the ladoo mixture and shape in round balls.",
                "In a plate spread the desiccated coconut evenly. Roll each ladoo in the desiccated coconut. Make all ladoo this way.  Scrape off all the mixture from the pan with a spoon and use them too to make ladoo.",
                "Serve as a sweet. Refrigerate any leftovers and these stay good for about 10 to 12 days in the fridge.",
                "Mix the sugar with the water and dissolve it. If there are impurities than strain the sugar solution.",
                "The sugar can be adjusted as per your sweet likings. For a less sweet taste you can use ½ cup sugar and for a more sweeter taste use ¾ cup sugar.",
                "Keep the sugar solution on the stove-top and on a low heat. Cook the solution. The solution will start to thicken. Continue to simmer till you get a one thread consistency in the sugar syrup.",
                "Turn off the heat and add the desiccated coconut powder and cardamom powder to the sugar syrup.",
                "Quickly stir and make small balls from the mixture. If the heat is too much too handle, wait for a few minutes till you are comfortable in shaping the laddu.",
                "The mixture should be hot or warm while making the coconut laddu. If the mixture becomes cold, then shaping the ladoo is impossible. In this case, return the pan or bowl on the fire and slightly warm the mixture and continue to make the laddu.",
                "Serve these tasty nariyal ke laddu."
            ],
            "Description": "There are many ways Coconut Ladoo (also known as Nariyal ke Laddu in Hindi) can be made. I share three delicious recipes. Prepare these tasty melt-in-the-mouth sweets, serve them as a sweet snack and watch them disappear in seconds.",
            "Prep Time": "2 minutes",
            "Cook Time": "14 minutes",
            "Total Time": "16 minutes",
            "Cuisine": "Indian, Maharashtrian",
            "Course": "Desserts, Sweets"
        },
        {
            "Title": "Shrikhand Recipe (Sweetened Flavored Yogurt)",
            "Ingredients": "4.5, cups, (yogurt) – 1.125 kg, 8 to 9, tablespoons, sugar, (fine or superfine) or raw sugar or powdered sugar – add as required, ½, teaspoon, cardamom powder, or 4 to 5 green cardamoms – crushed fine in a mortar, 24 to 30, saffron strands, or 2 pinches, ½, tablespoon, warm milk, 7 to 8, pistachios, crushed or chopped – add any nut of choice, 1.5, cups, chilled greek yogurt, or greek style yogurt  – 400 grams, ¼, teaspoon, cardamom powder, or 2 to 3 green cardamoms – crushed fine in a mortar, 2 to 3, pinches, grated nutmeg, or ⅛ teaspoon ground nutmeg, ⅓ to ½, cup, sugar, (fine or superfine) or raw sugar or powdered sugar – add as required, ½ to 1, tablespoon, warm milk, 12 to 15, saffron strands, or 1 pinch, 1 to 2, tablespoon, nuts, (of your choice) – cashews, almonds or pistachios",
            "Instructions": [
                "Pour the fresh curd. Do use fresh curd and not one which has gone sour.",
                "Now place a heavy bowl or lid or tray on the tied muslin. If you have a hook, you can also hung the muslin in your refrigerator. Now keep the whole thing in the fridge for 4 to 5 hours or overnight.",
                "I kept for 24 hours. Do use a deep bowl below, so that there is some distance between the curd in the strainer and the collected whey. Otherwise the whey will touch the strainer as well as the curd. Thus there will be some whey in the curd.",
                "Take warm milk in a small bowl. Add 2 pinch of saffron strands. Stir and keep aside.",
                "You can chill the shrikhand in fridge and later serve. While serving shrikhand, top with some sliced dry fruits. You can also top shrikhand with crushed dry fruits. I added some crushed pistachios for garnish.",
                "In a small bowl, take milk and warm it on a stove top or in a microwave. Add a pinch of saffron strands. Stir and keep aside.",
                "Then in a mixing bowl take the chilled greek yogurt.",
                "Add fine or superfine sugar or raw sugar or powdered sugar. Add sugar according to your taste. First add ⅓ cup and if required you can add 1 to 2 tablespoons more. For a more sweeter taste add ½ cup sugar.",
                "With a wired whisk and with brisk round movements, mix sugar with the yogurt, as well as beat the yogurt until it becomes smooth and without any tiny yogurt granules.",
                "You should get a smooth, creamy consistency in the yogurt.",
                "Now add the saffron soaked milk, cardamom powder and 2 to 3 pinches of nutmeg powder.",
                "Mix again very well.",
                "Cover the bowl and refrigerate for 30 minutes to a couple of hours. You can also keep overnight or for a couple of days.",
                "While serving, sprinkle some sliced or chopped nuts (almonds, cashews, pistachios, chironji) and 2 to 3 saffron strands (optional).",
                "Serve shrikhand plain as it is like a sweet dessert or have it with poori or chapati. It also makes for a dessert sweet with any vegetarian Indian main course.",
                "Store shrikhand in a covered container or box for a week in the refrigerator. For make ahead options, you can make a large batch and freeze for 1 to 2 months."
            ],
            "Description": "Shrikhand is a delicious and simple dessert recipe made with thick yogurt flavored with sugar, saffron and cardamom. Whether you choose to use homemade hung curd or take a shortcut by using store bought Greek yogurt, this easy dessert is the perfect after dinner sweet. I share two ways of making shrikhand recipe with hung curd as well as greek yogurt.",
            "Prep Time": "15 minutes",
            "Cook Time": "0 minutes",
            "Total Time": "15 minutes",
            "Cuisine": "Maharashtrian",
            "Course": "Desserts, Sweets"
        },
        {
            "Title": "Chaas Recipe (Mattha Recipe)",
            "Ingredients": "1.5, cups, (Yogurt) – 375 grams, 1, teaspoon, roasted cumin powder, (bhuna jeera powder), add as required, 1, cup, water, (cold) or as needed, 1, tablespoon, mint leaves, – chopped or coriander leaves (cilantro), optional, 5 to 6, small ice cubes, – optional, ½, teaspoon, black salt, or regular salt, add as required, 3 to 4, mint sprigs, or coriander sprigs, for garnish, 1, cup, 2 to 3, tablespoons, mint leaves, or 12 to 15 leaves  (pudina patta) or 2 to 3 teaspoons dried mint, ⅔, cup, water, (cold), 1, teaspoon, roasted cumin powder, black salt, or edible, food grade rock salt – as required",
            "Instructions": [
                "In a blender, add the curd, roasted cumin powder, mint leaves, water and salt.",
                "Blend for 2 to 3 minutes, until the ingredients are combined and the curd has been mixed well. You should see a nice frothy foamy layer with a bit of butter fat separated from the blending.",
                "Pour in glasses. Garnish with mint leaves or coriander leaves and serve immediately.",
                "You can also place the the butter milk in the refrigerator to make it cold. Then serve later.",
                "Rinse the mint leaves first. Drain all the water and then chop them roughly or keep them whole.",
                "In a blender take the curd, roasted ground cumin powder, salt, water and the mint leaves.",
                "Blend for a few minutes until smooth and you see some butter fat layer on the buttermilk.",
                "Serve Pudina Chaas in glasses.",
                "While serving, you can add a few ice cubes if you like.",
                "Garnish with mint leaves or coriander leaves and serve cold.",
                "You can also store the buttermilk in the refrigerator and serve later. Just be sure to use within one full day for the freshest taste."
            ],
            "Description": "The classic Chaas (Chaach/Mattha) also known as the Indian version of buttermilk is a refreshingly cooling summer drink made with creamy yogurt and seasonings. Here you’ll find step-by-step instructions with photos for making two chaas recipes – Masala Chaas and Pudina Chaas. Called by various names across the country this spiced Indian buttermilk drink features lots of bold, delicious spices.",
            "Prep Time": "10 minutes",
            "Cook Time": "0 minutes",
            "Total Time": "10 minutes",
            "Cuisine": "North Indian",
            "Course": "Beverages"
        },
        {
            "Title": "Cucumber Raita",
            "Ingredients": "1, cup, finely chopped cucumber, or 1 medium-sized cucumber, 1, cup, (dahi or yogurt), ½, teaspoon, kashmiri red chili powder, or ¼ teaspoon red chilli powder or cayenne pepper (optional), 1, teaspoon, roasted cumin powder, (roasted ground cumin), ½, teaspoon, chaat masala powder, or as required, salt, as required, can add food grade rock salt or black salt, 1, tablespoon, chopped coriander leaves, or 1 tablespoon chopped mint leaves",
            "Instructions": [
                "Rinse the cucumber. Then peel and finely chop it. You can also grate cucumber.",
                "In a bowl, whisk the curd (yogurt) until smooth.",
                "Add all the ground spice powders, salt as needed and chopped coriander leaves.",
                "Combine well and serve.",
                "You can garnish it with some coriander leaves or mint leaves.",
                "Cucumber raita can be served as a side dish with some vegetable curry, lentils, with a side of roti or naan.",
                "You can serve it with stuffed parathas as well. Aloo paratha, gobi paratha, broccoli paratha, mooli paratha or any stuffed paratha tastes pairs nicely.",
                "Serving it with biryani and pulao makes it so tastier. It also tastes great with khichdi, dal and steamed rice.",
                "And yes, you can also serve cucumber raita as a dip with fresh, roasted or baked veggies.Storage",
                "Leftovers can be stored only for a day in a refrigerator. It is best had fresh and the taste changes when you refrigerate it. So only make amounts of it that you can finish in one day."
            ],
            "Description": "Cucumber raita is a popular savory condiment made with cucumber and curd (yogurt). It is simple, refreshing, and cooling to the palate. This cucumber raita recipe comes together in 5 minutes and tastes fabulous when paired with biryani, pulao, or any Indian meal.",
            "Prep Time": "5 minutes",
            "Cook Time": "0 minutes",
            "Total Time": "5 minutes",
            "Cuisine": "North Indian",
            "Course": "Side Dish"
        },
        {
            "Title": "Sweet Potato Cutlet | Sweet Potato Tikki",
            "Ingredients": "4, sweet potatoes, (shakarkandi), medium-sized, 1, teaspoon, ginger-green chili paste, 2 to 3, tablespoons, arrowroot flour, or buckwheat flour or water chestnut flour or amaranth flour, 1, teaspoon, chaat masala, ½, teaspoon, dried mango powder, (amchur powder), 1, teaspoon, lemon juice, 1, teaspoon, crushed roasted cumin, or cumin powder, ½, teaspoon, red chilli powder, or cayenne pepper, ¼, teaspoon, rock salt, – edible and food grade, (sendha namak) or black salt as required, 2 to 3, tablespoons, oil, for frying or add as required",
            "Instructions": [
                "Rinse the sweet potatoes thoroughly in water.",
                "Roast them in the oven till they are soft and cooked.",
                "You can also boil them in a pan with water and salt.",
                "Or else pressure cook with enough water and salt till they become soft.",
                "To pressure cook place the sweet potatoes in a 3 litre pressure cooker. Add water as needed covering the sweet potatoes.",
                "Pressure cook for 3 to 4 whistles on medium heat. When the pressure drops naturally in the cooker, then only open the lid.",
                "Drain the water, let them cool and peel.",
                "With a potato masher, mash the sweet potatoes well.",
                "Add all the ingredients except oil. Mix well.",
                "Shape into medium sized cutlet, tikkis or patties.",
                "Pan fry the patties with oil till both the sides are well browned.",
                "Garnish with some coriander leaves.",
                "Serve Sweet Potato Cutlet with a chutney."
            ],
            "Description": "When it comes to Indian religious festivals, food for fasting or vrats is as important as any other aspect of the celebrations. During such times, many dishes like this Sweet Potato Cutlet or the Sweet Potato Tikki, are made with a variety of vegetables and fruits, minus onion, garlic, etc. This Sweet Potato Patties is the perfect snack for your",
            "Prep Time": "10 minutes",
            "Cook Time": "20 minutes",
            "Total Time": "30 minutes",
            "Cuisine": "Indian",
            "Course": "Snacks"
        },
        {
            "Title": "Sabudana Chivda | Sabudana Namkeen",
            "Ingredients": "½, cup, nylon sabudana large pearls, ¼, cup, peanuts, ¼, cup, raisins, ¼, cup, cashews, ¼, teaspoon, red chili powder, or 1 green chili – chopped, ½, teaspoon, powdered sugar, or as required, rock salt (edible and food grade) as required, oil for deep frying",
            "Instructions": [
                "Cover the jar tightly and shake it, so as to mix the seasonings with the sabudana and dry fruits. Store sabudana chivda at room temperature."
            ],
            "Description": "If there’s one ingredient that’s ubiquitous in the food prepared during fasts or vrats in India, it has got to be sabudana (sago). While this",
            "Prep Time": "5 minutes",
            "Cook Time": "25 minutes",
            "Total Time": "30 minutes",
            "Cuisine": "Indian",
            "Course": "Snacks"
        },
        {
            "Title": "French Fries Recipe (Crispy & Perfect)",
            "Ingredients": "315, grams, potatoes, or 3 medium-sized or 2 large – russet, idaho, yukon gold or maris piper, 3.5, cups, cold water, oil, for deep frying – as required, ½, teaspoon, dried rosemary, or dried oregano or mixed herbs – as required, ½, teaspoon, red chili powder, or paprika or cayenne pepper as required – optional, salt, as required, can use black salt or edible rock salt or pink salt",
            "Instructions": [
                "Firstly take the potatoes and rinse well in water. Then peel them.",
                "Then slice the potato in slices having 1 cm thickness. Before slicing, you can remove the top and bottom part of the potato to get a square or rectangle shaped potato.",
                "Then begin to cut them in sticks having 1 cm width. Rinse these potato sticks for a couple of times in water to get rid of the extra starch.",
                "In a bowl take 3.5 cups cold water and place the potatoes in it. Keep this bowl outside or in the refrigerator for 30 minutes to 45 minutes. In a hot and humid climate keep the bowl in the fridge.",
                "After 30 minutes or 45 minutes, drain the potatoes in a colander.",
                "Rinse the potatoes in clean fresh water using a colander or mesh strainer. Drain all the water.",
                "Then place them on clean kitchen cotton napkin.",
                "Fold the napkin above and press, pat and dry the potatoes. The potatoes have to be completely dried before you begin to fry them.",
                "Heat oil in a wok or pan over medium-low or medium heat. For a heavy pan, keep medium heat and for a less heavy pan, use a medium-low heat. The oil should have a temperature of 135 degrees Celsius (275 degrees Fahrenheit).",
                "Now, working in batches, add the potatoes to the oil. Do not overcrowd the wok (kadai) or pan with the potatoes. The oil will sizzle and bubble less when you fry the potatoes at this temperature.",
                "Stir at intervals while frying them for uniform cooking.",
                "Fry/blanch in oil for about 3 minutes or until the potatoes are cooked, but not brown from outside. They should just get a crust from outside without any major color change. Light browning of the edges is fine. Remove with a slotted spoon.",
                "Place the half fried potatoes on paper kitchen towels. Stack 3 to 4 paper towels. Press some paper towels from top also to absorb extra oil. Let the half fried potatoes cool down at room temperature.",
                "Note that after removing this batch, you can fry the second batch of potatoes. By the time you fry the second batch of the potatoes, the first batch will cool down. So even though you have to fry twice, you’re using the same batch of oil all the way through.",
                "Now increase the heat to a medium-high or high. Again here for a heavy pan, use a high heat and for a less heavy pan, use medium-high heat. The oil should be hot on medium-high to high heat having a temperature of 180 to 185 degrees celsius (356 to 365 degrees Fahrenheit).",
                "Add the first batch of once-fried potatoes to the hot oil. The oil will sizzle and bubble quickly and as soon as you add the potatoes.",
                "Stir often while the potatoes fry to cook them evenly. Fry french fries for 3 minutes or until crisp and golden. The edges should become golden. Remove with a slotted spoon.",
                "Place french fries on paper tissues again to remove the extra oil.",
                "After drying them thoroughly, mix and coat the potato sticks with 2 tablespoons oil. Take a batch and line the sticks evenly in the air-fryer basket. You can also line the potatoes on a parchment paper in the basket.",
                "Before air-frying, preheat the air-fryer at 180 degrees Celsius (356 degrees Fahrenheit) for 5 to 6 minutes.",
                "Place the air-fryer basket with the potato sticks in the air-fryer. Air-fry for about a total time of 10 to 12 minutes.",
                "Half way through after about 5 to 6 minutes, shake the basket or turn over each fry with tongs or a spoon. Air fry again for 5 to 6 minutes until golden.",
                "Remove the air-fried fries in a bowl. Work in batches this way and make air-fryer french fries.",
                "While still hot, take the french fries (whether deep fried or air-fried) in a bowl. Sprinkle with some salt, paprika or red chili flakes, dried herbs or dry rosemary. You can add your choice of herbs and spices.",
                "Gently shake and toss the bowl so that the salt, herbs mix evenly with the fries",
                "Serve these homemade french fries hot with any dip or sauce of your choice.",
                "Tomato ketchup and",
                "are our favorite dips to go with french fries. We also like to serve with some",
                ".",
                "For freezing and storing french fries in large quantities, fry/blanch the potatoes in hot oil first for about 3 minutes. Remove and drain on paper towels.",
                "Wipe the extra oil with kitchen paper towels and when cooled, line the half-fried potatoes on a tray. Cover the tray with a kitchen napkin and freeze for an hour.",
                "Remove the frozen fries from the tray and transfer to a zip-lock bag or a container and store in your freezer.",
                "Now you can deep fry, bake or air-fry these frozen fries. When cooking the fries with any of these methods, you do not need to thaw the frozen finger chips.",
                "While deep frying, heat oil until medium or medium-high hot and deep fry the fries until golden and crisp. Sprinkle salt or ground spices, herbs and serve straight away.",
                "Remove and add in salt and herbs. Toss, mix and serve hot."
            ],
            "Description": "If you have a hankering for crispy on the outside, creamy on the inside, perfectly salted French Fries, then look no further. I have a homemade Finger Chips recipe that will rival anything the fast food chains can offer, all from the comfort of your own home. I share both the classic deep frying method and the healthier air fried technique to make everyone’s favorite French Fries.",
            "Prep Time": "5 minutes",
            "Cook Time": "25 minutes",
            "Total Time": "30 minutes",
            "Cuisine": "World",
            "Course": "Snacks, Starters"
        },
        {
            "Title": "Fruit Chaat",
            "Ingredients": "½, cup, chopped banana, or 2 medium-sized, chopped in ½ inch rounds, 1, cup, chopped mangoes, or 1 medium to large, chopped in ½ to 1 inch cubes, 1, cup, chopped apples, or 1 large,  chopped in ½ to 1 inch cubes, 1, cup, sweet potatoes, – boiled, peeled and chopped in ½ to 1 inch cubes or 2 small sweet potatoes – optional, 1, cup, chopped potato, chopped in ½ to 1 inch cubes or 1 large potato – can boil potatoes instead of frying, 2, teaspoons, lemon juice, or add as required, 1, teaspoon, chaat masala, 1, teaspoon, roasted cumin powder, ½, teaspoon, red chili powder, or cayenne pepper, add as required, ½, teaspoon, black salt, or add as required",
            "Instructions": [
                "Before you make the fruit chaat, boil the sweet potatoes and fry the potatoes. You can boil or steam the sweet potatoes in an Instant pot or a steamer or a stovetop pressure cooker adding water as required.",
                "Rinse the potatoes in fresh water. Peel and chop them in ½ to 1 inch cubes. Heat ½ cup of oil or as required for frying the potatoes in a pan.",
                "When the oil becomes medium hot add the potatoes. Fry them until lught golden or golden.",
                "Place the fried potatoes on kitchen paper towels to absorb excess oil.",
                "Chop the fruits. If you want you can rub a bit of lemon juice on the banana slices and apple cubes so that they don't get browned and also gives a sour hint to the fruits.",
                "In a bowl add the chopped fruits one by one. Add the boiled sweet potato cubes and the fried potatoes.",
                "Add lemon juice. For the best taste use fresh lemon juice.",
                "Add all the spice powders and black salt or reqular salt to taste. Toss and mix well so that the ground spices and seasonings coat the fruits and tubers.",
                "Check the seasonings and add more salt or lemon juice if necessary."
            ],
            "Description": "Enjoy this refreshing Delhi-style tasty fruit chaat with sweet, savory, spicy, and tangy flavors at home! Add seasonal fruits and tubers such as potatoes and sweet potatoes to make the perfect fruit chaat. Prepare in about 30 minutes and serve as a snack.",
            "Prep Time": "15 minutes",
            "Cook Time": "15 minutes",
            "Total Time": "30 minutes",
            "Cuisine": "Indian",
            "Course": "Snacks"
        },
        {
            "Title": "Arbi Sabji | Arbi Recipe | Ghuiya Ki Sabji",
            "Ingredients": "250, grams, colocasia roots, (arbi or ghuiya or taro root), water, as needed to cook arbi, 1.5, teaspoon, carom seeds, (ajwain), 1, teaspoon, 1, teaspoon, red chili powder, or cayenne pepper, 1, teaspoon, dry mango powder, (amchur), oil, for frying, as needed, 1, tablespoon, chopped mint leaves, or coriander leaves, for garnish, rock salt, (edible and food grade) or sendha namak if making for religious fast (or regular salt for other days)",
            "Instructions": [
                "First rinse the taro roots thoroughly under running water to remove any soil or mud from them. Then opt to Pressure cook, steam or microwave the taro roots till they are almost cooked and tender.",
                "Remember not to overcook the tarot roots as they will become too mushy and pasty.",
                ", take some water in a microwave safe bowl just about covering the arbi. Microwave on high for 5 to 6 minutes or more until the taro roots are almost cooked.",
                "For pressure cooking, in a 2 litre pressure cooker, add the arbi with water covering them entirely. Pressure cook on medium heat for 1 whistle. Let the pressure drop naturally in the cooker and then only open the lid.",
                "Drain all the water and let the arbi cool or become warm. Peel of the skins from each taro root.",
                "Now if you want then lightly press the arbi between your palms to flatten them slightly.",
                "Shallow or deep fry the arbi in moderately hot oil oil till golden brown.",
                "In another pan, add little oil – about 1 to 2 teaspoons",
                "Garnish Arbi Sabji with some chopped mint leaves or coriander leaves and serve hot."
            ],
            "Description": "It is true that with a bit of thinking and using your creativity, you can create the most amazing yet simple dishes with something unusual too. Just like this Arbi Sabji which is made with a not so popular, yet really nutritious and tasty produce that Mother Nature has in store for us – Taro Roots (called Arbi and Ghuiya in Hindi). This Arbi Recipe or Ghuiya ki Sabji is crispy, perfectly spiced and the easiest way you can have a variation in your everyday meals.",
            "Prep Time": "30 minutes",
            "Cook Time": "30 minutes",
            "Total Time": "60 minutes",
            "Cuisine": "Indian, North Indian",
            "Course": "Main Course, Side Dish, Starters"
        },
        {
            "Title": "Kele ka Kofta | Banana Kofta",
            "Ingredients": "400, grams, plantain, or 3 medium to large raw unripe bananas, 1.5, cups, water, – for pressure cooking, 10, cashews, (chopped) or 14 to 16 roasted peanuts – coarsely crushed, ½, inch, ginger, peeled & finely chopped or ½ teaspoon finely chopped ginger, 1, green chili, – finely chopped or ½ teaspoon, ½ to 1, teaspoon, freshly crushed black pepper, ½, teaspoon, cumin powder, 1, teaspoon, mint leaves, – finely chopped, 2, tablespoon, arrowroot flour, or water chestnut flour or buckwheat flour or amaranth flour, rock salt, (edible and food grade) as required, 2, tablespoons, peanut oil, or ghee for pan frying",
            "Instructions": [
                "First rinse the plantains in water a few times.",
                "Take the unripe bananas or plantains in a 2 litre stovetop pressure cooker. Add 1.5 cups water. You can also halve the plantains and then add them to the cooker.",
                "Pressure cook on medium heat for 3 whistles or till the bananas have complete softened.",
                "Let the pressure drop naturally in the cooker, then only open the lid. Drain the water and set aside the cooked plantains to cool.",
                "Once they become warm, peel them and place in a mixing bowl.",
                "Then add all of the other ingredients, except oil. Mix very well.",
                "Heat peanut oil in a flat pan or skillet. When the oil becomes hot, place the koftas.",
                "Flip for a couple of times more and pan fry the koftas till they become golden and crispy.",
                "Then place the fried koftas on kitchen paper towels.",
                "Serve Banana Kofta with coconut chutney or coriander chutney or mint chutney."
            ],
            "Description": "Kele ka Kofta recipe with step by step photos. Also referred to as Banana Kofta, these are crisp, spiced pan fried patties made with raw unripe green bananas or plantains. All you need are a few plantains, some Indian spices, herbs and a binding flour to make these tasty kofta.",
            "Prep Time": "15 minutes",
            "Cook Time": "15 minutes",
            "Total Time": "30 minutes",
            "Cuisine": "North Indian",
            "Course": "Snacks"
        },
        {
            "Title": "Roasted Makhana (Phool Makhana Recipe)",
            "Ingredients": "3, cup, foxnuts, (makhana or phool makhana), ¼, teaspoon, turmeric powder, ½, teaspoon, red chili powder, or cayenne pepper, add as required, 1, teaspoon, chaat masala powder, or add as required, rock salt, (edible and food grade), add as required, 2 to 3, teaspoons, oil, or ghee",
            "Instructions": [
                "Heat oil in a heavy wok or kadai.",
                "Add the makhana and roast for a good 10 to 12 minutes on low heat, till they become crisp. Keep on stirring in between.",
                "Next, add all the spice powders and rock salt, except chaat masala.",
                "Turn off the heat as you don't want the spice powders to get burnt.",
                "Lastly, sprinkle the chaat masala powder and again mix well.",
                "Serve Roasted Makhana when they become lukewarm or cool at room temperature.",
                "Remember that once they cool down, store in an air-tight container."
            ],
            "Description": "From being a superfood loaded with health benefits, a popular ingredient during vrat (Hindu fasting) season, an auspicious offering to Gods and Goddesses, a healthy snack option and more – makhana/phool makhana is truly a marvelous food. The Roasted Makhana is the easiest way in which you can consume this nutritious edible part of the prickly water lily plant. Follow the steps of this Roasted Makhana recipe (Phool Makhana recipe) and enjoy it with your family and friends.",
            "Prep Time": "",
            "Cook Time": "10 minutes",
            "Total Time": "",
            "Cuisine": "Indian",
            "Course": "Snacks"
        },
        {
            "Title": "Sabudana Pakoda | Sabudana Pakora",
            "Ingredients": "½, cup, sabudana, (tapioca pearls), 1, large potato, ¾, teaspoon, cumin seeds, ½ to 1, teaspoon, sugar, 1, green chili, , chopped, 2, tablespoon, kuttu ka atta, (buckwheat flour), ¼, cup, peanuts, rock salt, (edible and food grade) or sendha namak, add as required, oil, as needed for frying",
            "Instructions": [
                "Soak the sabudana or tapioca pearls in enough water overnight or for 4 to 5 hours.",
                "Later drain all of the water very well using a strainer and keep aside the sabudana in a mixing bowl.",
                "Mix the ingredients really well using a spoon or with clean hands. Check the taste and add more salt or sugar if required.",
                "Make small balls with your hands or using a spoon drop the mixture in to medium hot oil. Keep the heat to medium to medium-high.",
                "Let the pakoras become opaque and then turn them with a slotted spoon.",
                "First let the sabudana pakoda become opaque and lightly golden while frying and then turn them with a slotted spoon. Don’t be in a hurry to turn them as this will break them in the oil. So first let the pakoda firm up and become light golden before turning over.",
                "Deep fry the second side till they are golden and crisp. You can turn them a few times with a slotted spoon as needed to get an even golden color.",
                "Once perfectly fried, then remove them carefully with a slotted spoon draining as much oil as possible.",
                "Place them on paper napkins to remove excess oil.",
                "Serve sabudana pakodas hot or warm with tomato sauce or green chutney or coconut chutney. If you are making them for fasting then serve them with phalahari chutney.",
                "Best to have them hot for best taste."
            ],
            "Description": "Sabudana pakoda recipe with step-by-step photos – sabudana pakora is yet another snack that can be made during fasting or",
            "Prep Time": "",
            "Cook Time": "20 minutes",
            "Total Time": "",
            "Cuisine": "North Indian",
            "Course": "Snacks"
        },
        {
            "Title": "Samak Rice Pulao (Barnyard Millet Recipe)",
            "Ingredients": "1, cup, sama ke chawal, or vrat ke chawal or samvat rice or samak rice or barnyard millet, water, as required, for soaking, 1, inch, ginger, – peeled and roughly chopped, 1, green chilli, – roughly chopped, 2, tablespoons, peanuts, 2, tablespoon, or oil, 1, teaspoon, cumin seeds, ½, inch, cinnamon stick, 2 to 3, cloves, 2, green cardamoms, 3 to 4, black peppercorns, 8 to 10, curry leaves, 1, tablespoon, coriander leaves, – chopped, 2, potatoes, – medium-sized, peeled and cubed, 2.5 to 3, cups, water, or add as needed, rock salt, (edible and food grade) as required (sendha namak), 1, tablespoon, coriander leaves, – chopped, 8 to 10, cashews, 8 to 10, almonds, – sliced, lemon juice, or lemon wedges, as required",
            "Instructions": [
                "Rinse the samak rice or barnyard millet a couple of times in water like the way we rinse rice.",
                "Soak in enough water for 20 to 30 minutes.",
                "After 20 to 30 minutes, drain all the water and set the soaked barnyard millet aside.",
                "Crush the ginger and green chilli to a paste in a mortar-pestle. You can crush to a semi-fine or a fine paste.",
                "Heat oil or ghee in a 3 litre pressure cooker. Keep the heat to low or medium-low.",
                "Add all the whole spices – cumin, cinnamon, cloves, cardamom and black peppercorns.",
                "Fry till the oil become fragrant and the cumin crackles.",
                "Add the crushed ginger-green chilli paste and sauté for half a minute on a low heat.",
                "Add the cubed potatoes, curry leaves, coriander leaves and sauté for 3 to 4 minutes on a low heat.",
                "Now add the peanuts powder and stir to combine. Keep heat to a low.",
                "Add the samak rice to the sautéed mixture. Mix and stir very well.",
                "Add water and salt as required. Pressure cook on medium heat for 4 to 5 whistles or till the water is absorbed and the millet grains are cooked.",
                "When the pulao is cooking, you can dry roast the chopped cashews and almonds.",
                "When serving the Samak Rice Pulao, garnish with the the roasted nuts and coriander leaves."
            ],
            "Description": "Not really rice, but a seed, samak/sama/samvat/samo/bhagar or barnyard millet is a popular ingredient, especially used in dishes made during the religious Hindu fasting days in India. For instance, this Samak Rice (also known as Sama ke Chawal ka Pulao or Vrat ke Chawal ka Pulao or Samvat Pulao) is made as vrat food particularly during",
            "Prep Time": "30 minutes",
            "Cook Time": "15 minutes",
            "Total Time": "45 minutes",
            "Cuisine": "North Indian",
            "Course": "Main Course"
        },
        {
            "Title": "Kaddu ki Sabji | Easy Pumpkin Recipe",
            "Ingredients": "1, small pumpkin, (kaddu), ¼, teaspoon, fenugreek seeds, (methi seeds), 1, teaspoon, cumin seeds, 1 or 2, dry red chilies, (optional), ½, teaspoon, red chili powder, ½, teaspoon, turmeric powder, ¼, teaspoon, 1, teaspoon, dry mango powder, (amchur), 1, teaspoon, sugar, or 2 teaspoon crushed jaggery, 2, tablespoon, oil, ¾, cup, water, or 1 cup water, a few chopped coriander leaves for garnishing, (optional), rock salt (edible and food grade), or sendha namak (or you can use common salt if not making during religious fasting)",
            "Instructions": [
                "Wash the pumpkin. Peel and chop the pumpkin in small cubes.",
                "Add the fenugreek seeds and cumin seeds and fry for a minute on a low heat.",
                "Now add the deseeded red chilies and fry for some 15 seconds. The addition of red chilies is optional or swap them with green chilies.",
                "Cover the cooker with a lid and pressure cook for 7 to 8 minutes on medium heat.",
                "If you do not have a pressure cooker then cover the pan with a lid and cook the pumpkin for some 15-20 minutes till they become soft and mushy. You can also make this dish in the Instant pot adding water as required.",
                "If the sabzi still looks watery to you, then evaporate the water from the sabzi by cooking it without the lid. It it has become too thick or pasty, then add some hot water to thin the consistency a bit.",
                "This kaddu ki sabzi should not be dry nor watery or runny, just in between.",
                "Garnish with coriander leaves and serve kaddu ki sabzi hot with poori or roti."
            ],
            "Description": "This Kaddu ki Sabji is a super easy and delicious dish made with pumpkin, whole spices and herbs. The recipe does not include onions and garlic. It is an easy and delicious vegan pumpkin recipe that can be made on regular days and also during",
            "Prep Time": "20 minutes",
            "Cook Time": "15 minutes",
            "Total Time": "35 minutes",
            "Cuisine": "Indian",
            "Course": "Main Course"
        },
        {
            "Title": "Vrat ki Kadhi | Rajgira Kadhi for Fasting | Farali Kadhi",
            "Ingredients": "1, cup, full fat fresh curd, (yogurt) at room temperature or 240 to 250 grams curd, 3, tablespoon, amaranth flour, (rajgira atta), ½, teaspoon, cumin seeds, 1 to 1.5, teaspoon, ginger-green chili paste, or ½ inch ginger + 1 to 2 green chilies crushed in a mortar-pestle, ½, cup, water, ¼ to ½, teaspoon, sugar, or add as required, 2, tablespoon, or peanut oil, 1 to 2, tablespoon, chopped coriander leaves for garnish, rock salt (edible and food grade) as required",
            "Instructions": [
                "Lower the flame and then add the curd mixture. Season with rock salt (sendha namak).",
                "Stir very well and allow the rajgira kadhi to simmer. Do stir on occasions. The kadhi will thicken."
            ],
            "Description": "Vrat ki kadhi recipe with step by step photos – mildly flavored and spiced yogurt sauce made for Navratri fasting or vrat.",
            "Prep Time": "3 minutes",
            "Cook Time": "12 minutes",
            "Total Time": "15 minutes",
            "Cuisine": "North Indian",
            "Course": "Main Course"
        },
        {
            "Title": "Samvat Rice Khichdi | Sama Chawal Khichdi | Vrat ki Khichdi",
            "Ingredients": "1, cup, sama ke chawal, (barnyard millet or samvat rice), ½, cup, cubed potatoes, (aloo), 1, teaspoon, cumin seeds, (jeera), ½, teaspoon, black pepper, (kuti hui kalimirch) – crushed in a mortar-pestle, 1 to 1.5, teaspoon, ginger-green chili paste, (adrak aur hari mirch ka paste) or ½ inch ginger and 1-2 green chilies – crushed in a mortar-pestle, 3, cups, water, 2, tablespoon, or peanut oil (moonghphali ka tel), 2, tablespoon, chopped coriander leaves, (dhania patta), rock salt (edible and food grade), (sendha namak) as required",
            "Instructions": [],
            "Description": "Samvat rice khichdi with step by step photos – simple, easy and healthy khichdi made with sama ke chawal also known as barnyard millet. It makes for a filling and comforting meal served with vrat ki kadhi or plain yogurt or any curry dish made for Hindu fasting days.",
            "Prep Time": "",
            "Cook Time": "35 minutes",
            "Total Time": "",
            "Cuisine": "North Indian",
            "Course": "Main Course"
        },
        {
            "Title": "Vrat wale Aloo | Vrat ke Aloo",
            "Ingredients": "3, medium potatoes, (aloo), 3, medium tomatoes, or about 1 cup of chopped tomatoes, 1 or 2, green chilies,, chopped (hari mirch), ½, teaspoon, ajwain, (carom seeds) or cumin seeds (jeera), 1.5 to 2, cups, water, 2, tablespoon, oil, rock salt (edible and food grade), or sendha namak as required",
            "Instructions": [
                "Rinse the potatoes very well in fresh water. Then add the potatoes with 3 cups water in the pressure cooker.",
                "Boil the 3 potatoes in the pressure cooker for 4 to 5 whistles, till the potatoes cook and soften.",
                "Directly crumble the 3 boiled potatoes in the tomato gravy. Stir and mix well.",
                "Add 2 cups of water, stir well. Sprinkle sendha namak as required."
            ],
            "Description": "Vrat wale aloo recipe with step by step photos. This Vrat ke aloo recipe are made during fasting/",
            "Prep Time": "15 minutes",
            "Cook Time": "15 minutes",
            "Total Time": "30 minutes",
            "Cuisine": "North Indian",
            "Course": "Main Course"
        },
        {
            "Title": "Kuttu Khichdi | Buckwheat Khichdi",
            "Ingredients": "2, tablespoon, peanuts, – raw, 1, tablespoon, or 1 tablespoon peanut oil, ½, teaspoon, cumin seeds, 1, green chili, – chopped or 1 teaspoon chopped, ½, inch, ginger, – finely chopped, 2, potatoes, medium-sized, chopped in small cubes, 1, cup, buckwheat groats, (kuttu), 2, cups, water, or add as needed, 1, teaspoon, raw sugar, or regular sugar, add as required, rock salt, – edible and food grade, add as required, (sendha namak or upwas ka namak), 1 to 2, tablespoons, chopped coriander leaves, lemon juice, as required, optional",
            "Instructions": [
                "Roast peanuts in a frying pan or tawa till they become crunchy and golden. Let them cool.",
                "Heat ghee or oil in a pan or pot. Add the cumin and on low heat saute till they crackle.",
                "Add the potato cubes. Saute for 2 to 3 minutes on medium heat stirring often till the potatoes become crisp from the edges. Its better to chop the potatoes in smaller cubes, so that they cook faster.",
                "Add the ground peanuts and saute for half a minute. Later add the rinsed buckwheat. Stir well and saute for 1 to 2 minutes on low to medium-low heat.",
                "Add the water, sugar and edible rock salt. Stir and mix very well.",
                "Cover the pan with its lid and simmer the buckwheat khichdi on a low to medium-low heat.",
                "Cook till all the water is absorbed and the buckwheat has softened and cooked well. While the buckwheat khichdi is simmering do check a few times to see if the water has not dried.",
                "If the water looks less and the buckwheat groats are half cooked then add some water as needed and gently stir. Cover and continue to cook the buckwheat.",
                "Serve buckwheat khichdi hot or warm drizzled with lemon juice if you like."
            ],
            "Description": "Kuttu ki khichdi or Buckwheat khichdi with step by step photos – yet another easy and quick",
            "Prep Time": "15 minutes",
            "Cook Time": "15 minutes",
            "Total Time": "30 minutes",
            "Cuisine": "Indian",
            "Course": "Main Course"
        }
    ],
    "recipe_count": 78
}